{
  "source": "2025-10-11.json",
  "entities": [
    {
      "name": "ElizaOS",
      "type": "project",
      "description": "A platform for agent-governed financial systems, focusing on decentralized operations, advanced agent intelligence, and a modular plugin ecosystem. It aims to provide a stable and scalable environment for autonomous agents and financial products.",
      "aliases": [
        "ElizaOS"
      ]
    },
    {
      "name": "AI16Z",
      "type": "token",
      "description": "A cryptocurrency token that is undergoing a migration to the ElizaOS token. It experienced significant price volatility during market downturns.",
      "aliases": [
        "AI16Z",
        "$AI16Z"
      ]
    },
    {
      "name": "Capacitor.js",
      "type": "project",
      "description": "A JavaScript framework that allows developers to build cross-platform mobile apps from web code. It prioritizes faster deployment, code reuse, and sufficient performance for form-heavy applications.",
      "aliases": [
        "Capacitor.js"
      ]
    },
    {
      "name": "React Native",
      "type": "project",
      "description": "A JavaScript framework for building native mobile applications using React. It is known for enabling the development of high-performance, true native apps.",
      "aliases": [
        "React Native"
      ]
    },
    {
      "name": "AWS ECR",
      "type": "project",
      "description": "Amazon Web Services Elastic Container Registry, a fully managed Docker container registry that makes it easy for developers to store, manage, and deploy Docker container images. It offers better storage limits and token minting capabilities than alternatives.",
      "aliases": [
        "AWS ECR"
      ]
    },
    {
      "name": "Cloudflare",
      "type": "project",
      "description": "A network infrastructure and security company that offers services including a CDN, DNS, DDoS protection, and a container registry. Its container registry has storage limitations compared to AWS ECR.",
      "aliases": [
        "Cloudflare"
      ]
    },
    {
      "name": "WorkOS",
      "type": "project",
      "description": "An identity and access management platform that simplifies integrating features like SSO and user directories into applications. ElizaOS is transitioning its authentication system away from WorkOS.",
      "aliases": [
        "WorkOS"
      ]
    },
    {
      "name": "Privy",
      "type": "project",
      "description": "A platform that provides tools and infrastructure for building decentralized applications, including features for managing user authentication and wallets. ElizaOS is transitioning its authentication system to Privy.",
      "aliases": [
        "Privy"
      ]
    },
    {
      "name": "CCIP",
      "type": "project",
      "description": "Cross-Chain Interoperability Protocol, a standard for enabling communication and asset transfer between different blockchains. It serves as an intent/information transfer layer for token utility.",
      "aliases": [
        "CCIP"
      ]
    },
    {
      "name": "Hyperfy",
      "type": "project",
      "description": "A company or platform involved in social agent development, partnering with ElizaOS to build an 'AI RuneScape'.",
      "aliases": [
        "Hyperfy"
      ]
    },
    {
      "name": "Shaw",
      "type": "user",
      "description": "An individual involved in discussions regarding token migration strategy, SAFT allocation, and technical development choices, providing context and explanations.",
      "aliases": [
        "Shaw"
      ]
    },
    {
      "name": "Odilitime",
      "type": "user",
      "description": "A community member or team representative who provided clarifications on the ElizaOS token migration process, including start dates and the absence of a snapshot system.",
      "aliases": [
        "Odilitime"
      ]
    },
    {
      "name": "Kenk",
      "type": "user",
      "description": "An individual who shared resources on token utility and provided answers regarding migration logistics, including the exclusion of futures positions and details on cross-chain operations.",
      "aliases": [
        "Kenk"
      ]
    },
    {
      "name": "MexC",
      "type": "project",
      "description": "A cryptocurrency exchange where users had open futures positions for AI16Z. The migration process does not include these futures positions.",
      "aliases": [
        "MEXC"
      ]
    },
    {
      "name": "Ethereum Foundation",
      "type": "project",
      "description": "An organization focused on supporting and promoting Ethereum and related decentralized technologies. They are collaborating with ElizaOS on developing an agent game using the ERC-8004 specification.",
      "aliases": [
        "Ethereum Foundation"
      ]
    },
    {
      "name": "Zod v4",
      "type": "project",
      "description": "A modern data validation library used to improve reliability across multiple repositories within the ElizaOS ecosystem. An upgrade to this version was a key strategic initiative.",
      "aliases": [
        "Zod v4"
      ]
    },
    {
      "name": "Renovate",
      "type": "project",
      "description": "An automated dependency management tool used across ElizaOS's plugin repositories to keep projects secure and up-to-date by automating routine maintenance.",
      "aliases": [
        "Renovate"
      ]
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-29T07:57:11.496947Z"
  }
}