{
  "source": "2025-08-14.json",
  "entities": [
    {
      "name": "ElizaOS",
      "type": "project",
      "description": "An AI operating system focused on social agent capabilities and tool-calling frameworks. It aims to enable building viral applications and is positioned for gaming environments, 3D worlds, and crypto audiences.",
      "aliases": [
        "elizaOS"
      ]
    },
    {
      "name": "Shaw",
      "type": "user",
      "description": "A developer or team member at ElizaOS who defends the current social agent framework and architecture.",
      "aliases": []
    },
    {
      "name": "Clank Tank 2.0",
      "type": "project",
      "description": "A governance platform that combines Shark Tank, AI, prediction markets, and DAO governance, featuring AI judges to evaluate submissions.",
      "aliases": [
        "clanktank"
      ]
    },
    {
      "name": "Jin",
      "type": "user",
      "description": "An individual who introduced Clank Tank 2.0, a governance platform.",
      "aliases": []
    },
    {
      "name": "MCP",
      "type": "project",
      "description": "Message Control Protocol, a technical protocol used in plugin development and integration for ElizaOS.",
      "aliases": []
    },
    {
      "name": "Morpheus AI",
      "type": "project",
      "description": "A decentralized compute provider that can be integrated with ElizaOS for GPU-intensive tasks.",
      "aliases": []
    },
    {
      "name": "Tapestryai",
      "type": "project",
      "description": "A project built on the ElizaOS platform.",
      "aliases": []
    },
    {
      "name": "Pixels",
      "type": "project",
      "description": "A project built on the ElizaOS platform.",
      "aliases": []
    },
    {
      "name": "Bonsai",
      "type": "project",
      "description": "A project built on the ElizaOS platform.",
      "aliases": []
    },
    {
      "name": "Comput3ai",
      "type": "project",
      "description": "A project built on the ElizaOS platform.",
      "aliases": []
    },
    {
      "name": "hyperliquid",
      "type": "project",
      "description": "A plugin associated with ElizaOS, users have reported experiencing confusion and difficulty with its documentation and integration.",
      "aliases": []
    },
    {
      "name": "3on_",
      "type": "user",
      "description": "A user who highlighted projects on ElizaOS and speculated about monetization strategies and multilingual support.",
      "aliases": []
    },
    {
      "name": "hildi",
      "type": "user",
      "description": "A community member who questioned the connection between technical advancements and the token's value, citing a lack of tokenomics and utility.",
      "aliases": []
    },
    {
      "name": "significant_otter",
      "type": "user",
      "description": "A user who asked for documentation about plugins, specifically mentioning difficulties with the hyperliquid plugin.",
      "aliases": []
    },
    {
      "name": "Kenk",
      "type": "user",
      "description": "A helper who directed a user to the #plugins-support channel for documentation.",
      "aliases": []
    },
    {
      "name": "PlayCanvas",
      "type": "project",
      "description": "A technology used for client-side rendering, specifically for the technical implementation of Clank Tank 2.0 to generate video episodes.",
      "aliases": []
    },
    {
      "name": "Maikyman",
      "type": "user",
      "description": "A user who asked about MCP tool sequencing and URL handling in plugins.",
      "aliases": []
    },
    {
      "name": "0xbbjoker",
      "type": "user",
      "description": "A helper who provided guidance on customizing MCP and addressed concerns about URL handling in plugins.",
      "aliases": []
    },
    {
      "name": "Meme Token",
      "type": "token",
      "description": "A type of token characterized by its focus on community and internet culture rather than strong fundamental utility or tokenomics. Often driven by speculative interest.",
      "aliases": []
    },
    {
      "name": "Morpheus",
      "type": "project",
      "description": "A decentralized compute provider mentioned for integration with ElizaOS for GPU-intensive tasks.",
      "aliases": []
    },
    {
      "name": "GitHub",
      "type": "project",
      "description": "A web-based platform for version control and collaboration on software development projects. It hosts repositories and facilitates issue tracking and pull requests.",
      "aliases": []
    },
    {
      "name": "Eliza cloud",
      "type": "project",
      "description": "A development project within the ElizaOS ecosystem that users are hoping will be completed soon.",
      "aliases": []
    },
    {
      "name": "Cursor",
      "type": "project",
      "description": "A code editor extension that uses AI to assist with programming tasks. Mentioned in the context of a new method of agent creation that may simplify the process.",
      "aliases": []
    },
    {
      "name": "Bun",
      "type": "project",
      "description": "A fast JavaScript runtime, bundler, and package manager. Mentioned in the context of a new method of agent creation that may simplify the process.",
      "aliases": []
    },
    {
      "name": "Shark Tank",
      "type": "project",
      "description": "A reality television show where entrepreneurs pitch their business ideas to a panel of investors. Elements of this show are incorporated into the Clank Tank 2.0 platform.",
      "aliases": []
    },
    {
      "name": "DAO",
      "type": "project",
      "description": "Decentralized Autonomous Organization, a type of organization governed by smart contracts and community members through token-based voting. This is a component of the Clank Tank 2.0 platform.",
      "aliases": []
    },
    {
      "name": "Borodin",
      "type": "user",
      "description": "An individual who opened an issue titled 'Set up telemetry to extract the training data for RULER'.",
      "aliases": [
        "@borisudovicic"
      ]
    },
    {
      "name": "Yungalgo",
      "type": "user",
      "description": "An individual who submitted a pull request to resolve issues with the `elizaos publish` command.",
      "aliases": [
        "@yungalgo"
      ]
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-29T07:47:32.925138Z"
  }
}