{
  "source": "2025-12-18.json",
  "entities": [
    {
      "name": "AI16Z",
      "type": "token",
      "description": "An older token that is in the process of migrating to ELIZAOS.",
      "aliases": [
        "ai16z"
      ],
      "visual_hints": "Possibly circular or geometric shapes, tech-themed colors like blue or green"
    },
    {
      "name": "ELIZAOS",
      "type": "project",
      "description": "A project undergoing token migration and product development.",
      "aliases": [
        "elizaOS",
        "eliza-os"
      ],
      "visual_hints": "Abstract patterns, modern and clean design, potentially using shades of blue, purple, or white"
    },
    {
      "name": "Discord",
      "type": "platform",
      "description": "A communication platform widely used by communities for discussion and collaboration.",
      "aliases": [],
      "visual_hints": "Purple color scheme, stylized game controller or chat bubble icon"
    },
    {
      "name": "GitHub",
      "type": "platform",
      "description": "A web-based platform for version control and collaboration using Git.",
      "aliases": [],
      "visual_hints": "Black and white octagonal logo, often associated with code repositories and development"
    },
    {
      "name": "Bithumb",
      "type": "platform",
      "description": "A South Korean cryptocurrency exchange.",
      "aliases": [],
      "visual_hints": "Colors associated with a financial institution, possibly red or blue, with a modern corporate look"
    },
    {
      "name": "Kraken",
      "type": "platform",
      "description": "A popular cryptocurrency exchange known for its security and wide range of listed assets.",
      "aliases": [],
      "visual_hints": "Dark background (often black or dark blue) with a stylized kraken or tentacle logo"
    },
    {
      "name": "Solana",
      "type": "token",
      "description": "A high-performance blockchain platform known for its speed and low transaction costs.",
      "aliases": [],
      "visual_hints": "Sun or solar motif, often associated with speed and efficiency, colors like orange, yellow, or blue"
    },
    {
      "name": "Starknet",
      "type": "platform",
      "description": "A decentralized Layer 2 scaling solution for Ethereum.",
      "aliases": [],
      "visual_hints": "Geometric shapes, often incorporating blues and purples, suggesting advanced technology"
    },
    {
      "name": "PostgreSQL",
      "type": "project",
      "description": "A powerful, open-source object-relational database system.",
      "aliases": [
        "Postgres"
      ],
      "visual_hints": "A stylized elephant or a shield icon, often associated with data management and reliability"
    },
    {
      "name": "Kraken (exchange)",
      "type": "platform",
      "description": "A cryptocurrency exchange where users can trade digital assets.",
      "aliases": [],
      "visual_hints": "Dark background (often black or dark blue) with a stylized kraken or tentacle logo"
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-28T07:09:53.149616Z"
  }
}