{
  "source": "2025-12-21.json",
  "entities": [
    {
      "name": "ElizaOS",
      "type": "project",
      "description": "A project focused on AI and blockchain technology. Its ecosystem includes the ElizaOS token and related products like Cloud MVP.",
      "aliases": [
        "elizaOS"
      ]
    },
    {
      "name": "AI16Z",
      "type": "token",
      "description": "A deprecated cryptocurrency token associated with the ElizaOS ecosystem. It was superseded by the ELIZAOS token.",
      "aliases": [
        "AI16Z",
        "ai16z"
      ]
    },
    {
      "name": "ELIZAOS",
      "type": "token",
      "description": "The primary cryptocurrency token of the ElizaOS ecosystem. It is intended for future utility within ElizaOS products.",
      "aliases": [
        "ELIZAOS"
      ]
    },
    {
      "name": "X",
      "type": "project",
      "description": "A social media platform, formerly known as Twitter, used for communication and potential partnerships within the ElizaOS project.",
      "aliases": [
        "Twitter"
      ]
    },
    {
      "name": "Cloud MVP",
      "type": "project",
      "description": "A Minimum Viable Product for a cloud-based service within the ElizaOS ecosystem. It is designed to showcase initial product capabilities.",
      "aliases": []
    },
    {
      "name": "Discord",
      "type": "project",
      "description": "A communication platform used by the ElizaOS community for discussions, support, and announcements. It features various channels for different topics.",
      "aliases": []
    },
    {
      "name": "GitHub",
      "type": "project",
      "description": "A platform for software development and version control, used by the ElizaOS team for managing their codebase and releases.",
      "aliases": []
    },
    {
      "name": "TradingView",
      "type": "project",
      "description": "A charting platform and social network for traders and investors, which the ElizaOS community requested integration with for improved chart functionality.",
      "aliases": []
    },
    {
      "name": "Playwright",
      "type": "project",
      "description": "An open-source toolchain for automated testing and web scraping, used in discussions for comparing with ElizaOS's capabilities.",
      "aliases": []
    },
    {
      "name": "Puppeteer",
      "type": "project",
      "description": "A Node.js library providing a high-level API to control Chrome or Chromium over the DevTools Protocol, used in discussions for comparison with ElizaOS.",
      "aliases": []
    },
    {
      "name": "Starknet",
      "type": "project",
      "description": "A decentralized ZK-Rollup network designed to allow any decentralized application to achieve smart contract scaling without sacrificing any part of the security or composability of their own. A plugin integration was worked on.",
      "aliases": []
    },
    {
      "name": "Hyperfy",
      "type": "project",
      "description": "A platform for building and deploying 3D experiences and metaverses, which released version v0.16.0 with AI integration capabilities.",
      "aliases": []
    },
    {
      "name": "ChatGPT",
      "type": "project",
      "description": "A large language model developed by OpenAI, integrated into Hyperfy v0.16.0 for AI capabilities.",
      "aliases": []
    },
    {
      "name": "Gemini",
      "type": "project",
      "description": "A large language model developed by Google, integrated into Hyperfy v0.16.0 for AI capabilities.",
      "aliases": []
    },
    {
      "name": "Grok",
      "type": "project",
      "description": "A large language model, integrated into Hyperfy v0.16.0 for AI capabilities.",
      "aliases": []
    },
    {
      "name": "BSC",
      "type": "project",
      "description": "Binance Smart Chain, a blockchain network where liquidity for ElizaOS tokens was reported to be near 1M.",
      "aliases": []
    },
    {
      "name": "Solana",
      "type": "project",
      "description": "A high-performance blockchain platform known for its speed and low transaction costs, mentioned in relation to liquidity fragmentation for ElizaOS tokens.",
      "aliases": []
    },
    {
      "name": "Borko",
      "type": "user",
      "description": "A team member associated with ElizaOS who provided updates on product momentum, roadmap, and token utility.",
      "aliases": []
    },
    {
      "name": "Omid Sa",
      "type": "user",
      "description": "A community member who provided assistance and technical advice within the ElizaOS Discord, including suggestions for bridging to BSC.",
      "aliases": []
    },
    {
      "name": "Hexx",
      "type": "user",
      "description": "A team member who provided guidance on token migration eligibility within the ElizaOS community.",
      "aliases": []
    },
    {
      "name": "Alexei",
      "type": "user",
      "description": "A team member who provided contract addresses for the ElizaOS token on multiple blockchain chains.",
      "aliases": []
    },
    {
      "name": "The Light",
      "type": "user",
      "description": "A community member who directed users to appropriate channels for migration information within ElizaOS.",
      "aliases": []
    },
    {
      "name": "FenrirFawks",
      "type": "user",
      "description": "A developer who worked on integrating a Starknet plugin into ElizaOS, encountering TypeScript compatibility issues.",
      "aliases": []
    },
    {
      "name": "Stan",
      "type": "user",
      "description": "A developer who proposed and worked on provider performance optimization, including implementing parallel execution and configurable timeouts.",
      "aliases": []
    },
    {
      "name": "Odilitime",
      "type": "user",
      "description": "A community member who provided technical assistance and shared development work, including on TypeScript issues and engagement plugins.",
      "aliases": []
    },
    {
      "name": "jintern",
      "type": "user",
      "description": "A community member who provided guidance on Web3 security and ElizaOS plugin commands.",
      "aliases": []
    },
    {
      "name": "Kenk",
      "type": "user",
      "description": "A community member who clarified the deadline and consequences for unmigrated ElizaOS tokens.",
      "aliases": []
    },
    {
      "name": "Serikiki",
      "type": "user",
      "description": "A community member who provided advice on token purchases and clarified the status of AI16Z versus ELIZAOS tokens.",
      "aliases": []
    },
    {
      "name": "Roman V",
      "type": "user",
      "description": "A community member who raised concerns about EVM support and received information on ongoing development and repository updates.",
      "aliases": []
    },
    {
      "name": "Jin",
      "type": "user",
      "description": "A community member who shared updated information on the ElizaOS knowledge repository and API endpoints.",
      "aliases": []
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-29T08:08:56.701258Z"
  }
}