{
  "source": "2025-05-04.json",
  "entities": [
    {
      "name": "ElizaOS",
      "type": "project",
      "description": "An AI agent framework and ecosystem including multiple components like AI16Z, Auto.fun, and DegenAI.",
      "aliases": [
        "elizaOS"
      ]
    },
    {
      "name": "Auto.fun",
      "type": "project",
      "description": "An open-source platform for token creation and trading within the ElizaOS ecosystem. It allows for token creation, trading, and has specific fee structures for native and migrated tokens.",
      "aliases": [
        "Auto.fun"
      ]
    },
    {
      "name": "DegenAI",
      "type": "token",
      "description": "A token associated with Degenspartan AI, part of a larger ecosystem including ElizaOS.",
      "aliases": [
        "DegenAI"
      ]
    },
    {
      "name": "Shaw",
      "type": "user",
      "description": "A user who discussed AI agents, role systems in a system called The Org, and challenges in crypto gaming.",
      "aliases": [
        "shaw"
      ]
    },
    {
      "name": "The Org",
      "type": "project",
      "description": "A system discussed by Shaw where permissions for AI agents work similarly to Unix admin controls.",
      "aliases": [
        "The Org"
      ]
    },
    {
      "name": "Sam Altman",
      "type": "user",
      "description": "An individual mentioned in the context of AI and crypto intersection, and Worldcoin.",
      "aliases": []
    },
    {
      "name": "Worldcoin",
      "type": "token",
      "description": "A cryptocurrency project founded by Sam Altman, mentioned in discussions about the intersection of AI and crypto.",
      "aliases": [
        "Worldcoin"
      ]
    },
    {
      "name": "Dank",
      "type": "user",
      "description": "A user who shared a 3D character creation workflow using image-to-3D tools and rigging.",
      "aliases": [
        "dankvr"
      ]
    },
    {
      "name": "Collabland",
      "type": "project",
      "description": "A platform or service used for verification of token holders and their roles, often affecting Discord roles.",
      "aliases": [
        "Collabland"
      ]
    },
    {
      "name": "AI16Z",
      "type": "project",
      "description": "A component within the ElizaOS ecosystem focused on venture capital, described as 'fully AI'.",
      "aliases": [
        "AI16Z"
      ]
    },
    {
      "name": "comput3",
      "type": "token",
      "description": "A token that appeared verified on the Auto.fun platform but was later identified as fraudulent.",
      "aliases": [
        "comput3"
      ]
    },
    {
      "name": "Ruby",
      "type": "user",
      "description": "A contributor who provided information on the estimated timeline for the ElizaOS V2 stable release and development branches.",
      "aliases": []
    },
    {
      "name": "OpenAI",
      "type": "project",
      "description": "A research and deployment company focused on artificial intelligence. Mentioned in relation to model usage event tracking in a plugin.",
      "aliases": [
        "OpenAI"
      ]
    },
    {
      "name": "TypeScript",
      "type": "project",
      "description": "A statically typed programming language that compiles to plain JavaScript. Issues were reported in the ElizaOS core package build process.",
      "aliases": [
        "TypeScript"
      ]
    },
    {
      "name": "DegenAI token holders",
      "type": "user",
      "description": "Individuals who hold DegenAI tokens and experienced issues with role verification.",
      "aliases": []
    },
    {
      "name": "MOBA game",
      "type": "project",
      "description": "A multiplayer online battle arena game mentioned in the context of crypto gaming challenges.",
      "aliases": [
        "MOBA game"
      ]
    },
    {
      "name": "Bun",
      "type": "project",
      "description": "A fast JavaScript runtime, bundler, and package manager. A technical issue related to bun link/unlink functionality was mentioned.",
      "aliases": [
        "bun"
      ]
    },
    {
      "name": "GitHub",
      "type": "project",
      "description": "A web-based platform for version control and collaboration that hosts software development projects. Mentioned in relation to installing ElizaOS CLI.",
      "aliases": [
        "GitHub"
      ]
    },
    {
      "name": "Twitter",
      "type": "project",
      "description": "A social media platform where users can post and interact with messages. Mentioned in relation to agent setup functionality and potential ELI5 bot integration.",
      "aliases": [
        "Twitter"
      ]
    },
    {
      "name": "Virtuals",
      "type": "project",
      "description": "A competitor to Auto.fun, mentioned in the context of token launchpad functionality.",
      "aliases": [
        "Virtuals"
      ]
    },
    {
      "name": "Degenspartan AI",
      "type": "project",
      "description": "An entity associated with the DegenAI token, part of the broader ElizaOS ecosystem.",
      "aliases": [
        "Degenspartan AI"
      ]
    },
    {
      "name": "Uniswap",
      "type": "project",
      "description": "A decentralized exchange protocol for the Ethereum blockchain. Mentioned in the context of Auto.fun potentially using existing liquidity pools.",
      "aliases": []
    },
    {
      "name": "Discord",
      "type": "project",
      "description": "A communication platform where users can interact in communities. Mentioned in relation to role verification issues affecting Discord roles.",
      "aliases": [
        "Discord"
      ]
    },
    {
      "name": "ELI5",
      "type": "project",
      "description": "A project or concept described as having significant potential, with visions of it becoming a bot on Twitter and Telegram, and reshaping education sections.",
      "aliases": [
        "ELI5"
      ]
    },
    {
      "name": "Simon",
      "type": "user",
      "description": "A user who identified a suspicious token and received confirmation from the team that it was fake.",
      "aliases": []
    },
    {
      "name": "Kenk",
      "type": "user",
      "description": "A team member who confirmed a token appearing on Auto.fun was fake.",
      "aliases": []
    },
    {
      "name": "yikesawjeez",
      "type": "user",
      "description": "A community helper who assisted a user experiencing role verification issues.",
      "aliases": []
    },
    {
      "name": "Void",
      "type": "user",
      "description": "A user who received assistance with role verification issues.",
      "aliases": []
    },
    {
      "name": "Jin",
      "type": "user",
      "description": "A team member who acknowledged and began investigating community issues related to Collabland verification.",
      "aliases": []
    },
    {
      "name": "Osint",
      "type": "user",
      "description": "A community member (also referred to as not_a_dev_ai) who clarified the project structure and components of the ElizaOS ecosystem.",
      "aliases": [
        "Osint (aka not_a_dev_ai)"
      ]
    },
    {
      "name": "Ric Q",
      "type": "user",
      "description": "A user awaiting a response from another team member.",
      "aliases": []
    },
    {
      "name": "sayonara",
      "type": "user",
      "description": "A community member who provided guidance on updating the ElizaOS CLI using npm.",
      "aliases": []
    },
    {
      "name": "lantianlaoli",
      "type": "user",
      "description": "A user seeking guidance on which codebase to use for developing a text chat plugin.",
      "aliases": []
    },
    {
      "name": "BMK",
      "type": "user",
      "description": "A user who sought clarification regarding different versions of ElizaOS.",
      "aliases": []
    },
    {
      "name": "kandizzy",
      "type": "user",
      "description": "A user who experienced difficulties updating the ElizaOS CLI with persistent version conflicts.",
      "aliases": []
    },
    {
      "name": "Python",
      "type": "project",
      "description": "A high-level, interpreted, general-purpose programming language. Mentioned in the context of a user frustration regarding code checks and documentation.",
      "aliases": []
    },
    {
      "name": "npm",
      "type": "project",
      "description": "A package manager for the JavaScript programming language, used for installing and managing software packages. Mentioned in relation to ElizaOS CLI installation methods.",
      "aliases": [
        "npm"
      ]
    },
    {
      "name": "fetch",
      "type": "project",
      "description": "A web API for making network requests. A TypeScript build error in ElizaOS core package was related to its type definition.",
      "aliases": [
        "fetch"
      ]
    },
    {
      "name": "ElizaOS v2",
      "type": "project",
      "description": "The development branch of the ElizaOS AI agent framework, featuring new capabilities such as an improved plugin architecture, enhanced character system, and better multimodal support.",
      "aliases": [
        "V2",
        "v2-develop"
      ]
    },
    {
      "name": "ElizaOS v1",
      "type": "project",
      "description": "The current stable release version of the ElizaOS AI agent framework.",
      "aliases": [
        "ElizaOS v1"
      ]
    },
    {
      "name": "Base",
      "type": "token",
      "description": "Unknown - needs research",
      "aliases": []
    },
    {
      "name": "Bitcoin",
      "type": "token",
      "description": "Unknown - needs research",
      "aliases": []
    },
    {
      "name": "Ethereum",
      "type": "token",
      "description": "Unknown - needs research",
      "aliases": []
    },
    {
      "name": "SOL",
      "type": "token",
      "description": "Unknown - needs research",
      "aliases": []
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-29T07:27:51.945517Z"
  }
}