{
  "source": "2025-06-29.json",
  "entities": [
    {
      "name": "ElizaOS",
      "type": "project",
      "description": "A software or platform with a focus on AI agents and a plug-in architecture. It is undergoing development with various releases and updates to its network and features.",
      "aliases": [
        "elizaOS",
        "eliza"
      ]
    },
    {
      "name": "Spartan Agent",
      "type": "project",
      "description": "A flagship AI agent developed by ElizaOS, currently undergoing internal and external testing.",
      "aliases": [
        "Spartan"
      ]
    },
    {
      "name": "$degenai",
      "type": "token",
      "description": "A cryptocurrency token associated with the Spartan Agent.",
      "aliases": []
    },
    {
      "name": "A2A Network",
      "type": "project",
      "description": "An agent-to-agent network being developed by ElizaOS, designed to create token fees through interactions between agents and humans.",
      "aliases": [
        "A2A"
      ]
    },
    {
      "name": "AI16Z",
      "type": "project",
      "description": "An entity or project that has a DAO structure, with discussions around token sales and governance. It is described as aspirational rather than a true DAO currently.",
      "aliases": [
        "ai16z",
        "ai-16z",
        "ai16z DAO"
      ]
    },
    {
      "name": "Soulgraph",
      "type": "project",
      "description": "An entity or organization involved in discussions and potential conflicts regarding token sales, specifically in relation to the ai16z team.",
      "aliases": []
    },
    {
      "name": "Jin",
      "type": "user",
      "description": "A developer working on fixing bugs in the AI news pipeline and bringing the jinintern AI agent back online.",
      "aliases": []
    },
    {
      "name": "jinintern",
      "type": "project",
      "description": "An AI agent that is being brought back online, developed or managed by Jin.",
      "aliases": []
    },
    {
      "name": "Discord",
      "type": "project",
      "description": "A communication platform used for community discussions and updates related to various projects, including ElizaOS.",
      "aliases": []
    },
    {
      "name": "cwm",
      "type": "user",
      "description": "An individual or entity associated with Soulgraph, involved in a conflict with the ai16z team regarding token sales.",
      "aliases": []
    },
    {
      "name": "cwm (Soulgraph)",
      "type": "user",
      "description": "An individual or entity associated with Soulgraph, involved in a conflict with the ai16z team regarding token sales.",
      "aliases": []
    },
    {
      "name": "ai16z DAO",
      "type": "project",
      "description": "A proposed or aspirational decentralized autonomous organization associated with ai16z, with discussions about its governance and token management.",
      "aliases": []
    },
    {
      "name": "Solana",
      "type": "project",
      "description": "A blockchain platform known for its high-throughput and low costs, on which the ELI5 token contract is deployed.",
      "aliases": []
    },
    {
      "name": "ELI5",
      "type": "token",
      "description": "A cryptocurrency token with a Solana contract address, discussed in community channels.",
      "aliases": []
    },
    {
      "name": "plugin-autocoder",
      "type": "project",
      "description": "A GitHub repository and functionality within ElizaOS that allows for the creation of plugins using natural language.",
      "aliases": []
    },
    {
      "name": "Twitter",
      "type": "project",
      "description": "A social media platform that has implemented restrictions requiring API keys for certain functionalities, impacting plugins like the Twitter plugin.",
      "aliases": [
        "X platform"
      ]
    },
    {
      "name": "Telegram",
      "type": "project",
      "description": "A messaging application where users have reported configuration issues with certain bots in group chats.",
      "aliases": []
    },
    {
      "name": "Ollama",
      "type": "project",
      "description": "A tool or service that can be configured for AI operations, allowing users to choose between Ollama configuration or local AI.",
      "aliases": []
    },
    {
      "name": "monorepo",
      "type": "project",
      "description": "A software development strategy where all codebases are in a single repository, used within the ElizaOS environment.",
      "aliases": []
    },
    {
      "name": "GitHub",
      "type": "project",
      "description": "A platform for software development version control and collaboration, where repositories such as eliza and plugin-knowledge are hosted.",
      "aliases": []
    },
    {
      "name": "plugin-knowledge",
      "type": "project",
      "description": "A plugin for ElizaOS that enhances contextual knowledge processing and UI components, with recent bug fixes and improvements.",
      "aliases": []
    },
    {
      "name": "eliza/eliza",
      "type": "project",
      "description": "A core repository within the ElizaOS ecosystem, responsible for the main functionality of the Eliza system, including character file saving.",
      "aliases": []
    },
    {
      "name": "plugin-bootstrap",
      "type": "project",
      "description": "A mandatory component or plugin for ElizaOS that is essential for basic agent functionality.",
      "aliases": []
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-29T07:38:23.269724Z"
  }
}