{
  "source": "2025-07-14.json",
  "entities": [
    {
      "name": "ElizaOS",
      "type": "project",
      "description": "A software project with ongoing development activity, including releases, plugin updates, and community contributions. It involves agent deployments and an ecosystem with associated tokens.",
      "aliases": [
        "elizaOS"
      ]
    },
    {
      "name": "Twitter Plugin",
      "type": "project",
      "description": "A plugin for ElizaOS that integrates with Twitter functionality. It has specific versions and configuration settings related to actions.",
      "aliases": [
        "Twitter Plugin v1.2.1"
      ]
    },
    {
      "name": "GitHub",
      "type": "project",
      "description": "A web-based platform that provides Git-based version control for source code management. It hosts repositories for various software projects and facilitates contributions through pull requests and issue tracking.",
      "aliases": []
    },
    {
      "name": "Snapper",
      "type": "user",
      "description": "A community member who shared a video tutorial for character creation in ElizaOS using Claude prompt templates.",
      "aliases": []
    },
    {
      "name": "Claude",
      "type": "project",
      "description": "A large language model that can be used for various natural language processing tasks, including generating prompt templates for AI agents and assisting with code quality workflows.",
      "aliases": []
    },
    {
      "name": "Eli5 token",
      "type": "token",
      "description": "A cryptocurrency token within the ElizaOS ecosystem that has experienced price volatility. Community sentiment towards the token is generally bullish.",
      "aliases": [
        "Eli5 token",
        "Eli5 token"
      ]
    },
    {
      "name": "DorianD",
      "type": "user",
      "description": "A proposer of an identity and memory management system for Eliza agents, utilizing Solana Token 2022.",
      "aliases": []
    },
    {
      "name": "Solana Token 2022",
      "type": "token",
      "description": "A version of the Solana token that supports advanced features for identity and memory management systems in AI agents.",
      "aliases": [
        "Solana Token 2022",
        "T22"
      ]
    },
    {
      "name": "Hoplite role",
      "type": "project",
      "description": "A role assignment within the ElizaOS community that is granted based on holding a specific amount of $degenai tokens.",
      "aliases": [
        "Hoplite role"
      ]
    },
    {
      "name": "$degenai",
      "type": "token",
      "description": "A cryptocurrency token used to qualify for the Hoplite role in the ElizaOS community.",
      "aliases": [
        "$degenai"
      ]
    },
    {
      "name": "Partners role",
      "type": "project",
      "description": "A role assignment within the ElizaOS community that is granted based on holding a specific amount of $ai16z tokens.",
      "aliases": [
        "Partners role"
      ]
    },
    {
      "name": "$ai16z",
      "type": "token",
      "description": "A cryptocurrency token used to qualify for the Partners role in the ElizaOS community. It is also mentioned in the context of liquidity pairing on Raydium.",
      "aliases": [
        "$ai16z"
      ]
    },
    {
      "name": "Render",
      "type": "project",
      "description": "A cloud platform used for deploying applications and services, including ElizaOS agents.",
      "aliases": []
    },
    {
      "name": "Railway",
      "type": "project",
      "description": "A cloud platform used for deploying applications and services, including ElizaOS agents.",
      "aliases": []
    },
    {
      "name": "Heroku",
      "type": "project",
      "description": "A cloud platform used for deploying applications and services, including ElizaOS agents.",
      "aliases": []
    },
    {
      "name": "Raydium",
      "type": "project",
      "description": "A decentralized exchange (DEX) on the Solana blockchain known for its automated market maker (AMM) functionality. It is mentioned in the context of liquidity pairing for AI16Z/Sol.",
      "aliases": []
    },
    {
      "name": "JaiBo",
      "type": "user",
      "description": "An individual who forked ElizaOS and was running it locally.",
      "aliases": []
    },
    {
      "name": "Dr. Neuro",
      "type": "user",
      "description": "A community member experimenting with Hedra AI and seeking assistance with video editing.",
      "aliases": []
    },
    {
      "name": "Hedra AI",
      "type": "project",
      "description": "Unknown - needs research",
      "aliases": []
    },
    {
      "name": "Blade",
      "type": "user",
      "description": "A community member who inquired about receiving the partner role after verifying $degenai tokens and obtaining the Hoplite role.",
      "aliases": [
        "Blake"
      ]
    },
    {
      "name": "Maxrobbins",
      "type": "user",
      "description": "A community member who asked about passive income opportunities, such as staking, for $ai16Z tokens.",
      "aliases": []
    },
    {
      "name": "sukrucildirr",
      "type": "user",
      "description": "A community member who reported issues with their wallet not displaying on their profile and questioned if it was a bug.",
      "aliases": []
    },
    {
      "name": "Safuu 2.0 ❤",
      "type": "user",
      "description": "A community member who asked how to view old messages.",
      "aliases": []
    },
    {
      "name": "Glitch",
      "type": "user",
      "description": "A community member who, along with Blake, requested improvements to the wallet verification and role assignment system.",
      "aliases": []
    },
    {
      "name": "JoeyWheelz",
      "type": "user",
      "description": "A community member who provided guidance on deploying ElizaOS agents on platforms like Render, Railway, and Heroku.",
      "aliases": []
    },
    {
      "name": "0xbbjoker",
      "type": "user",
      "description": "A community member who advised on translating natural language queries to API requests by providing prompt documentation and LLM instructions.",
      "aliases": []
    },
    {
      "name": "Supabase",
      "type": "project",
      "description": "A backend-as-a-service platform that provides tools for database management, authentication, and more. It was mentioned in the context of troubleshooting database connectivity issues.",
      "aliases": []
    },
    {
      "name": "Vercel",
      "type": "project",
      "description": "A cloud platform for frontend developers, enabling workflows that allow frontend teams to iterate on the web faster. It was mentioned as a deployment option for ElizaOS agents.",
      "aliases": []
    },
    {
      "name": "Solana",
      "type": "token",
      "description": "A decentralized blockchain built to support a growing ecosystem of decentralized applications. It is mentioned in the context of AI16Z/Sol liquidity pairing.",
      "aliases": []
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-29T07:40:20.488798Z"
  }
}