{
  "source": "2025-10-21.json",
  "entities": [
    {
      "name": "ElizaOS",
      "type": "project",
      "description": "An ecosystem or project with a token AI16Z and a token named ElizaOS. It involves technical development and has a presence on Discord.",
      "aliases": [
        "elizaOS",
        "Eliza"
      ],
      "visual_hints": "Dark mode UI often associated with tech projects, potentially involving code editor aesthetics."
    },
    {
      "name": "AI16Z",
      "type": "token",
      "description": "A token within the ElizaOS ecosystem that is undergoing a migration to the ElizaOS token.",
      "aliases": [
        "$AI16Z",
        "AI16Z"
      ],
      "visual_hints": "Cryptocurrency token, likely represented by a distinct icon or logo, possibly with an 'A' or abstract shape."
    },
    {
      "name": "ElizaOS",
      "type": "token",
      "description": "A token associated with the ElizaOS ecosystem, which is the destination of a token migration from AI16Z.",
      "aliases": [
        "$ElizaOS",
        "ElizaOS",
        "elizaOS"
      ],
      "visual_hints": "Cryptocurrency token, likely represented by a distinct icon or logo, possibly with an 'E' or abstract shape."
    },
    {
      "name": "Binance",
      "type": "platform",
      "description": "A cryptocurrency exchange.",
      "aliases": [
        "Binance"
      ],
      "visual_hints": "Often represented by a stylized 'b' logo on a blue or black background."
    },
    {
      "name": "CZ",
      "type": "platform",
      "description": "CEO of Binance.",
      "aliases": [
        "CZ"
      ],
      "visual_hints": "Represents a prominent figure in the crypto space, often associated with Binance's branding."
    },
    {
      "name": "Discord",
      "type": "platform",
      "description": "A communication platform popular with online communities, especially for gaming and cryptocurrency.",
      "aliases": [
        "Discord"
      ],
      "visual_hints": "Blue color scheme, speech bubble logo."
    },
    {
      "name": "Phantom",
      "type": "platform",
      "description": "A cryptocurrency wallet, often used for Solana and Ethereum-based applications.",
      "aliases": [
        "Phantom"
      ],
      "visual_hints": "Often represented by a ghost or spectral icon, typically in shades of purple or blue."
    },
    {
      "name": "Metamask",
      "type": "platform",
      "description": "A popular cryptocurrency wallet used to interact with decentralized applications.",
      "aliases": [
        "Metamask"
      ],
      "visual_hints": "Icon features a fox head, often in shades of orange and purple."
    },
    {
      "name": "Twitter/X",
      "type": "platform",
      "description": "A social media platform for short-form content, formerly known as Twitter.",
      "aliases": [
        "Twitter/X",
        "Twitter",
        "X"
      ],
      "visual_hints": "The 'X' logo on a black background, or the former blue bird logo."
    },
    {
      "name": "Model Control Protocol",
      "type": "project",
      "description": "A technical protocol architecture used within the ElizaOS ecosystem, with distinct client and server components.",
      "aliases": [
        "MCP"
      ],
      "visual_hints": "Technical or abstract representation of a protocol, potentially involving flowcharts or network diagrams."
    },
    {
      "name": "claude code",
      "type": "company",
      "description": "A component or client related to 'claude code' in the context of MCP.",
      "aliases": [
        "claude code"
      ],
      "visual_hints": "Abstract representation related to AI or code, potentially using colors associated with Anthropic's Claude."
    },
    {
      "name": "Cursor",
      "type": "platform",
      "description": "An AI-first code editor, associated as an MCP client.",
      "aliases": [
        "cursor"
      ],
      "visual_hints": "Represents a code editor, possibly with a cursor icon or related design elements."
    },
    {
      "name": "Codex",
      "type": "project",
      "description": "An AI model from OpenAI for converting natural language to code, associated as an MCP client.",
      "aliases": [
        "codex"
      ],
      "visual_hints": "Represents AI and code generation, potentially with OpenAI's branding or a code-related icon."
    },
    {
      "name": "plugin-telegram",
      "type": "project",
      "description": "A plugin for integrating with Telegram, developed or used within the ElizaOS ecosystem.",
      "aliases": [
        "plugin-telegram"
      ],
      "visual_hints": "Icon combining Telegram's branding with a plugin or extension symbol."
    },
    {
      "name": "DigitalOcean",
      "type": "platform",
      "description": "A cloud computing platform offering virtual private servers and other cloud infrastructure services.",
      "aliases": [
        "DigitalOcean"
      ],
      "visual_hints": "Often represented by a stylized droplet logo in shades of blue."
    },
    {
      "name": "OpenAI",
      "type": "company",
      "description": "An artificial intelligence research laboratory.",
      "aliases": [
        "OpenAI"
      ],
      "visual_hints": "Associated with AI, often represented by hexagonal patterns or abstract geometric designs."
    },
    {
      "name": "Solfare",
      "type": "platform",
      "description": "A platform mentioned in relation to AI16Z migration, possibly a decentralized exchange or wallet on Solana.",
      "aliases": [
        "Solfare"
      ],
      "visual_hints": "Likely related to the Solana ecosystem, could have a sun or nautical theme."
    },
    {
      "name": "Bybit",
      "type": "platform",
      "description": "A cryptocurrency exchange platform.",
      "aliases": [
        "Bybit"
      ],
      "visual_hints": "Often represented by a stylized 'b' or abstract geometric logo, typically in blue or white."
    },
    {
      "name": "Streamdown",
      "type": "project",
      "description": "A technology or integration being added to ElizaOS for enhancing UI experience with modern rendering capabilities.",
      "aliases": [
        "Streamdown"
      ],
      "visual_hints": "Represents UI/UX enhancement, possibly with flowing or dynamic visual elements."
    },
    {
      "name": "GitHub",
      "type": "platform",
      "description": "A web-based platform for version control and collaboration, primarily used for software development.",
      "aliases": [
        "GitHub"
      ],
      "visual_hints": "Black square with a stylized white octocat logo."
    },
    {
      "name": "Railway",
      "type": "platform",
      "description": "A cloud deployment platform mentioned in the context of hosting issues.",
      "aliases": [
        "Railway"
      ],
      "visual_hints": "Abstract geometric logo, often in blue or purple."
    },
    {
      "name": "Hetzner",
      "type": "platform",
      "description": "A web hosting company and data center provider.",
      "aliases": [
        "Hetzner"
      ],
      "visual_hints": "Often associated with server racks or a clean, technical aesthetic."
    },
    {
      "name": "OVHcloud",
      "type": "platform",
      "description": "A cloud computing company offering hosting and dedicated servers.",
      "aliases": [
        "OVH"
      ],
      "visual_hints": "Associated with servers and data centers, often using blue and white branding."
    },
    {
      "name": "Wholesale Internet",
      "type": "platform",
      "description": "A provider of internet and server solutions.",
      "aliases": [
        "WholesaleInternet"
      ],
      "visual_hints": "Represents internet infrastructure, possibly with network or data-related imagery."
    },
    {
      "name": "BuyVM",
      "type": "platform",
      "description": "A provider of VPS hosting and dedicated servers.",
      "aliases": [
        "BuyVM"
      ],
      "visual_hints": "Likely has a visually distinct logo related to virtual machines or servers."
    },
    {
      "name": "Microsoft",
      "type": "company",
      "description": "A multinational technology corporation.",
      "aliases": [
        "Microsoft"
      ],
      "visual_hints": "Often represented by a four-pane window logo, in various colors."
    },
    {
      "name": "spec-kit",
      "type": "project",
      "description": "A framework or library developed by Microsoft, used in a refactoring attempt for plugin-telegram.",
      "aliases": [
        "spec-kit"
      ],
      "visual_hints": "Technical symbol or abstract design representing a software kit or framework."
    },
    {
      "name": "Gate.io",
      "type": "platform",
      "description": "A cryptocurrency exchange.",
      "aliases": [
        "gate io"
      ],
      "visual_hints": "Has a distinct logo, often a stylized 'G' or abstract shape, with blue and white colors."
    },
    {
      "name": "Layer One X",
      "type": "company",
      "description": "A company offering partnership services including liquidity provision, cross-chain launches, and exchange listings.",
      "aliases": [
        "Layer One X"
      ],
      "visual_hints": "Represents blockchain or financial technology, possibly with layers or network-related imagery."
    },
    {
      "name": "xiaozhi-esp32",
      "type": "project",
      "description": "A GitHub project related to hardware integration, possibly ESP32 microcontrollers.",
      "aliases": [
        "xiaozhi-esp32"
      ],
      "visual_hints": "Represents hardware or IoT, potentially with microcontroller or circuitry imagery."
    },
    {
      "name": "PostgreSQL",
      "type": "project",
      "description": "An open-source relational database management system.",
      "aliases": [
        "Postgres"
      ],
      "visual_hints": "Often represented by a stylized elephant logo."
    },
    {
      "name": "pglite",
      "type": "project",
      "description": "A lightweight version or component related to PostgreSQL, potentially used for custom images.",
      "aliases": [
        "pglite"
      ],
      "visual_hints": "A minimalist or streamlined version of the PostgreSQL elephant logo."
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-28T07:05:37.208633Z"
  }
}