{
  "source": "2025-04-20.json",
  "entities": [
    {
      "name": "Auto.fun",
      "type": "project",
      "description": "A creator-friendly launchpad and no-code platform integrating multi-agent functionality, collaborative tokenomics, and AI-enhanced features. It aims to make crypto fun again by building novel experiences and creating communities.",
      "aliases": [
        "auto.fun platform"
      ]
    },
    {
      "name": "ElizaOS",
      "type": "project",
      "description": "A development project focusing on AI technologies, with contributions including default agent templates and GPU detection improvements in Docker containers. It aims to integrate with other services and offers tools for developers.",
      "aliases": [
        "elizaOS"
      ]
    },
    {
      "name": "shawmakesmagic",
      "type": "user",
      "description": "A user associated with the launch of the Auto.fun platform.",
      "aliases": [
        "@shawmakesmagic"
      ]
    },
    {
      "name": "elizaOS",
      "type": "user",
      "description": "Unknown - needs research",
      "aliases": [
        "@elizaOS"
      ]
    },
    {
      "name": "SpartanVersus",
      "type": "project",
      "description": "A project that is being upgraded to v2, with developers working on fixing autonomous trading bugs and preparing for Discord and Telegram integration. It is also being readied for open-source release.",
      "aliases": [
        "SpartanVersus"
      ]
    },
    {
      "name": "SOL",
      "type": "token",
      "description": "A cryptocurrency that has seen price increases. It is the blockchain on which the Auto.fun platform launched.",
      "aliases": [
        "SOL (Solana)"
      ]
    },
    {
      "name": "WETH",
      "type": "token",
      "description": "A cryptocurrency that has increased in price, indicating general positive sentiment in the crypto market.",
      "aliases": [
        "WETH (Wrapped Ethereum)"
      ]
    },
    {
      "name": "$ai16z",
      "type": "token",
      "description": "A token used within the ElizaOS ecosystem. A portion of Auto.fun's bonded LP fees are used to buy back $ai16z tokens.",
      "aliases": [
        "$ai16z"
      ]
    },
    {
      "name": "$degenai",
      "type": "token",
      "description": "An official token within the ElizaOS ecosystem alongside $ai16z.",
      "aliases": [
        "$degenai"
      ]
    },
    {
      "name": "Raydium AMM",
      "type": "project",
      "description": "A decentralized exchange (DEX) and automated market maker (AMM) used by Auto.fun for token creation and liquidity integration. It facilitates token migration when they reach 100% bonding.",
      "aliases": [
        "Raydium"
      ]
    },
    {
      "name": "tip.md",
      "type": "project",
      "description": "A tool launched by R0am that enables developers to receive crypto tips through GitHub READMEs across Ethereum, Solana, and Bitcoin Lightning networks.",
      "aliases": [
        "tip.md"
      ]
    },
    {
      "name": "R0am",
      "type": "user",
      "description": "A user who launched the tip.md tool.",
      "aliases": [
        "R0am"
      ]
    },
    {
      "name": "GitHub",
      "type": "project",
      "description": "A web-based platform for version control and collaboration, used for hosting code repositories and managing project contributions. It also serves as a platform for receiving crypto tips via READMEs.",
      "aliases": [
        "GitHub"
      ]
    },
    {
      "name": "Ethereum",
      "type": "token",
      "description": "A decentralized, open-source blockchain system that features smart contract functionality. It is one of the networks supported by the tip.md tool.",
      "aliases": []
    },
    {
      "name": "Bitcoin Lightning Network",
      "type": "token",
      "description": "A second-layer payment protocol that operates on top of the Bitcoin blockchain, enabling faster and cheaper transactions. It is supported by the tip.md tool for receiving crypto tips.",
      "aliases": [
        "Bitcoin Lightning networks"
      ]
    },
    {
      "name": "Odilitime",
      "type": "user",
      "description": "Unknown - needs research",
      "aliases": []
    },
    {
      "name": "AI16z Discord",
      "type": "project",
      "description": "A separate Discord server established for handling support related to the Auto.fun platform.",
      "aliases": [
        "AI16z Discord"
      ]
    },
    {
      "name": "Ruby",
      "type": "user",
      "description": "A user who provided instructions for modifying Twitter listeners to track replies to specific accounts.",
      "aliases": [
        "Ruby"
      ]
    },
    {
      "name": "Jin",
      "type": "user",
      "description": "A user who mentioned merging a large documentation pull request.",
      "aliases": [
        "Jin"
      ]
    },
    {
      "name": "Meteora",
      "type": "project",
      "description": "A decentralized exchange (DEX) where Auto.fun tokens can migrate to when they reach 100% bonding.",
      "aliases": [
        "Meteora"
      ]
    },
    {
      "name": "Twitter",
      "type": "project",
      "description": "A social media platform used for communication and redirects during the Auto.fun launch. It is also integrated with SpartanVersus for autonomous trading and notifications.",
      "aliases": [
        "Twitter"
      ]
    },
    {
      "name": "Discord",
      "type": "project",
      "description": "A communication platform used for the ElizaOS community and development discussions. SpartanVersus is preparing for Discord integration.",
      "aliases": [
        "Discord"
      ]
    },
    {
      "name": "Telegram",
      "type": "project",
      "description": "A messaging application that SpartanVersus is preparing to integrate with. It is also mentioned in the context of ElizaOS plugin architecture issues.",
      "aliases": [
        "Telegram"
      ]
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-29T07:22:46.649705Z"
  }
}