{
  "source": "2025-11-20.json",
  "entities": [
    {
      "name": "elizaOS",
      "type": "project",
      "description": "A platform focused on token migration and core feature development, including browser compatibility and server isolation.",
      "aliases": [
        "elizaOS platform",
        "elizaOS"
      ]
    },
    {
      "name": "ai16z",
      "type": "token",
      "description": "A token involved in a migration process to elizaOS tokens with a specific conversion ratio.",
      "aliases": [
        "ai16z"
      ]
    },
    {
      "name": "a16z corporation",
      "type": "project",
      "description": "A corporation that has trademark conflicts with the elizaOS project's original branding.",
      "aliases": [
        "a16z corporation"
      ]
    },
    {
      "name": "Stan",
      "type": "user",
      "description": "A contributor working on E2E authentication tests for Entity/server isolation and PR #6135.",
      "aliases": [
        "Stan"
      ]
    },
    {
      "name": "Odilitime",
      "type": "user",
      "description": "A contributor mentioned in relation to PR #6135 and providing migration information.",
      "aliases": [
        "Odilitime"
      ]
    },
    {
      "name": "Babylon",
      "type": "project",
      "description": "A project or implementation that supports EIP-8004 and is considered a future product for elizaOS.",
      "aliases": [
        "Babylon's implementation",
        "Babylon"
      ]
    },
    {
      "name": "TypeScript",
      "type": "project",
      "description": "A programming language highlighted as essential for development on the elizaOS platform.",
      "aliases": [
        "TypeScript"
      ]
    },
    {
      "name": "React",
      "type": "project",
      "description": "A JavaScript library for building user interfaces, knowledge of which is not initially required for elizaOS development.",
      "aliases": [
        "React"
      ]
    },
    {
      "name": "Solidity",
      "type": "project",
      "description": "A programming language for writing smart contracts, knowledge of which is not initially required for elizaOS development.",
      "aliases": [
        "Solidity"
      ]
    },
    {
      "name": "elizaOS tokens",
      "type": "token",
      "description": "The primary token for the elizaOS platform, used as currency and for buyback mechanisms.",
      "aliases": [
        "elizaOS tokens",
        "elizaOS",
        "ELIZAOS"
      ]
    },
    {
      "name": "EIP-8004",
      "type": "project",
      "description": "A standard or proposal relevant to discussions about Babylon's implementation within the elizaOS ecosystem.",
      "aliases": [
        "EIP-8004"
      ]
    },
    {
      "name": "Postgres",
      "type": "project",
      "description": "A relational database management system being added to CI within the elizaOS development environment.",
      "aliases": [
        "Postgres"
      ]
    },
    {
      "name": "plugin-twitter",
      "type": "project",
      "description": "A functionality or plugin related to Twitter that is experiencing issues within the elizaOS ecosystem.",
      "aliases": [
        "plugin-twitter"
      ]
    },
    {
      "name": "LangChain",
      "type": "project",
      "description": "A framework for developing applications powered by language models, with a focus on migrating away from deprecated versions like v0.3.",
      "aliases": [
        "LangChain v0.3"
      ]
    },
    {
      "name": "TEE",
      "type": "project",
      "description": "Trusted Execution Environment; a concept discussed for running software securely in browser-based environments on platforms like iOS.",
      "aliases": [
        "TEEs"
      ]
    },
    {
      "name": "iOS",
      "type": "project",
      "description": "A mobile operating system developed by Apple for its devices, discussed in the context of running TEEs.",
      "aliases": [
        "iOS"
      ]
    },
    {
      "name": "Dr. Neuro",
      "type": "user",
      "description": "A user who created 7k images related to an agent concept, potentially exportable as a dataset.",
      "aliases": [
        "Dr. Neuro"
      ]
    },
    {
      "name": "Borko",
      "type": "user",
      "description": "A user assigned to conduct product research on the Tolans app.",
      "aliases": [
        "Borko"
      ]
    },
    {
      "name": "Tolans app",
      "type": "project",
      "description": "An application that Borko is researching, focusing on its onboarding process.",
      "aliases": [
        "Tolans app"
      ]
    },
    {
      "name": "CJFT",
      "type": "user",
      "description": "A contributor providing insights on the necessity of runtime::generateText versus runtime::useModel functions.",
      "aliases": [
        "cjft"
      ]
    },
    {
      "name": "DorianD",
      "type": "user",
      "description": "A contributor exploring the implementation of ZK primitives for game features within the elizaOS ecosystem.",
      "aliases": [
        "DorianD"
      ]
    },
    {
      "name": "Omid sa",
      "type": "user",
      "description": "A contributor providing information on unclaimed tokens and migration support, including assistance with Tangem wallets.",
      "aliases": [
        "Omid sa"
      ]
    },
    {
      "name": "The Light",
      "type": "user",
      "description": "A contributor offering guidance on token migration support and the purpose of the new token for Eliza Cloud.",
      "aliases": [
        "The Light"
      ]
    },
    {
      "name": "Tommy",
      "type": "user",
      "description": "A user seeking and receiving assistance with token migration from a Tangem wallet.",
      "aliases": [
        "Tommy"
      ]
    },
    {
      "name": "Marc A",
      "type": "user",
      "description": "An individual who requested a name change for the project due to trademark conflicts.",
      "aliases": [
        "Marc A"
      ]
    },
    {
      "name": "Phantom wallet",
      "type": "project",
      "description": "A cryptocurrency wallet that can be integrated with elizaOS, used for token migration and potentially other aspects.",
      "aliases": [
        "Phantom wallet"
      ]
    },
    {
      "name": "Kraken",
      "type": "project",
      "description": "A cryptocurrency exchange where users may hold tokens, with users noting delays in migration processing.",
      "aliases": [
        "Kraken"
      ]
    },
    {
      "name": "Bithumb",
      "type": "project",
      "description": "A Korean cryptocurrency exchange that posted a rebranding notice for ElizaOS.",
      "aliases": [
        "Bithumb"
      ]
    },
    {
      "name": "Tangem wallet",
      "type": "project",
      "description": "A cryptocurrency wallet that users are transferring tokens from to utilize the elizaOS migration portal.",
      "aliases": [
        "Tangem wallet"
      ]
    },
    {
      "name": "Cloudflare",
      "type": "project",
      "description": "A network services provider whose issues were affecting various services, including Twitter, within the elizaOS ecosystem.",
      "aliases": [
        "Cloudflare network"
      ]
    },
    {
      "name": "GitHub",
      "type": "project",
      "description": "A platform for version control and collaboration, where Stan shared a pull request and other development activities occur.",
      "aliases": [
        "GitHub"
      ]
    },
    {
      "name": "Eigen Layer",
      "type": "project",
      "description": "A restaking protocol; potential collaboration with a team working on its integration was discussed.",
      "aliases": [
        "Eigen Layer"
      ]
    },
    {
      "name": "Character.AI",
      "type": "project",
      "description": "A platform for AI characters; the elizaOS team is implementing a similar long-term memory system for its AI agents.",
      "aliases": [
        "Character.AI"
      ]
    },
    {
      "name": "Jungian Typology",
      "type": "project",
      "description": "A system of psychological types used for classifying personalities, considered for pre-built character templates in elizaOS agent memory.",
      "aliases": [
        "Jungian Typology"
      ]
    },
    {
      "name": "DegenAI",
      "type": "project",
      "description": "A project on the elizaOS roadmap, potentially involving token-gated use cases.",
      "aliases": [
        "DegenAI"
      ]
    },
    {
      "name": "Phala",
      "type": "project",
      "description": "A platform where users reported build errors when trying to build Docker images for TEE projects.",
      "aliases": [
        "Phala"
      ]
    },
    {
      "name": "Discord",
      "type": "project",
      "description": "A communication platform used for discussions within the elizaOS community, organized into channels like #💬-discussion, #💬-coders, #core-devs, and #🥇-partners.",
      "aliases": [
        "Discord"
      ]
    },
    {
      "name": "Twitter",
      "type": "project",
      "description": "A social media platform; issues with its functionality were mentioned, potentially related to Cloudflare network problems.",
      "aliases": [
        "twitter"
      ]
    },
    {
      "name": "Ethereum",
      "type": "token",
      "description": "A decentralized, open-source blockchain system with smart contract functionality; mentioned in brief discussions about potential integrations.",
      "aliases": [
        "Ethereum"
      ]
    },
    {
      "name": "Jesse",
      "type": "user",
      "description": "A user who inquired about the purpose of the new token and its relation to revenue streams.",
      "aliases": [
        "Jesse"
      ]
    },
    {
      "name": "Toni",
      "type": "user",
      "description": "A contributor providing support and clarifications on the elizaOS token migration process, including manual migration and token eligibility.",
      "aliases": [
        "Toni"
      ]
    },
    {
      "name": "jasyn_bjorn",
      "type": "user",
      "description": "A contributor providing information on token migration, particularly regarding Kraken and the absence of a new token for Babylon.",
      "aliases": [
        "jasyn_bjorn"
      ]
    },
    {
      "name": "BigDude",
      "type": "user",
      "description": "A user asking questions about the migration of ai16z tokens and their status on Kraken.",
      "aliases": [
        "BigDude"
      ]
    },
    {
      "name": "zicase01",
      "type": "user",
      "description": "A user inquiring about the methods for migrating ai16z tokens to elizaOS.",
      "aliases": [
        "zicase01"
      ]
    },
    {
      "name": "Rainman",
      "type": "user",
      "description": "A user asking about the conversion ratio for ai16z to elizaOS tokens, migration deadlines, and vesting schedules.",
      "aliases": [
        "Rainman"
      ]
    },
    {
      "name": "0xYogi",
      "type": "user",
      "description": "A user experiencing an issue where their tokens do not appear in the migration portal and inquiring about eligibility.",
      "aliases": [
        "0xYogi"
      ]
    },
    {
      "name": "hns71",
      "type": "user",
      "description": "A helper who explained the migration process and addressed concerns about scams to user F&M.",
      "aliases": [
        "hns71"
      ]
    },
    {
      "name": "F&M",
      "type": "user",
      "description": "A user who was confused about the migration process and concerned about potential scams.",
      "aliases": [
        "F&M"
      ]
    },
    {
      "name": "cjft",
      "type": "user",
      "description": "A contributor discussing potential redundancy between runtime::generateText and runtime::useModel functions in elizaOS.",
      "aliases": [
        "cjft"
      ]
    },
    {
      "name": "Eliza Cloud",
      "type": "project",
      "description": "A service currently in development by elizaOS, with planned revenue intended for token buybacks.",
      "aliases": [
        "Eliza Cloud"
      ]
    },
    {
      "name": "Wasm pglite plugin-sql",
      "type": "project",
      "description": "A plugin for elizaOS that is now fully functional in browser environments.",
      "aliases": [
        "wasm pglite plugin-sql"
      ]
    },
    {
      "name": "Eliza runtime",
      "type": "project",
      "description": "The core runtime environment for elizaOS, which now operates fully within browser environments.",
      "aliases": [
        "Eliza runtime"
      ]
    },
    {
      "name": "AI16Z",
      "type": "token",
      "description": "An original token that underwent migration to elizaOS tokens due to trademark conflicts.",
      "aliases": [
        "AI16Z"
      ]
    },
    {
      "name": "ZK",
      "type": "project",
      "description": "Zero-knowledge proof technology, with DorianD exploring its implementation for game features within elizaOS.",
      "aliases": [
        "ZK primitives"
      ]
    },
    {
      "name": "Eliza framework",
      "type": "project",
      "description": "The underlying technical framework for elizaOS, considered technically complete with documentation and tooling, now focusing on consumer applications.",
      "aliases": [
        "Eliza framework"
      ]
    },
    {
      "name": "Cloud",
      "type": "project",
      "description": "One of two consumer-facing products with clear revenue streams being developed by elizaOS, possibly referring to Eliza Cloud.",
      "aliases": [
        "Cloud"
      ]
    },
    {
      "name": "Babylon",
      "type": "project",
      "description": "One of two consumer-facing products with clear revenue streams being developed by elizaOS.",
      "aliases": [
        "Babylon"
      ]
    },
    {
      "name": "Token buyback mechanism",
      "type": "project",
      "description": "A financial mechanism planned for the Eliza Cloud service to repurchase ELIZAOS tokens from the market.",
      "aliases": [
        "token buyback mechanism"
      ]
    },
    {
      "name": "x402",
      "type": "project",
      "description": "An integration mentioned in the context of the project becoming cross-chain, following the migration from AI16Z to elizaOS.",
      "aliases": [
        "x402 integration"
      ]
    },
    {
      "name": "Spartan trading",
      "type": "project",
      "description": "A trading activity mentioned in the context of ease of access on Gemini 3.",
      "aliases": [
        "Spartan trading"
      ]
    },
    {
      "name": "Gemini 3",
      "type": "project",
      "description": "A platform or service where Spartan trading is discussed as being easily accessible.",
      "aliases": [
        "Gemini 3"
      ]
    },
    {
      "name": "Eliza app",
      "type": "project",
      "description": "An application confirmed to be on the elizaOS roadmap, with offers for TestFlight deployment assistance.",
      "aliases": [
        "eliza app"
      ]
    },
    {
      "name": "Junaid Ali",
      "type": "user",
      "description": "A user concerned about manual migration instructions in a support ticket, who received confirmation of the process's legitimacy.",
      "aliases": [
        "Junaid Ali"
      ]
    },
    {
      "name": "Helpee",
      "type": "user",
      "description": "A generic label for a user receiving assistance from a helper in Discord interactions.",
      "aliases": [
        "Helpee"
      ]
    },
    {
      "name": "Helper",
      "type": "user",
      "description": "A generic label for a user providing assistance to another user in Discord interactions.",
      "aliases": [
        "Helper"
      ]
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-29T08:05:42.746067Z"
  }
}