{
  "source": "2025-11-17.json",
  "entities": [
    {
      "name": "ElizaOS",
      "type": "project",
      "description": "An open-source framework for autonomous AI agents with cross-chain capabilities. It is transitioning from a 'meme AI fund' to a 'full-fledged agent system'.",
      "aliases": [
        "elizaOS"
      ]
    },
    {
      "name": "AI16Z",
      "type": "token",
      "description": "A token that is undergoing a migration process to ElizaOS.",
      "aliases": []
    },
    {
      "name": "GitHub",
      "type": "project",
      "description": "A web-based platform and version control system that provides distributed version control using Git. It is used for hosting code and enabling collaboration.",
      "aliases": [
        "GitHub",
        "eliza-nextjs-starter"
      ]
    },
    {
      "name": "BNB",
      "type": "token",
      "description": "A cryptocurrency native to the BNB Chain (formerly Binance Smart Chain). It is used for transaction fees, staking, and participation in the ecosystem.",
      "aliases": [
        "BNB"
      ]
    },
    {
      "name": "Base",
      "type": "token",
      "description": "An Ethereum L2 built by Coinbase, designed to scale Ethereum and bring the next billion users to web3. It supports EVM compatibility and facilitates low-cost transactions.",
      "aliases": [
        "Base"
      ]
    },
    {
      "name": "Solana",
      "type": "token",
      "description": "An open-source project focused on providing the decentralized web with the speed, scalability, and security it needs to grow. It hosts various decentralized applications and tokens.",
      "aliases": [
        "Solana"
      ]
    },
    {
      "name": "Ethereum",
      "type": "token",
      "description": "An open-source, decentralized blockchain system that features smart contract functionality. It is a platform for decentralized applications and cryptocurrencies.",
      "aliases": [
        "ETH"
      ]
    },
    {
      "name": "Binance Alpha",
      "type": "project",
      "description": "A program or event associated with Binance that involves airdrops and early access rewards for featured Web3 projects.",
      "aliases": []
    },
    {
      "name": "Kraken",
      "type": "project",
      "description": "A cryptocurrency exchange platform that allows users to buy, sell, and trade various digital assets.",
      "aliases": [
        "Kraken"
      ]
    },
    {
      "name": "Bithumb",
      "type": "project",
      "description": "A South Korean cryptocurrency exchange.",
      "aliases": [
        "Bithumb"
      ]
    },
    {
      "name": "Jumper.exchange",
      "type": "project",
      "description": "A platform or service that facilitates bridging tokens between different blockchain networks.",
      "aliases": [
        "Jumper.exchange"
      ]
    },
    {
      "name": "Phantom",
      "type": "project",
      "description": "A cryptocurrency wallet that supports various blockchains, including Solana and Ethereum. It allows users to manage their digital assets and interact with dApps.",
      "aliases": [
        "Phantom"
      ]
    },
    {
      "name": "TobyMoonWalker",
      "type": "user",
      "description": "A community member and helper who provides support and answers questions regarding ElizaOS token migration and other project-related topics.",
      "aliases": []
    },
    {
      "name": "KeyzerSozse",
      "type": "user",
      "description": "A user mentioned in the context of confirming the safety of sending tokens through the official ticket system.",
      "aliases": []
    },
    {
      "name": "Kira",
      "type": "user",
      "description": "An individual who provided an explanation for the price drop of ElizaOS tokens.",
      "aliases": []
    },
    {
      "name": "Milo",
      "type": "user",
      "description": "An individual who commented on the liquidity issues of ElizaOS across different blockchain networks.",
      "aliases": []
    },
    {
      "name": "Chess_needs_an_update",
      "type": "user",
      "description": "A user who received assistance with token migration after moving their tokens to a new wallet.",
      "aliases": []
    },
    {
      "name": "papa0901",
      "type": "user",
      "description": "A user who received instructions on how to submit a ticket for manual migration of tokens held on an exchange.",
      "aliases": []
    },
    {
      "name": "Blake",
      "type": "user",
      "description": "A user who asked questions about the ElizaOS token migration process, including eligibility for tokens purchased after the snapshot date.",
      "aliases": []
    },
    {
      "name": "Will123",
      "type": "user",
      "description": "A user who inquired about the snapshot date for migration eligibility and the process for tokens held on exchanges or in liquidity pools.",
      "aliases": []
    },
    {
      "name": "0xJX",
      "type": "user",
      "description": "A user who asked about the process for migrating tokens that were in a liquidity pool during the snapshot period.",
      "aliases": []
    },
    {
      "name": "vloine",
      "type": "user",
      "description": "A user who asked about bridging ElizaOS tokens from the BSC chain back to the Solana chain.",
      "aliases": []
    },
    {
      "name": "Nikolai",
      "type": "user",
      "description": "A user who asked for solutions if their cold wallet was not supported by the ElizaOS token migrator.",
      "aliases": []
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-29T08:05:17.383648Z"
  }
}