{
  "source": "2025-04-26.json",
  "entities": [
    {
      "name": "Auto.fun",
      "type": "project",
      "description": "A token launchpad platform that has been open-sourced, featuring AI-generated content, token-gated chats, and custom vanity addresses.",
      "aliases": [
        "auto.fun"
      ]
    },
    {
      "name": "Shaw",
      "type": "user",
      "description": "The founder of ElizaOS and project lead for Auto.fun.",
      "aliases": [
        "shaw"
      ]
    },
    {
      "name": "ElizaOS",
      "type": "project",
      "description": "An AI operating system project focusing on building Artificial General Intelligence (AGI).",
      "aliases": [
        "Eliza OS",
        "elizaOS",
        "ai16z"
      ]
    },
    {
      "name": "ElizaOS V2",
      "type": "project",
      "description": "The second version of the ElizaOS project, featuring a plugin system and ongoing development challenges.",
      "aliases": [
        "ElizaOS v2",
        "elizaOS v2"
      ]
    },
    {
      "name": "Raydium",
      "type": "project",
      "description": "A decentralized exchange (DEX) and automated market maker (AMM) on the Solana blockchain.",
      "aliases": []
    },
    {
      "name": "GitHub",
      "type": "project",
      "description": "A web-based platform for version control and collaboration using Git.",
      "aliases": []
    },
    {
      "name": "AGI",
      "type": "project",
      "description": "Artificial General Intelligence, a hypothetical type of artificial intelligence that the ElizaOS project aims to build.",
      "aliases": []
    },
    {
      "name": "DegenAI",
      "type": "project",
      "description": "A project related to ElizaOS, with DegenAI V2 being an open source release of elizaOS. It also involves buyback mechanisms driven by Auto.fun.",
      "aliases": [
        "DegenAI V2"
      ]
    },
    {
      "name": "Bento.me",
      "type": "project",
      "description": "A platform or service for which profile improvements, such as adding Discord links, are discussed.",
      "aliases": [
        "Bento.me"
      ]
    },
    {
      "name": "QUILL token",
      "type": "token",
      "description": "A token that experienced a significant incident where a bug allowed its liquidity pool to be drained.",
      "aliases": [
        "$QUILL token",
        "$QUILL"
      ]
    },
    {
      "name": "AI16z",
      "type": "token",
      "description": "A token, formerly known as AI16z, which is also referred to as the elizaOS token. It was trading around $0.25 with a market cap of approximately $140M.",
      "aliases": [
        "AI16z token",
        "ai16z"
      ]
    },
    {
      "name": "daos.fun",
      "type": "project",
      "description": "A platform from which the AI16z token is being considered for migration away due to user frustrations.",
      "aliases": []
    },
    {
      "name": "Oculus",
      "type": "project",
      "description": "A virtual reality technology company, now part of Meta, known for its VR headsets and development tools.",
      "aliases": []
    },
    {
      "name": "PostgreSQL",
      "type": "project",
      "description": "A powerful, open-source object-relational database system known for its reliability and feature robustness.",
      "aliases": [
        "Postgres"
      ]
    },
    {
      "name": "AWS",
      "type": "project",
      "description": "Amazon Web Services, a cloud computing platform offering a wide range of services.",
      "aliases": []
    },
    {
      "name": "MIT",
      "type": "project",
      "description": "A permissive open-source license that allows for the free use, modification, and distribution of software.",
      "aliases": []
    },
    {
      "name": "Twitter API",
      "type": "project",
      "description": "An application programming interface provided by Twitter that allows developers to interact with Twitter's data and services.",
      "aliases": []
    },
    {
      "name": "WhatsApp",
      "type": "project",
      "description": "A freeware and encrypted instant messaging (IM) and voice-over-IP (VoIP) service owned by Meta Platforms.",
      "aliases": []
    },
    {
      "name": "SOL",
      "type": "token",
      "description": "Solana, a high-performance blockchain platform designed for decentralized applications and cryptocurrencies.",
      "aliases": [
        "SOL"
      ]
    },
    {
      "name": "WETH",
      "type": "token",
      "description": "Wrapped Ether, an ERC-20 token that represents Ether locked in a smart contract, allowing it to be used in decentralized finance (DeFi) applications.",
      "aliases": [
        "WETH"
      ]
    },
    {
      "name": "Binance",
      "type": "project",
      "description": "A global cryptocurrency exchange that provides a platform for trading various cryptocurrencies.",
      "aliases": []
    },
    {
      "name": "Ruby",
      "type": "project",
      "description": "A dynamic, open-source programming language with a focus on simplicity and productivity. Often associated with web development frameworks.",
      "aliases": []
    },
    {
      "name": "Fleek",
      "type": "project",
      "description": "A platform that enables the creation and hosting of decentralized websites and applications on the Internet Computer.",
      "aliases": []
    },
    {
      "name": "EVM",
      "type": "project",
      "description": "The Ethereum Virtual Machine, a Turing-complete virtual machine that executes code on the Ethereum blockchain.",
      "aliases": []
    },
    {
      "name": "ETH",
      "type": "token",
      "description": "Ether, the native cryptocurrency of the Ethereum blockchain, used for transaction fees and services on the network.",
      "aliases": [
        "ETH"
      ]
    },
    {
      "name": "Livepeer",
      "type": "project",
      "description": "A decentralized video streaming network that uses blockchain technology to incentivize content creators and transcoders.",
      "aliases": []
    },
    {
      "name": "Unity",
      "type": "project",
      "description": "A cross-platform game engine developed by Unity Technologies, widely used for creating video games and other interactive 3D applications.",
      "aliases": []
    },
    {
      "name": "AutoPupper",
      "type": "token",
      "description": "A token project that is experiencing or has experienced issues with token migration.",
      "aliases": []
    },
    {
      "name": "Quilliana AI",
      "type": "token",
      "description": "A token project mentioned in the context of experiencing contract migration issues.",
      "aliases": []
    },
    {
      "name": "Spartan",
      "type": "project",
      "description": "A project with associated resources and updates, potentially related to DegenAI.",
      "aliases": [
        "Spartan/DegenAI"
      ]
    },
    {
      "name": "Ledger",
      "type": "project",
      "description": "A hardware wallet manufacturer that provides secure storage for cryptocurrencies.",
      "aliases": [
        "Ledger hardware wallet"
      ]
    },
    {
      "name": "Photon",
      "type": "project",
      "description": "A platform that is compared to Auto.fun in discussions about token launchpads.",
      "aliases": []
    },
    {
      "name": "Bullx",
      "type": "project",
      "description": "A platform that is compared to Auto.fun in discussions about token launchpads.",
      "aliases": []
    },
    {
      "name": "gmgn",
      "type": "project",
      "description": "A platform that is compared to Auto.fun in discussions about token launchpads.",
      "aliases": []
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-29T07:23:34.107602Z"
  }
}