{
  "source": "2025-11-19.json",
  "entities": [
    {
      "name": "ElizaOS",
      "type": "project",
      "description": "A project focusing on AI agent memory systems and consumer-facing applications, indicated by its framework's technical completion and the development of products like 'Cloud' and 'Babylon'. It aims to create a world for agents backed by a chain where its token serves as gas.",
      "aliases": [
        "ElizaOS project",
        "elizaOS",
        "Eliza framework"
      ]
    },
    {
      "name": "AI16Z",
      "type": "token",
      "description": "An older version or previous iteration of the ElizaOS token, which underwent a migration process due to trademark conflicts.",
      "aliases": [
        "AI16Z"
      ]
    },
    {
      "name": "ElizaOS token",
      "type": "token",
      "description": "The native token of the ElizaOS project, which serves as gas within its ecosystem and is used for accessing services like Eliza Cloud. It replaced the AI16Z token.",
      "aliases": [
        "$elizaOS",
        "ELIZAOS",
        "ElizaOS tokens"
      ]
    },
    {
      "name": "a16z corporation",
      "type": "project",
      "description": "A venture capital firm that was involved in trademark conflicts related to the name used by the ElizaOS project.",
      "aliases": [
        "a16z",
        "a16z corp"
      ]
    },
    {
      "name": "Shaw",
      "type": "user",
      "description": "An individual involved in the ElizaOS project who explained the project's technical completion and the need for consumer-facing applications to demonstrate its value.",
      "aliases": [
        "Shaw"
      ]
    },
    {
      "name": "Cloud",
      "type": "project",
      "description": "A planned consumer-facing product developed by the ElizaOS team, intended to have a clear revenue stream that will support tokenomics through buybacks of the ElizaOS token.",
      "aliases": [
        "Cloud"
      ]
    },
    {
      "name": "Babylon",
      "type": "project",
      "description": "A planned consumer-facing product developed by the ElizaOS team, intended to generate revenue and support the project's tokenomics.",
      "aliases": [
        "Babylon"
      ]
    },
    {
      "name": "Character.AI",
      "type": "project",
      "description": "A platform known for its AI agent memory systems, used as a benchmark or comparison for the development of ElizaOS's own AI agent memory features.",
      "aliases": [
        "Character.AI"
      ]
    },
    {
      "name": "eliza app",
      "type": "project",
      "description": "A mobile application that is confirmed to be on the roadmap for the ElizaOS project, with plans for TestFlight deployment.",
      "aliases": [
        "eliza app"
      ]
    },
    {
      "name": "Bithumb",
      "type": "project",
      "description": "A Korean cryptocurrency exchange that has posted a rebranding notice for ElizaOS, acknowledging the project's migration from AI16Z.",
      "aliases": [
        "Bithumb"
      ]
    },
    {
      "name": "DegenAI",
      "type": "project",
      "description": "A project related to ElizaOS that is still under development and may involve token-gated use cases.",
      "aliases": [
        "DegenAI"
      ]
    },
    {
      "name": "Tolans app",
      "type": "project",
      "description": "An application that is currently undergoing product research by Borko within the ElizaOS ecosystem, specifically focusing on its onboarding process.",
      "aliases": [
        "Tolans app"
      ]
    },
    {
      "name": "Dr. Neuro",
      "type": "user",
      "description": "A user associated with the ElizaOS project who suggested exporting image datasets for LoRa models and provided an answer about the project's future.",
      "aliases": [
        "Dr. Neuro"
      ]
    },
    {
      "name": "Omid sa",
      "type": "user",
      "description": "A community member or developer associated with ElizaOS who provided assistance with token migration issues and explained the process for unclaimed tokens.",
      "aliases": [
        "Omid sa"
      ]
    },
    {
      "name": "The Light",
      "type": "user",
      "description": "A community member associated with ElizaOS who offered advice on token migration and provided information about the use case for the new token.",
      "aliases": [
        "The Light"
      ]
    },
    {
      "name": "jasyn_bjorn",
      "type": "user",
      "description": "An individual associated with ElizaOS who confirmed that Babylon and future releases will not have new tokens.",
      "aliases": [
        "jasyn_bjorn"
      ]
    },
    {
      "name": "cjft",
      "type": "user",
      "description": "A contributor to ElizaOS who clarified the functionality of runtime::generateText and runtime::useModel, and confirmed the core functionalities now work in browser environments.",
      "aliases": [
        "cjft"
      ]
    },
    {
      "name": "Phantom wallet",
      "type": "project",
      "description": "A cryptocurrency wallet that can be integrated with ElizaOS projects, particularly for migrating tokens or accessing browser-based functionalities.",
      "aliases": [
        "Phantom wallet"
      ]
    },
    {
      "name": "Tangem wallet",
      "type": "project",
      "description": "A hardware cryptocurrency wallet that has been mentioned in the context of ElizaOS token migration, requiring specific steps for users to migrate their holdings.",
      "aliases": [
        "Tangem wallet"
      ]
    },
    {
      "name": "Marc A",
      "type": "user",
      "description": "An individual who requested the name change from AI16Z to ElizaOS due to trademark conflicts with his a16z corp.",
      "aliases": [
        "Marc A"
      ]
    },
    {
      "name": "GitHub",
      "type": "project",
      "description": "A platform for version control and software development collaboration, where code repositories and pull requests for ElizaOS projects are managed.",
      "aliases": [
        "GitHub"
      ]
    },
    {
      "name": "Uniswap",
      "type": "project",
      "description": "A decentralized exchange protocol, relevant to discussions about liquidity pools and potential arbitrage opportunities during token migrations.",
      "aliases": [
        "Uniswap"
      ]
    },
    {
      "name": "Base",
      "type": "token",
      "description": "A Layer 2 scaling solution for Ethereum, mentioned as a potential blockchain for implementing ElizaOS related applications with wallet connect functionality.",
      "aliases": [
        "Base"
      ]
    },
    {
      "name": "BNB chain",
      "type": "token",
      "description": "A blockchain network, also known as Binance Smart Chain, considered for ElizaOS applications that require mobile-friendly web interfaces and wallet connect.",
      "aliases": [
        "BNB chain"
      ]
    },
    {
      "name": "Discord",
      "type": "project",
      "description": "A communication platform used for discussions and community engagement related to the ElizaOS project, hosting various channels for technical implementation, project direction, and support.",
      "aliases": [
        "Discord"
      ]
    },
    {
      "name": "TestFlight",
      "type": "project",
      "description": "A beta testing platform used for distributing pre-release versions of mobile applications, mentioned in the context of the upcoming 'eliza app' from the ElizaOS project.",
      "aliases": [
        "TestFlight"
      ]
    },
    {
      "name": "Eigen Layer",
      "type": "project",
      "description": "A protocol for restaking on Ethereum, with potential collaborations discussed in relation to ElizaOS development.",
      "aliases": [
        "Eigen Layer"
      ]
    },
    {
      "name": "Solana",
      "type": "token",
      "description": "A high-performance blockchain platform, mentioned in the context of bridging ElizaOS tokens between different chains.",
      "aliases": [
        "Solana"
      ]
    },
    {
      "name": "Ethereum",
      "type": "token",
      "description": "A decentralized blockchain network known for its smart contract functionality, mentioned in relation to potential integrations and scaling solutions like Eigen Layer.",
      "aliases": [
        "Ethereum"
      ]
    },
    {
      "name": "Jumper.exchange",
      "type": "project",
      "description": "A cross-chain bridge service that can be used to transfer ElizaOS tokens between different blockchain networks, such as BSC and Solana.",
      "aliases": [
        "Jumper.exchange"
      ]
    },
    {
      "name": "Binance",
      "type": "project",
      "description": "A major cryptocurrency exchange, mentioned in the context of a missed airdrop opportunity that impacted ElizaOS's marketing coordination.",
      "aliases": [
        "Binance"
      ]
    },
    {
      "name": "Phala",
      "type": "project",
      "description": "A cloud computing service that offers secure computation environments, relevant to ElizaOS development concerning TEE (Trusted Execution Environment) projects and potential build errors.",
      "aliases": [
        "Phala"
      ]
    },
    {
      "name": "Cloudflare",
      "type": "project",
      "description": "A content delivery network and security company whose network issues have impacted various services, including those related to ElizaOS development.",
      "aliases": [
        "Cloudflare"
      ]
    },
    {
      "name": "Gemini",
      "type": "project",
      "description": "A cryptocurrency exchange where trading of Spartan assets may be facilitated, as discussed in a question regarding ease of access.",
      "aliases": [
        "Gemini"
      ]
    },
    {
      "name": "Spartan trading",
      "type": "project",
      "description": "A trading activity or asset mentioned in the context of Gemini exchange, with a question about the ease of obtaining it.",
      "aliases": [
        "Spartan trading"
      ]
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-29T08:05:30.521428Z"
  }
}