{
  "source": "2025-07-30.json",
  "entities": [
    {
      "name": "ElizaOS",
      "type": "project",
      "description": "An agent framework for developing AI agents. It focuses on core infrastructure, plugin development, and providing solutions for agent hosting.",
      "aliases": [
        "elizaOS"
      ]
    },
    {
      "name": "X/Twitter",
      "type": "project",
      "description": "A microblogging and social networking service where users post and interact with messages known as 'tweets'.",
      "aliases": [
        "Twitter",
        "X",
        "X (Twitter)"
      ]
    },
    {
      "name": "Radix UI",
      "type": "project",
      "description": "A library of accessible, unstyled components for building high-quality digital experiences.",
      "aliases": []
    },
    {
      "name": "Bun",
      "type": "project",
      "description": "Fast all-in-one JavaScript runtime, bundler, transpiler, and package manager. Logo is a white bun on a black background.",
      "aliases": []
    },
    {
      "name": "Discord",
      "type": "project",
      "description": "A free voice, video, and text communication service for communities. It is popular among gamers and tech communities.",
      "aliases": []
    },
    {
      "name": "Shaw",
      "type": "user",
      "description": "A team actively developing ElizaOS v3 and core infrastructure components.",
      "aliases": [
        "Shaw team"
      ]
    },
    {
      "name": "Clank Tank",
      "type": "project",
      "description": "An internal hackathon within the ElizaOS project, used for Q&A v2 testing.",
      "aliases": []
    },
    {
      "name": "Odilitime",
      "type": "user",
      "description": "A contributor to the ElizaOS project, having proposed solutions for logging and data management.",
      "aliases": []
    },
    {
      "name": "AutoFun",
      "type": "project",
      "description": "A Telegram group manager and platform related to the ELI5 cryptocurrency.",
      "aliases": []
    },
    {
      "name": "ELI5",
      "type": "token",
      "description": "A cryptocurrency within the AutoFun ecosystem, distinct from ElizaOS's AI16z token.",
      "aliases": []
    },
    {
      "name": "AI16z",
      "type": "token",
      "description": "The ticker symbol and associated token for the ElizaOS agent framework.",
      "aliases": [
        "$ai16z"
      ]
    },
    {
      "name": "GitHub",
      "type": "project",
      "description": "A web-based platform and repository for version control using Git. It is used for hosting projects, collaborating, and tracking changes.",
      "aliases": []
    },
    {
      "name": "GLM-4.5",
      "type": "project",
      "description": "An open-source language model known for its performance, rivaling commercial models.",
      "aliases": []
    },
    {
      "name": "0xbbjoker",
      "type": "user",
      "description": "A community member providing technical assistance and solutions for ElizaOS development issues.",
      "aliases": []
    },
    {
      "name": "plugin-openrouter",
      "type": "project",
      "description": "A plugin within the ElizaOS framework that allows for interaction with language models, with temperature settings being a configurable parameter.",
      "aliases": []
    },
    {
      "name": "ChatGPT",
      "type": "project",
      "description": "A conversational AI chatbot developed by OpenAI, known for its ability to generate human-like text.",
      "aliases": [
        "Sonnet",
        "Opus"
      ]
    },
    {
      "name": "satsbased",
      "type": "user",
      "description": "A community member who confirmed the return of the ElizaOS X/Twitter account.",
      "aliases": []
    },
    {
      "name": "agentVooc",
      "type": "user",
      "description": "A community member researching AI email generation tools and who created a fork of ElizaOS.",
      "aliases": []
    },
    {
      "name": "Chrome",
      "type": "project",
      "description": "A web browser developed by Google, used for accessing websites and web applications.",
      "aliases": [
        "Chromium"
      ]
    },
    {
      "name": "EVM",
      "type": "project",
      "description": "A plugin within the ElizaOS ecosystem, users have reported issues with its functionality.",
      "aliases": []
    },
    {
      "name": "Gaianet",
      "type": "project",
      "description": "A plugin within the ElizaOS ecosystem that appears to be missing in the current version.",
      "aliases": []
    },
    {
      "name": "Ollama",
      "type": "project",
      "description": "A tool that allows users to run large language models locally on their machines, often used in conjunction with other AI frameworks.",
      "aliases": []
    },
    {
      "name": "Venice",
      "type": "project",
      "description": "A plugin within the ElizaOS ecosystem that serves as an example for custom plugin development.",
      "aliases": []
    },
    {
      "name": "Dr. Neuro",
      "type": "user",
      "description": "A community member who provided detailed explanations differentiating ELI5 and AI16z.",
      "aliases": []
    },
    {
      "name": "MacGPT",
      "type": "project",
      "description": "Unknown - needs research",
      "aliases": []
    },
    {
      "name": "Kenk",
      "type": "user",
      "description": "A team member of ElizaOS, providing updates on project status and developments.",
      "aliases": []
    },
    {
      "name": "Rick",
      "type": "user",
      "description": "A community member who shared information about upcoming ElizaOS developments and plans.",
      "aliases": []
    },
    {
      "name": "CJFT",
      "type": "user",
      "description": "A community member who highlighted challenges with browser automation and API integration in ElizaOS.",
      "aliases": []
    },
    {
      "name": "Whisper",
      "type": "project",
      "description": "A speech-to-text model, previously integrated with local-ai for ElizaOS but currently broken.",
      "aliases": []
    },
    {
      "name": "local-ai",
      "type": "project",
      "description": "A discontinued project that previously provided local AI model integration, including Whisper, for ElizaOS.",
      "aliases": []
    },
    {
      "name": "Odilitime",
      "type": "user",
      "description": "A contributor to the ElizaOS project, having proposed solutions for logging and data management.",
      "aliases": [
        "Odilitime"
      ]
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-29T07:42:38.985860Z"
  }
}