{
  "source": "2025-05-08.json",
  "entities": [
    {
      "name": "ElizaOS",
      "type": "project",
      "description": "An operating system for AI agents that manages the development and deployment of plugins and agents.",
      "aliases": [
        "ElizaOS"
      ],
      "visual_hints": "Abstract, futuristic, possibly featuring circuitry or network motifs."
    },
    {
      "name": "$FAN",
      "type": "token",
      "description": "A cryptocurrency token associated with the ElizaOS ecosystem.",
      "aliases": [
        "$FAN"
      ],
      "visual_hints": "Often represented by a fan icon or related imagery."
    },
    {
      "name": "Doodles (DOOD)",
      "type": "token",
      "description": "A cryptocurrency token related to the Doodles NFT project.",
      "aliases": [
        "Doodles (DOOD)",
        "DOOD"
      ],
      "visual_hints": "Playful, often featuring cartoonish characters or bold colors associated with the Doodles NFT collection."
    },
    {
      "name": "GitHub",
      "type": "platform",
      "description": "A web-based platform for version control and collaboration on software development projects.",
      "aliases": [
        "GitHub"
      ],
      "visual_hints": "Octocat logo, black and white, code-related imagery."
    },
    {
      "name": "LMStudio",
      "type": "platform",
      "description": "A desktop application that allows users to run and interact with large language models locally.",
      "aliases": [
        "LMStudio"
      ],
      "visual_hints": "Studio or computer-related imagery, possibly with AI or brain motifs."
    },
    {
      "name": "Ollama",
      "type": "platform",
      "description": "A platform for running large language models locally, often used by developers.",
      "aliases": [
        "Ollama"
      ],
      "visual_hints": "Abstract, possibly related to containers or local execution."
    },
    {
      "name": "AI16Z",
      "type": "token",
      "description": "A cryptocurrency token within the ElizaOS ecosystem, used for buybacks and ecosystem value.",
      "aliases": [
        "AI16Z"
      ],
      "visual_hints": "Modern, tech-focused, possibly with a numerical or abstract symbol."
    },
    {
      "name": "Neon",
      "type": "platform",
      "description": "A database service utilized within the ElizaOS ecosystem, known for its compute unit usage.",
      "aliases": [
        "Neon database"
      ],
      "visual_hints": "Often associated with a distinctive blue or vibrant color palette, possibly data or database related."
    },
    {
      "name": "auto.fun",
      "type": "platform",
      "description": "A launchpad platform for agent teams building with ElizaOS, which uses a portion of fees for AI16Z token buybacks.",
      "aliases": [
        "auto.fun"
      ],
      "visual_hints": "Automated, possibly fun or game-like interface elements, related to launches or platforms."
    },
    {
      "name": "Twitter",
      "type": "platform",
      "description": "A social media platform known for microblogging and real-time updates.",
      "aliases": [
        "Twitter"
      ],
      "visual_hints": "Blue bird logo."
    },
    {
      "name": "GraphQL",
      "type": "project",
      "description": "A query language for APIs and a runtime for fulfilling those queries with existing data.",
      "aliases": [
        "GraphQL"
      ],
      "visual_hints": "Abstract, related to data fetching or API communication, possibly with a wave or network motif."
    },
    {
      "name": "Doodles",
      "type": "project",
      "description": "A collection of non-fungible tokens (NFTs) featuring unique, cartoonish characters.",
      "aliases": [
        "Doodles"
      ],
      "visual_hints": "Playful, colorful, cartoonish characters."
    },
    {
      "name": "ELI5",
      "type": "token",
      "description": "A cryptocurrency token discussed in the context of the ElizaOS ecosystem and broader token ecosystem.",
      "aliases": [
        "ELI5"
      ],
      "visual_hints": "Could be related to 'Explain Like I'm 5', potentially simple or educational in theme."
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-28T06:49:30.422123Z"
  }
}