{
  "source": "2025-11-26.json",
  "entities": [
    {
      "name": "AI16Z",
      "type": "token",
      "description": "A token involved in a migration process.",
      "aliases": [
        "ai16z"
      ]
    },
    {
      "name": "ELIZAOS",
      "type": "project",
      "description": "A project or platform, potentially related to AI agents, with a focus on logging standardization and OpenAI-compatible APIs. It is involved in a token migration process from AI16Z.",
      "aliases": [
        "elizaOS",
        "eliza-cloud-v2"
      ]
    },
    {
      "name": "Babylon",
      "type": "project",
      "description": "A project that has achieved significant growth in signups and is being promoted within Ethereum communities. It focuses on developing open standards for autonomous agents and has demonstrated its capabilities at events.",
      "aliases": [
        "Babylon project",
        "Babylon Labs"
      ]
    },
    {
      "name": "GitHub",
      "type": "project",
      "description": "A web-based platform for version control and collaboration on software development projects, utilizing Git to manage code. It hosts repositories and facilitates code reviews and pull requests.",
      "aliases": []
    },
    {
      "name": "OpenAI",
      "type": "project",
      "description": "A research laboratory focused on artificial intelligence, known for developing advanced AI models and technologies. It aims to ensure that artificial general intelligence benefits all of humanity.",
      "aliases": []
    },
    {
      "name": "Bithumb",
      "type": "project",
      "description": "A South Korean cryptocurrency exchange that has been involved in discussions and issues related to token migration.",
      "aliases": []
    },
    {
      "name": "Kraken",
      "type": "project",
      "description": "A cryptocurrency exchange that is involved in discussions and issues related to token migration.",
      "aliases": []
    },
    {
      "name": "Ethereum Foundation",
      "type": "project",
      "description": "An organization that supports AI builders and is involved in developing open standards for autonomous agents.",
      "aliases": []
    },
    {
      "name": "Odilitime",
      "type": "user",
      "description": "A contributor who updated a Pull Request for the elizaOS/eliza repository.",
      "aliases": []
    },
    {
      "name": "Stan",
      "type": "user",
      "description": "A contributor who approved a Pull Request for the elizaOS/eliza repository and ran security scans.",
      "aliases": []
    },
    {
      "name": "Trustless Agents day",
      "type": "project",
      "description": "An event where the Babylon project was demonstrated.",
      "aliases": []
    },
    {
      "name": "elizaOS/eliza",
      "type": "project",
      "description": "A software repository related to the elizaOS project, hosting code and development activity, including Pull Requests.",
      "aliases": []
    },
    {
      "name": "Shaw",
      "type": "user",
      "description": "An influencer who promoted the Babylon project.",
      "aliases": []
    },
    {
      "name": "Marco",
      "type": "user",
      "description": "An influencer who promoted the Babylon project.",
      "aliases": []
    },
    {
      "name": "Coinone",
      "type": "project",
      "description": "A cryptocurrency exchange in South Korea that has been mentioned in the context of token migration issues.",
      "aliases": []
    },
    {
      "name": "Phantom wallet",
      "type": "project",
      "description": "A cryptocurrency wallet that users utilize to store and manage digital assets, and from which tokens might be withdrawn.",
      "aliases": []
    },
    {
      "name": "Serikiki",
      "type": "user",
      "description": "A community member who provided information and guidance on token migration processes and eligibility.",
      "aliases": []
    },
    {
      "name": "Arceon",
      "type": "user",
      "description": "A community member who provided information and guidance on token migration processes and eligibility, particularly for manual migrations.",
      "aliases": []
    },
    {
      "name": "jasyn_bjorn",
      "type": "user",
      "description": "A team member who responded to questions about communication with exchanges and assisted users with channel access.",
      "aliases": []
    },
    {
      "name": "The Light",
      "type": "user",
      "description": "A community member who provided information regarding initial token eligibility and future exchange listings.",
      "aliases": []
    },
    {
      "name": "Omid Sa",
      "type": "user",
      "description": "A community member who provided assistance and explained migration eligibility criteria to users.",
      "aliases": []
    },
    {
      "name": "hns71",
      "type": "user",
      "description": "A community member who shared information from Kraken support regarding ongoing migration issue resolution.",
      "aliases": []
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-29T08:06:05.498046Z"
  }
}