{
  "source": "2025-11-27.json",
  "entities": [
    {
      "name": "AI16Z",
      "type": "token",
      "description": "A cryptocurrency token involved in a migration process with ElizaOS. It has specific snapshot dates determining eligibility.",
      "aliases": [
        "ai16z"
      ]
    },
    {
      "name": "ElizaOS",
      "type": "project",
      "description": "An operating system or platform related to AI development, undergoing token migration issues and core feature development. It is positioned to act as an API service.",
      "aliases": [
        "elizaOS"
      ]
    },
    {
      "name": "Bithumb",
      "type": "project",
      "description": "A cryptocurrency exchange that encountered issues during the AI16Z to ElizaOS token migration, leading to user frustration and trust issues.",
      "aliases": []
    },
    {
      "name": "Babylon",
      "type": "project",
      "description": "A project focused on agent infrastructure, which has reached significant user signups and is being positioned as a joint venture with Ethereum developers. It may spin out as Babylon Labs.",
      "aliases": [
        "Babylon marketplace"
      ]
    },
    {
      "name": "Anthropic",
      "type": "project",
      "description": "A company that has published an article discussing effective harnesses for long-running agents.",
      "aliases": []
    },
    {
      "name": "Stan",
      "type": "user",
      "description": "A developer or user who requested a review for a pull request and is involved in code hotfixes and security scans.",
      "aliases": []
    },
    {
      "name": "Kraken",
      "type": "project",
      "description": "A cryptocurrency exchange that has had reported issues with the AI16Z to ElizaOS token migration process.",
      "aliases": []
    },
    {
      "name": "Ethereum",
      "type": "token",
      "description": "A decentralized, open-source blockchain system that establishes a smart contract functionality. It is supporting AI builders and the development of open standards for autonomous agents.",
      "aliases": [
        "Ethereum Foundation"
      ]
    },
    {
      "name": "MEXC",
      "type": "project",
      "description": "A cryptocurrency exchange that hosted a spaces event involving the ElizaOS team.",
      "aliases": []
    },
    {
      "name": "MOCA",
      "type": "project",
      "description": "A team that had discussions with the ElizaOS team.",
      "aliases": []
    },
    {
      "name": "8004",
      "type": "project",
      "description": "An open standard for autonomous agents being developed and supported by the Ethereum Foundation.",
      "aliases": []
    },
    {
      "name": "x402",
      "type": "project",
      "description": "An open standard for autonomous agents being developed and supported by the Ethereum Foundation.",
      "aliases": []
    },
    {
      "name": "Odilitime",
      "type": "user",
      "description": "A developer or user who updated and expanded a pull request, assisted users with token migration, and directed others to relevant channels.",
      "aliases": []
    },
    {
      "name": "Serikiki",
      "type": "user",
      "description": "A community member who confirmed that providing screenshots of token purchases before November 11 is sufficient proof for manual migration and advised users to leave tokens on exchanges.",
      "aliases": []
    },
    {
      "name": "Arceon",
      "type": "user",
      "description": "A community member who explained the eligibility for manual migration with proof of ownership for tokens held before the snapshot date.",
      "aliases": []
    },
    {
      "name": "jasyn_bjorn",
      "type": "user",
      "description": "A team member who confirmed communication with Bithumb after the snapshot and manually granted access to a ticket channel for a user experiencing CAPTCHA issues.",
      "aliases": []
    },
    {
      "name": "The Light",
      "type": "user",
      "description": "A community member who clarified that AI16Z tokens purchased after November 11th are not eligible for migration and directed users to migration channels.",
      "aliases": []
    },
    {
      "name": "Coinone",
      "type": "project",
      "description": "A Korean cryptocurrency exchange that is experiencing token migration issues with AI16Z to ElizaOS.",
      "aliases": []
    },
    {
      "name": "Vercel",
      "type": "project",
      "description": "A cloud platform that is incurring significant costs due to inefficient API code and high bandwidth usage by the Babylon project.",
      "aliases": []
    },
    {
      "name": "Emmett",
      "type": "user",
      "description": "A developer or user who requested a review for pull request #6166 and is involved in code development.",
      "aliases": []
    },
    {
      "name": "CJFT",
      "type": "user",
      "description": "A user who provided information on Babylon's bandwidth usage, Vercel costs, and the legitimacy of signups, attributing them to inefficient API code and airdrop farmers.",
      "aliases": []
    },
    {
      "name": "SHA1-Hulud",
      "type": "project",
      "description": "A security issue or vulnerability that was discussed by the ElizaOS team, affecting dependencies.",
      "aliases": [
        "Sha1-Hulud pt2 Attack"
      ]
    },
    {
      "name": "RobinHood",
      "type": "project",
      "description": "A financial services platform that users are inquiring about for ElizaOS listings.",
      "aliases": []
    },
    {
      "name": "Marco",
      "type": "user",
      "description": "An influencer who promoted the Babylon project within Ethereum communities.",
      "aliases": []
    },
    {
      "name": "GitHub",
      "type": "project",
      "description": "A platform used for code hosting, collaboration, and version control, where pull requests and code reviews are managed.",
      "aliases": []
    },
    {
      "name": "Omid Sa",
      "type": "user",
      "description": "A community member who provided extensive assistance to users regarding token migration eligibility and access to the migration portal.",
      "aliases": []
    },
    {
      "name": "hns71",
      "type": "user",
      "description": "A community member who shared information from Kraken support regarding their work on the AU16Z to ElizaOS token migration issue.",
      "aliases": []
    },
    {
      "name": "Kenk",
      "type": "user",
      "description": "A community member who confirmed that providing screenshots of token purchases before November 11 is sufficient proof for manual migration and explained how Babylon is going viral.",
      "aliases": []
    },
    {
      "name": "Shaw",
      "type": "user",
      "description": "A person who spoke at an event and promoted the Babylon project within Ethereum communities.",
      "aliases": []
    },
    {
      "name": "Kara",
      "type": "user",
      "description": "A user who asked for confirmation on converting AI16Z tokens bought before November to ElizaOS tokens.",
      "aliases": []
    },
    {
      "name": "degenwtf",
      "type": "user",
      "description": "A user who asked about AI16Z tokens traded on exchanges after the 11th.",
      "aliases": []
    },
    {
      "name": "Jo",
      "type": "user",
      "description": "A user who inquired about ElizaOS not being listed in the x402 Ecosystem on CoinGecko.",
      "aliases": []
    },
    {
      "name": "SKW",
      "type": "user",
      "description": "A user who asked about the exchange listing and contract information.",
      "aliases": []
    },
    {
      "name": "Numerical Methods",
      "type": "user",
      "description": "A user who inquired about developments regarding ElizaOS token listings on Tier 1 exchanges.",
      "aliases": []
    },
    {
      "name": "good",
      "type": "user",
      "description": "A user who inquired about the status of discussions between the ElizaOS team and Bithumb.",
      "aliases": []
    },
    {
      "name": "Arceon",
      "type": "user",
      "description": "A user who asked if there was a recording of Shaw's speech at Devconnect and explained manual migration eligibility.",
      "aliases": []
    },
    {
      "name": "GARAJ",
      "type": "user",
      "description": "A user who asked about the expected review time for support tickets.",
      "aliases": []
    },
    {
      "name": "Vebevebe",
      "type": "user",
      "description": "A user who asked about bribes for ElizaOS on Aerodrome.",
      "aliases": []
    },
    {
      "name": "DRACOK",
      "type": "user",
      "description": "A user who explained that centralized exchanges operate differently and the team is only swapping up to the snapshot amount.",
      "aliases": []
    },
    {
      "name": "KARA",
      "type": "user",
      "description": "A user who asked if it is possible to convert AI16Z tokens bought before November to ElizaOS tokens on the swap site.",
      "aliases": []
    },
    {
      "name": "KenK",
      "type": "user",
      "description": "A user who stated that Bithumb would ideally help with proof of the November 11th snapshot and explained how Babylon is going viral.",
      "aliases": []
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-29T08:06:13.247935Z"
  }
}