{
  "source": "2025-10-09.json",
  "entities": [
    {
      "name": "ElizaOS",
      "type": "project",
      "description": "A project focused on building a 'generative economy' where AI agents can compound intelligence. It is developing a new product called Eliza Cloud for AI agent deployment.",
      "aliases": [
        "elizaOS"
      ]
    },
    {
      "name": "AI16Z",
      "type": "token",
      "description": "A token that is undergoing a migration to ElizaOS tokens with a 1:6 conversion ratio.",
      "aliases": [
        "ai16z"
      ]
    },
    {
      "name": "Eliza Cloud",
      "type": "project",
      "description": "A new product for AI agent deployment, developed by ElizaOS. It is expected to launch after the token migration.",
      "aliases": []
    },
    {
      "name": "Odilitime",
      "type": "user",
      "description": "A user who is active in the ElizaOS community, answering questions and creating forms for community engagement.",
      "aliases": []
    },
    {
      "name": "0xbbjoker",
      "type": "user",
      "description": "A user seeking confirmation about the implementation approach for event bus refactoring in Eliza.",
      "aliases": []
    },
    {
      "name": "Shaw",
      "type": "user",
      "description": "A user suggesting a focus on major handlers like voice and image during event bus refactoring in Eliza.",
      "aliases": []
    },
    {
      "name": "Sam-developer",
      "type": "user",
      "description": "A user mentioning work on implementing an API-Explorer (Swagger interface) for their API SaaS offering in Cloud.",
      "aliases": []
    },
    {
      "name": "Solana",
      "type": "token",
      "description": "A blockchain platform. Users are collecting Solana wallet addresses for an airdrop opportunity.",
      "aliases": [
        "Solana"
      ]
    },
    {
      "name": "Discord",
      "type": "project",
      "description": "A communication platform where discussions about ElizaOS, its features, and development take place.",
      "aliases": []
    },
    {
      "name": "Tally",
      "type": "project",
      "description": "A platform or tool used to create forms for collecting information, such as Solana wallet addresses.",
      "aliases": []
    },
    {
      "name": "MetaDAO",
      "type": "project",
      "description": "Unknown - needs research",
      "aliases": []
    },
    {
      "name": "GitHub",
      "type": "project",
      "description": "A web-based platform for version control and collaboration, used for managing ElizaOS project repositories.",
      "aliases": []
    },
    {
      "name": "Renovate",
      "type": "project",
      "description": "An automated dependency management tool used across ElizaOS plugin repositories to keep projects secure and up-to-date.",
      "aliases": []
    },
    {
      "name": "Zod",
      "type": "project",
      "description": "A modern data validation library that ElizaOS is upgrading across its ecosystem to improve reliability.",
      "aliases": []
    },
    {
      "name": "Phala",
      "type": "project",
      "description": "A cloud platform that ElizaOS can be deployed on, in addition to other options like Railways.",
      "aliases": []
    },
    {
      "name": "Railways",
      "type": "project",
      "description": "A platform that is suggested as an easy and cheap option for deploying the backend of ElizaOS.",
      "aliases": []
    },
    {
      "name": "Swagger",
      "type": "project",
      "description": "An interface that is being implemented to improve integration with Eliza Cloud's API SaaS offering.",
      "aliases": []
    },
    {
      "name": "0xTDL",
      "type": "user",
      "description": "A user providing information about the token migration process, specifically regarding automatic conversion on exchanges.",
      "aliases": []
    },
    {
      "name": "Kenk",
      "type": "user",
      "description": "A user providing clarification on the token conversion ratio during the ElizaOS migration.",
      "aliases": []
    },
    {
      "name": "Leon",
      "type": "user",
      "description": "A user asking a question about the expected launch time of Eliza Cloud in relation to the token migration.",
      "aliases": []
    },
    {
      "name": "eddyg6580",
      "type": "user",
      "description": "A user asking about the handling of open perpetual futures positions on a Decentralized Exchange (DEX) during the token migration.",
      "aliases": []
    },
    {
      "name": "aubrey",
      "type": "user",
      "description": "A user asking about the timing of the token migration, questioning if it will occur this month or the next.",
      "aliases": []
    },
    {
      "name": "GujuViper",
      "type": "user",
      "description": "A user asking for clarification on the token conversion ratio during the ElizaOS migration process.",
      "aliases": []
    },
    {
      "name": "Jonathas Miguel",
      "type": "user",
      "description": "A user inquiring about the automatic conversion process of AI16z tokens to ElizaOS tokens on Binance.",
      "aliases": []
    },
    {
      "name": "wenj.u.p",
      "type": "user",
      "description": "A user asking how the ElizaOS community can claim the $RECALL ecosystem airdrop.",
      "aliases": []
    },
    {
      "name": "473228",
      "type": "user",
      "description": "A user asking multiple questions regarding the handling of futures positions, trading suspension, and migration timing during the token migration.",
      "aliases": []
    },
    {
      "name": "mcp-gateway",
      "type": "project",
      "description": "A recommended gateway for making remote connections to MCP servers.",
      "aliases": []
    },
    {
      "name": "MCP",
      "type": "project",
      "description": "A protocol for machine conversation that has had discussions around server connections and remote access.",
      "aliases": [
        "Machine Conversation Protocol"
      ]
    },
    {
      "name": "770480365818927144",
      "type": "user",
      "description": "The user who created the Tally form to collect Solana wallet addresses.",
      "aliases": []
    },
    {
      "name": "The 0xTdl",
      "type": "user",
      "description": "A user providing information about the token migration process, specifically regarding automatic conversion on exchanges.",
      "aliases": [
        "0xTDL ⚡"
      ]
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-29T07:57:07.257786Z"
  }
}