{
  "source": "2025-06-07.json",
  "entities": [
    {
      "name": "ELI5",
      "type": "token",
      "description": "A token associated with auto.fun and ElizaOS, originally an auto.fun CTO character that has become a mascot. It is being discussed as a potential growth catalyst for the auto.fun platform and the broader ecosystem.",
      "aliases": [
        "ELI5 token",
        "ELI5 token",
        "ELI5"
      ]
    },
    {
      "name": "auto.fun",
      "type": "project",
      "description": "A platform or service that has a CTO character and a token associated with it. It appears to be involved in the growth and expansion of its ecosystem.",
      "aliases": [
        "auto.fun"
      ]
    },
    {
      "name": "GitHub",
      "type": "project",
      "description": "A web-based platform that provides version control using Git. It is used for software development, collaboration, and code hosting.",
      "aliases": [
        "GitHub"
      ]
    },
    {
      "name": "Elon Musk",
      "type": "user",
      "description": "An individual known for public conflicts and generating significant social media attention.",
      "aliases": [
        "Elon Musk"
      ]
    },
    {
      "name": "Trump",
      "type": "user",
      "description": "An individual known for public conflicts and generating significant social media attention.",
      "aliases": [
        "Trump"
      ]
    },
    {
      "name": "AI",
      "type": "project",
      "description": "Technology that enables machines to simulate human intelligence processes such as learning, problem-solving, and decision-making.",
      "aliases": [
        "AI technology"
      ]
    },
    {
      "name": "shawmakesmagic",
      "type": "user",
      "description": "A user who shared a video discussing the evolution of AI agents.",
      "aliases": [
        "@shawmakesmagic"
      ]
    },
    {
      "name": "OpenAI",
      "type": "project",
      "description": "An artificial intelligence research and development company. They are involved in disputes regarding user privacy and demands to delete user data.",
      "aliases": [
        "OpenAI"
      ]
    },
    {
      "name": "NYT",
      "type": "project",
      "description": "A news organization that has made a court request regarding user chats.",
      "aliases": [
        "NYT"
      ]
    },
    {
      "name": "sama",
      "type": "user",
      "description": "An individual emphasizing the protection of user privacy, associated with OpenAI.",
      "aliases": [
        "@sama"
      ]
    },
    {
      "name": "dogwifhat",
      "type": "token",
      "description": "A successful meme token that ELI5 is being compared to for its potential to gain traction and drive traffic.",
      "aliases": [
        "dogwifhat"
      ]
    },
    {
      "name": "eliza",
      "type": "project",
      "description": "A system or platform that has associated characters and tokens, including ELI5. It seems to be part of a broader ecosystem where community growth and token initiatives are significant.",
      "aliases": [
        "eliza"
      ]
    },
    {
      "name": "DOT",
      "type": "token",
      "description": "A token within the FUN ecosystem that ELI5 has a relationship with.",
      "aliases": [
        "DOT"
      ]
    },
    {
      "name": "FUN",
      "type": "project",
      "description": "An ecosystem that includes the token DOT and is related to the ELI5 token.",
      "aliases": [
        "FUN"
      ]
    },
    {
      "name": "Jin",
      "type": "user",
      "description": "A user who shared early previews of JedAI council episodes and is working on automating publication and Discord integration.",
      "aliases": [
        "Jin"
      ]
    },
    {
      "name": "JedAI",
      "type": "project",
      "description": "A council whose episodes Jin is sharing early previews of.",
      "aliases": [
        "JedAI council"
      ]
    },
    {
      "name": "Eleven Labs",
      "type": "project",
      "description": "A company or service that provides an API (v3) which pragmatiko is interested in trying with Eliza.",
      "aliases": [
        "Eleven Labs"
      ]
    },
    {
      "name": "pragmatiko",
      "type": "user",
      "description": "A user interested in trying Eliza with the Eleven Labs v3 API.",
      "aliases": [
        "pragmatiko"
      ]
    },
    {
      "name": "elizaOS",
      "type": "project",
      "description": "A development project with associated Discord servers where community activity and technical discussions take place. It has a main Discord server and an inactive development server.",
      "aliases": [
        "elizaOS"
      ]
    },
    {
      "name": "elizaOS Development",
      "type": "project",
      "description": "A Discord server associated with the elizaOS project, where community activity has moved to a new main server.",
      "aliases": [
        "elizaOS Development server"
      ]
    },
    {
      "name": "Discord",
      "type": "project",
      "description": "A communication platform used for community interaction, with various servers and channels for different discussions and support.",
      "aliases": [
        "Discord"
      ]
    },
    {
      "name": "tokens",
      "type": "token",
      "description": "Digital assets or cryptocurrencies used within various ecosystems.",
      "aliases": [
        "tokens"
      ]
    },
    {
      "name": "memecoins",
      "type": "token",
      "description": "A type of cryptocurrency that often originates from internet memes and can be highly volatile.",
      "aliases": [
        "memecoins"
      ]
    },
    {
      "name": "AI agents",
      "type": "project",
      "description": "Software agents powered by artificial intelligence that can perform various tasks, evolving from memecoin activities to creative tasks and work reshaping.",
      "aliases": [
        "AI agents"
      ]
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-29T07:36:15.534357Z"
  }
}