{
  "source": "2025-11-27.json",
  "entities": [
    {
      "name": "AI16Z",
      "type": "token",
      "description": "A token involved in a migration process to ElizaOS, with specific snapshot dates affecting eligibility.",
      "aliases": [
        "ai16z"
      ],
      "visual_hints": "No specific visual hints available."
    },
    {
      "name": "ElizaOS",
      "type": "project",
      "description": "An operating system or platform undergoing token migration and core feature development, potentially serving as an API service.",
      "aliases": [
        "elizaOS"
      ],
      "visual_hints": "Likely abstract, potentially with a focus on AI or user interaction."
    },
    {
      "name": "Bithumb",
      "type": "platform",
      "description": "A cryptocurrency exchange involved in controversies related to token migration eligibility and support for AI16Z to ElizaOS swaps.",
      "aliases": [],
      "visual_hints": "Associated with cryptocurrency trading, potentially with a Korean visual style."
    },
    {
      "name": "Babylon marketplace",
      "type": "project",
      "description": "A marketplace project that has reached 100k signups and is being positioned as a joint venture for agent infrastructure.",
      "aliases": [
        "Babylon project",
        "Babylon",
        "Babylon.market"
      ],
      "visual_hints": "Related to marketplaces and agent infrastructure, potentially with a focus on growth or networking."
    },
    {
      "name": "Anthropic",
      "type": "platform",
      "description": "A company that published an article about effective harnesses for long-running agents, relevant to AI development.",
      "aliases": [],
      "visual_hints": "Associated with AI research and development, possibly with a sleek, modern design."
    },
    {
      "name": "Ethereum",
      "type": "token",
      "description": "A blockchain platform whose developers are collaborating on agent infrastructure and open standards for autonomous agents.",
      "aliases": [
        "Ethereum developers",
        "Ethereum Foundation",
        "Ethereum communities"
      ],
      "visual_hints": "Associated with smart contracts, decentralized applications, and a wide ecosystem."
    },
    {
      "name": "Babylon Labs",
      "type": "project",
      "description": "A potential spin-out from the Babylon project, with ElizaOS serving as an API service.",
      "aliases": [],
      "visual_hints": "An extension of the Babylon project, suggesting a focus on business or enterprise solutions."
    },
    {
      "name": "Kraken",
      "type": "platform",
      "description": "A cryptocurrency exchange where users have reported migration issues with AI16Z tokens.",
      "aliases": [],
      "visual_hints": "A well-known cryptocurrency exchange logo, likely featuring tentacles or a kraken motif."
    },
    {
      "name": "Vercel",
      "type": "platform",
      "description": "A cloud platform facing high costs due to inefficient API code in the Babylon project.",
      "aliases": [],
      "visual_hints": "Associated with web development, deployment, and frontend frameworks."
    },
    {
      "name": "8004",
      "type": "project",
      "description": "An open standard for autonomous agents being developed.",
      "aliases": [],
      "visual_hints": "A technical standard, likely abstract or numerical in representation."
    },
    {
      "name": "x402",
      "type": "project",
      "description": "An open standard for autonomous agents being developed.",
      "aliases": [],
      "visual_hints": "A technical standard, likely abstract or numerical in representation."
    },
    {
      "name": "Coinone",
      "type": "platform",
      "description": "A South Korean cryptocurrency exchange mentioned in the context of token migration issues.",
      "aliases": [],
      "visual_hints": "Associated with cryptocurrency trading, potentially with a Korean visual style."
    },
    {
      "name": "MEXC",
      "type": "platform",
      "description": "An exchange where the ElizaOS team participated in a spaces event.",
      "aliases": [],
      "visual_hints": "A cryptocurrency exchange, likely with a global presence and diverse branding."
    },
    {
      "name": "MOCA",
      "type": "project",
      "description": "A team with whom ElizaOS had a discussion event.",
      "aliases": [],
      "visual_hints": "No specific visual hints available."
    },
    {
      "name": "RobinHood",
      "type": "platform",
      "description": "A trading platform mentioned in discussions about ElizaOS listings.",
      "aliases": [],
      "visual_hints": "Associated with commission-free stock and cryptocurrency trading, often depicted with a green color scheme."
    },
    {
      "name": "Aerodrome",
      "type": "platform",
      "description": "A decentralized exchange or platform where ElizaOS tokens might be offered.",
      "aliases": [],
      "visual_hints": "Associated with decentralized finance (DeFi), possibly with themes of air or flight."
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-28T07:07:55.677865Z"
  }
}