{
  "source": "2025-10-11.json",
  "entities": [
    {
      "name": "ElizaOS",
      "type": "project",
      "description": "A project that is preparing for a token migration and developing agent-governed financial systems.",
      "aliases": [],
      "visual_hints": "icon associated with a friendly AI or operating system"
    },
    {
      "name": "AI16Z",
      "type": "token",
      "description": "A token that is undergoing a migration to ElizaOS.",
      "aliases": [],
      "visual_hints": "icon associated with a cryptocurrency token, possibly with a futuristic or alphanumeric design"
    },
    {
      "name": "Capacitor.js",
      "type": "project",
      "description": "A technology chosen for mobile app development strategy over React Native, prioritizing faster time-to-market.",
      "aliases": [],
      "visual_hints": "icon associated with web development or mobile app frameworks"
    },
    {
      "name": "React Native",
      "type": "project",
      "description": "A mobile app development framework that was considered but not chosen over Capacitor.js.",
      "aliases": [],
      "visual_hints": "icon associated with a mobile app development framework"
    },
    {
      "name": "WorkOS",
      "type": "platform",
      "description": "An authentication system that ElizaOS is transitioning away from.",
      "aliases": [],
      "visual_hints": "icon associated with authentication or identity management services"
    },
    {
      "name": "Privy",
      "type": "platform",
      "description": "An authentication system ElizaOS is transitioning to.",
      "aliases": [],
      "visual_hints": "icon associated with authentication or identity management services"
    },
    {
      "name": "CCIP",
      "type": "project",
      "description": "A protocol that will be used for cross-chain operations with the ElizaOS token.",
      "aliases": [],
      "visual_hints": "icon associated with cross-chain communication or interoperability protocols"
    },
    {
      "name": "Hyperfy",
      "type": "platform",
      "description": "A partner contributing to social agent development, specifically an 'AI RuneScape'.",
      "aliases": [],
      "visual_hints": "icon associated with gaming or decentralized applications"
    },
    {
      "name": "AWS ECR",
      "type": "platform",
      "description": "A container registry service chosen over Cloudflare's registry due to storage limits.",
      "aliases": [],
      "visual_hints": "icon associated with cloud computing and containerization"
    },
    {
      "name": "Cloudflare",
      "type": "platform",
      "description": "A service provider whose container registry was not chosen due to storage limitations.",
      "aliases": [],
      "visual_hints": "icon associated with cloudflare's brand or network services"
    },
    {
      "name": "MEXC",
      "type": "platform",
      "description": "An exchange where AI16Z futures positions were reportedly open.",
      "aliases": [],
      "visual_hints": "icon associated with cryptocurrency exchanges"
    },
    {
      "name": "Ethereum Foundation",
      "type": "project",
      "description": "An organization ElizaOS is working with on an agent game using the ERC-8004 spec.",
      "aliases": [],
      "visual_hints": "icon associated with the Ethereum blockchain ecosystem"
    },
    {
      "name": "ERC-8004",
      "type": "project",
      "description": "A technical specification being used for an agent game developed with the Ethereum Foundation.",
      "aliases": [],
      "visual_hints": "icon associated with blockchain tokens or standards"
    },
    {
      "name": "Zod v4",
      "type": "project",
      "description": "A data validation library that the ElizaOS ecosystem is being upgraded to.",
      "aliases": [],
      "visual_hints": "icon associated with data validation or programming libraries"
    },
    {
      "name": "Renovate",
      "type": "platform",
      "description": "An automated dependency management tool being rolled out across ElizaOS plugin repositories.",
      "aliases": [],
      "visual_hints": "icon associated with automation or code management tools"
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-28T07:04:37.515252Z"
  }
}