{
  "source": "2025-05-19.json",
  "entities": [
    {
      "name": "ElizaOS",
      "type": "project",
      "description": "An operating system designed for AI agents, focusing on plugin development, API improvements, and governance systems. It is preparing for its 1.0.0 release, previously known as V2. The project has a significant GitHub presence and community engagement.",
      "aliases": [
        "elizaOS"
      ]
    },
    {
      "name": "GitHub",
      "type": "project",
      "description": "A platform providing hosting for software development version control using Git.",
      "aliases": []
    },
    {
      "name": "Shaw",
      "type": "user",
      "description": "A community member and developer involved with ElizaOS, who addressed rumors about Eliza v2 and announced the upcoming release.",
      "aliases": []
    },
    {
      "name": "THE COUNCIL",
      "type": "project",
      "description": "A new AI governance system described as 'Consensus Oracle Units Network'. It features AI agents trained on organizational data representing different archetypes.",
      "aliases": []
    },
    {
      "name": "Consensus Oracle Units Network",
      "type": "project",
      "description": "An AI governance system, also referred to as 'THE COUNCIL', which utilizes AI agents trained on organizational data.",
      "aliases": []
    },
    {
      "name": "Python",
      "type": "project",
      "description": "An interpreted, high-level, general-purpose programming language. Its design philosophy emphasizes code readability with its notable use of significant indentation.",
      "aliases": []
    },
    {
      "name": "Hyperfy",
      "type": "project",
      "description": "Unknown - needs research",
      "aliases": []
    },
    {
      "name": "DAOs",
      "type": "project",
      "description": "Decentralized Autonomous Organizations that operate via smart contracts on a blockchain, enabling community-driven decision-making.",
      "aliases": []
    },
    {
      "name": "DAOSdotFUN",
      "type": "project",
      "description": "A platform or project associated with DAOs, where a project launched with the tagline 'FUN'.",
      "aliases": [
        "DAOSdotFUN"
      ]
    },
    {
      "name": "Ollama",
      "type": "project",
      "description": "Unknown - needs research",
      "aliases": []
    },
    {
      "name": "Supabase",
      "type": "project",
      "description": "An open-source Firebase alternative that provides database, authentication, and storage solutions for web applications.",
      "aliases": []
    },
    {
      "name": "Polygon",
      "type": "project",
      "description": "A platform and framework for building and connecting blockchain networks. It offers solutions for scaling Ethereum.",
      "aliases": []
    },
    {
      "name": "Jupiter Swap",
      "type": "project",
      "description": "A decentralized exchange aggregator on Solana and other networks.",
      "aliases": []
    },
    {
      "name": "COM",
      "type": "token",
      "description": "A cryptocurrency token involved in liquidity pool discussions on ElizaOS.",
      "aliases": []
    },
    {
      "name": "AI16Z",
      "type": "token",
      "description": "A cryptocurrency token associated with ElizaOS, with discussions around its utility, governance participation, and liquidity pools.",
      "aliases": []
    },
    {
      "name": "SOL",
      "type": "token",
      "description": "A cryptocurrency token associated with the Solana blockchain.",
      "aliases": []
    },
    {
      "name": "Discord",
      "type": "project",
      "description": "A communication platform popular for its voice and text chat features, widely used by online communities and developers.",
      "aliases": []
    },
    {
      "name": "Eliza v1",
      "type": "project",
      "description": "An initial proof-of-concept version of ElizaOS, distinct from the main 1.0.0 release.",
      "aliases": []
    },
    {
      "name": "Eliza v2",
      "type": "project",
      "description": "The previous name for the upcoming main release of ElizaOS, now officially branded as 1.0.0.",
      "aliases": []
    },
    {
      "name": "Eliza 1.0.0",
      "type": "project",
      "description": "The upcoming main release of ElizaOS, previously referred to as V2. It represents a production-ready version of the operating system for AI agents.",
      "aliases": []
    },
    {
      "name": "dankvr",
      "type": "user",
      "description": "A user who introduced 'THE COUNCIL,' a new AI governance system, and shared experiences from '6 years of DAOs'.",
      "aliases": [
        "@dankvr"
      ]
    },
    {
      "name": "shawmakesmagic",
      "type": "user",
      "description": "A user looking for a Python developer to create a Hyperfy agent starter kit with voice capabilities.",
      "aliases": [
        "@shawmakesmagic"
      ]
    },
    {
      "name": "Scooter",
      "type": "user",
      "description": "A user inquiring about agent memory management in ElizaOS, specifically concerning the storage of Discord usernames and the use of components.",
      "aliases": []
    },
    {
      "name": "Hidden Forces",
      "type": "user",
      "description": "A user who provided information about Discord's bot capabilities and shared a Python code example for creating support tickets.",
      "aliases": []
    },
    {
      "name": "Agent Joshua",
      "type": "user",
      "description": "An agent within the ElizaOS ecosystem who suggested importing plugins locally via `workspace:*` as a solution for extending existing plugins.",
      "aliases": []
    },
    {
      "name": "xell0x",
      "type": "user",
      "description": "A user who clarified version differences between Eliza V1, V2, and 1.0.0, explaining that V1 was a proof of concept and V2 is the upcoming main release.",
      "aliases": []
    },
    {
      "name": "osintmao9",
      "type": "user",
      "description": "A user who shared insights on DeFi liquidity strategy, suggesting it's better to strengthen existing pools than create new ones.",
      "aliases": []
    },
    {
      "name": "alexius",
      "type": "user",
      "description": "A user asking questions about the potential COM/AI16Z liquidity pool and the strategy behind pool creation.",
      "aliases": []
    },
    {
      "name": "Spyros",
      "type": "user",
      "description": "A user who provided perspective on the benefits of a 2-tiered LP pool approach for routing through auto.fun.",
      "aliases": []
    },
    {
      "name": "jin",
      "type": "user",
      "description": "A user who suggested creating a new channel for news within the ElizaOS community.",
      "aliases": []
    },
    {
      "name": "starlord",
      "type": "user",
      "description": "A user who provided guidance on importing characters in Eliza v2, referring to the official documentation.",
      "aliases": []
    },
    {
      "name": "0xbisbis",
      "type": "user",
      "description": "A user who explained how to configure the Twitter plugin for automatic tweet generation.",
      "aliases": []
    },
    {
      "name": "Addison Casey",
      "type": "user",
      "description": "An individual who answered questions clarifying the relationship between ElizaOS versions.",
      "aliases": [
        "!Addison Casey!"
      ]
    },
    {
      "name": "elz",
      "type": "token",
      "description": "Unknown - needs research",
      "aliases": []
    },
    {
      "name": "v2",
      "type": "project",
      "description": "The previous internal or common name for the upcoming ElizaOS 1.0.0 release.",
      "aliases": []
    },
    {
      "name": "Eliza v2",
      "type": "project",
      "description": "The prior designation for what is now officially branded as Eliza 1.0.0, representing the main, production-ready release of ElizaOS.",
      "aliases": []
    },
    {
      "name": "Eliza 1.0.0",
      "type": "project",
      "description": "The official designation for the main, production-ready release of ElizaOS, previously known as V2. This release signifies a mature and capable operating system for AI agents.",
      "aliases": []
    },
    {
      "name": "COM/AI16Z pool",
      "type": "project",
      "description": "A proposed liquidity pool involving the COM and AI16Z tokens, subject to community discussion and strategic decisions.",
      "aliases": []
    },
    {
      "name": "COM/SOL pool",
      "type": "project",
      "description": "An existing liquidity pool with $328k liquidity, involving the COM and SOL tokens, considered in discussions about future liquidity strategies.",
      "aliases": []
    },
    {
      "name": "AI16Z",
      "type": "token",
      "description": "A cryptocurrency token associated with ElizaOS, with ongoing discussions about its token utility, governance participation, and its role in liquidity pools.",
      "aliases": []
    },
    {
      "name": "COM",
      "type": "token",
      "description": "A cryptocurrency token involved in liquidity pool strategies and discussions within the ElizaOS ecosystem.",
      "aliases": []
    },
    {
      "name": "SOL",
      "type": "token",
      "description": "A cryptocurrency token whose liquidity is currently pooled with COM, as part of discussions on optimizing liquidity strategies for ElizaOS.",
      "aliases": []
    },
    {
      "name": "7 years of DAOs",
      "type": "project",
      "description": "Unknown - needs research",
      "aliases": []
    },
    {
      "name": "THE COUNCIL",
      "type": "project",
      "description": "A newly introduced AI governance system, characterized by AI agents trained on organizational data and distinct archetypes, referred to as 'Consensus Oracle Units Network'.",
      "aliases": []
    },
    {
      "name": "Consensus Oracle Units Network",
      "type": "project",
      "description": "The system underpinning 'THE COUNCIL', an AI governance framework that utilizes AI agents trained on diverse organizational data.",
      "aliases": []
    },
    {
      "name": "6 years of DAOs",
      "type": "project",
      "description": "Unknown - needs research",
      "aliases": []
    },
    {
      "name": "DAOSdotFUN",
      "type": "project",
      "description": "A platform or entity associated with DAOs, where a project was launched with a focus on 'FUN'.",
      "aliases": [
        "DAOSdotFUN"
      ]
    },
    {
      "name": "Twitter",
      "type": "project",
      "description": "A social media platform known for its microblogging services, used for communication and information sharing.",
      "aliases": []
    },
    {
      "name": "Discord",
      "type": "project",
      "description": "A communication platform widely used by online communities, particularly for voice and text chat, and increasingly integrated with developer tools.",
      "aliases": []
    },
    {
      "name": "Ollama",
      "type": "project",
      "description": "Unknown - needs research",
      "aliases": []
    },
    {
      "name": "Supabase",
      "type": "project",
      "description": "An open-source platform that provides a suite of tools for building backend services, including database, authentication, and storage.",
      "aliases": []
    },
    {
      "name": "ElizaOS",
      "type": "project",
      "description": "An operating system for AI agents, with ongoing development focused on plugin ecosystems, token utility, and market sentiment, particularly preparing for its 1.0.0 release.",
      "aliases": [
        "elizaOS"
      ]
    },
    {
      "name": "Polygon",
      "type": "project",
      "description": "A framework for building and connecting scalable blockchain networks, often used for enhancing the capabilities of existing blockchains like Ethereum.",
      "aliases": []
    },
    {
      "name": "Jupiter Swap",
      "type": "project",
      "description": "A decentralized exchange aggregator that facilitates token swaps across various blockchain networks.",
      "aliases": []
    },
    {
      "name": "COM/AI16Z",
      "type": "token",
      "description": "A proposed liquidity pool for the COM and AI16Z tokens, indicating a strategic focus on token liquidity and trading accessibility.",
      "aliases": []
    },
    {
      "name": "COM/SOL",
      "type": "token",
      "description": "An existing liquidity pool that combines the COM and SOL tokens, serving as a benchmark in discussions about optimal liquidity distribution strategies.",
      "aliases": []
    },
    {
      "name": "AI16Z",
      "type": "token",
      "description": "A cryptocurrency token whose value proposition and utility are subjects of community discussion, particularly concerning governance participation and trading accessibility.",
      "aliases": []
    },
    {
      "name": "COM",
      "type": "token",
      "description": "A cryptocurrency token involved in liquidity pool strategies and discussions, aiming to enhance trading accessibility and token utility within the ElizaOS ecosystem.",
      "aliases": []
    },
    {
      "name": "SOL",
      "type": "token",
      "description": "A cryptocurrency token, currently part of a liquidity pool with COM, that is relevant to discussions on optimizing liquidity strategies within the ElizaOS ecosystem.",
      "aliases": []
    },
    {
      "name": "Eliza V1",
      "type": "project",
      "description": "The initial proof-of-concept version of ElizaOS, which laid the groundwork for subsequent releases.",
      "aliases": []
    },
    {
      "name": "Eliza V2",
      "type": "project",
      "description": "The previous branding for the upcoming main release of ElizaOS, now officially named Eliza 1.0.0. This version represents the full capabilities of the operating system.",
      "aliases": []
    },
    {
      "name": "Eliza 1.0.0",
      "type": "project",
      "description": "The current, main release of ElizaOS, previously referred to as V2. It signifies a mature, production-ready operating system designed for AI agents, featuring enhanced capabilities and features.",
      "aliases": []
    },
    {
      "name": "COM/AI16Z",
      "type": "token",
      "description": "A potential liquidity pool involving the COM and AI16Z tokens, representing a strategic decision point for token liquidity and accessibility.",
      "aliases": []
    },
    {
      "name": "COM/SOL",
      "type": "token",
      "description": "An existing liquidity pool featuring COM and SOL tokens with $328k liquidity, serving as a reference in strategic discussions about liquidity pool management.",
      "aliases": []
    },
    {
      "name": "AI16Z",
      "type": "token",
      "description": "A cryptocurrency token for which users are seeking clearer explanations of utility and roadmap to build confidence, impacting market sentiment and potential price action.",
      "aliases": []
    },
    {
      "name": "COM",
      "type": "token",
      "description": "A cryptocurrency token involved in liquidity pool discussions, particularly concerning the balance between strengthening existing pools and creating new ones.",
      "aliases": []
    },
    {
      "name": "SOL",
      "type": "token",
      "description": "A cryptocurrency token that forms part of an existing liquidity pool with COM, relevant to strategic discussions on maximizing liquidity.",
      "aliases": []
    },
    {
      "name": "ElizaDAO",
      "type": "project",
      "description": "Unknown - needs research",
      "aliases": []
    },
    {
      "name": "spartan shipping with v2",
      "type": "project",
      "description": "Unknown - needs research",
      "aliases": []
    },
    {
      "name": "autofun",
      "type": "project",
      "description": "Unknown - needs research",
      "aliases": []
    },
    {
      "name": "agents trading tokenomics",
      "type": "project",
      "description": "Unknown - needs research",
      "aliases": []
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-29T07:31:40.446125Z"
  }
}