{
  "source": "2025-12-20.json",
  "entities": [
    {
      "name": "AI16Z",
      "type": "token",
      "description": "A legacy token that is no longer the primary utility token of the elizaOS ecosystem. It remains tradable on decentralized exchanges but lacks utility within the current platform. The token has a deadline for migration to elizaOS.",
      "aliases": [
        "AI16Z",
        "ai16z"
      ]
    },
    {
      "name": "elizaOS",
      "type": "project",
      "description": "An operating system or platform, focusing on cloud streaming and onchain capabilities. It functions as the successor to AI16Z, with elizaOS being the designated utility-forward token. The platform aims to provide EVM/onchain capabilities and ecosystem analytics.",
      "aliases": [
        "elizaOS",
        "elizacloud-plugin",
        "eliza-cloud-v2",
        "elizaos"
      ]
    },
    {
      "name": "Twitter/X",
      "type": "project",
      "description": "A social media platform for microblogging and real-time information sharing. It allows users to post and interact with short messages, images, and videos.",
      "aliases": [
        "Twitter/X"
      ]
    },
    {
      "name": "Discord",
      "type": "project",
      "description": "A voice-over-IP and instant messaging social platform designed for communities to interact on voice and text. It is organized into communities called 'servers', and each server can have multiple channels.",
      "aliases": [
        "Discord"
      ]
    },
    {
      "name": "EVM",
      "type": "project",
      "description": "Ethereum Virtual Machine. A runtime environment for smart contracts on the Ethereum blockchain, enabling developers to deploy and execute decentralized applications. It is a core component of many blockchains.",
      "aliases": [
        "EVM"
      ]
    },
    {
      "name": "Spartan",
      "type": "project",
      "description": "Unknown - needs research",
      "aliases": [
        "Spartan"
      ]
    },
    {
      "name": "NPM",
      "type": "project",
      "description": "A package manager for the JavaScript programming language, part of the Node.js ecosystem. It allows developers to discover, share, and use code packages.",
      "aliases": [
        "NPM"
      ]
    },
    {
      "name": "Hyperfy",
      "type": "project",
      "description": "A platform that announced a v0.16.0 release with AI integrations and XR/VR improvements. It focuses on immersive experiences and has been developing AI capabilities.",
      "aliases": [
        "Hyperfy"
      ]
    },
    {
      "name": "Starknet",
      "type": "project",
      "description": "A decentralized scaling solution for Ethereum that allows dApps to achieve hyper-scale for compute, without sacrificing the benefits of Ethereum's security and decentralization. It operates as a Layer 2 network.",
      "aliases": [
        "Starknet"
      ]
    },
    {
      "name": "GitHub",
      "type": "project",
      "description": "A web-based platform for version control using Git. It provides a centralized repository for code, collaboration tools, and project management features for software development.",
      "aliases": [
        "GitHub"
      ]
    },
    {
      "name": "Kraken",
      "type": "project",
      "description": "A cryptocurrency exchange platform that provides a marketplace for buying, selling, and trading digital assets. It is one of the exchanges involved in the token swap process.",
      "aliases": [
        "Kraken"
      ]
    },
    {
      "name": "Bithumb",
      "type": "project",
      "description": "A South Korean cryptocurrency exchange platform. It is involved in the process of handling token swaps and has been a point of concern for the Korean community.",
      "aliases": [
        "Bithumb"
      ]
    },
    {
      "name": "Solana Network",
      "type": "token",
      "description": "A blockchain platform designed for high performance and scalability, utilizing a proof-of-history consensus mechanism. It supports decentralized applications and cryptocurrencies, and is involved in the migration of AI16Z tokens.",
      "aliases": [
        "Solana Network"
      ]
    },
    {
      "name": "ChatGPT",
      "type": "project",
      "description": "An AI chatbot developed by OpenAI, based on the GPT architecture. It is designed to understand and generate human-like text in response to prompts and questions.",
      "aliases": [
        "ChatGPT"
      ]
    },
    {
      "name": "Gemini",
      "type": "project",
      "description": "A large language model developed by Google AI. It is designed to be multimodal and capable of understanding and processing various types of information, including text and code.",
      "aliases": [
        "Gemini"
      ]
    },
    {
      "name": "Grok",
      "type": "project",
      "description": "An AI developed by xAI, designed to answer questions with a bit of the 'sarcastic' and 'rebellious' tone. It aims to provide information with a distinct personality.",
      "aliases": [
        "Grok"
      ]
    },
    {
      "name": "elizaOS token",
      "type": "token",
      "description": "The primary utility token for the elizaOS ecosystem, intended to replace the legacy AI16Z token. It represents the forward-looking utility and value within the platform.",
      "aliases": [
        "elizaOS",
        "elizaos"
      ]
    },
    {
      "name": "Odilitime",
      "type": "user",
      "description": "A contributor within the elizaOS project, actively involved in development discussions, code contributions, and providing technical assistance to other community members. They are a key figure in plugin development.",
      "aliases": [
        "Odilitime"
      ]
    },
    {
      "name": "Stan",
      "type": "user",
      "description": "A developer involved in the elizaOS project, contributing to core development and providing technical guidance, particularly regarding cloud streaming functionality, provider optimizations, and plugin development. He is active in code reviews and documentation.",
      "aliases": [
        "Stan"
      ]
    },
    {
      "name": "FenrirFawks",
      "type": "user",
      "description": "A community member and developer within the elizaOS ecosystem who actively engages with technical challenges, particularly involving Starknet plugin integration and understanding agent action extensions. They seek assistance and collaborate on development issues.",
      "aliases": [
        "FenrirFawks"
      ]
    },
    {
      "name": "roybot",
      "type": "user",
      "description": "A community member who sought assistance with token migration issues, specifically encountering confusion regarding token eligibility. They were directed to the appropriate support channel for resolution.",
      "aliases": [
        "roybot"
      ]
    },
    {
      "name": "Ken",
      "type": "user",
      "description": "A community member providing assistance and clarification on the token migration process, including details about migration deadlines and token supply. They help resolve user queries regarding the project's tokenomics.",
      "aliases": [
        "Kenk"
      ]
    },
    {
      "name": "Serikiki",
      "type": "user",
      "description": "A community member offering guidance and direct advice on token-related questions within the elizaOS community. They provide clear answers on whether to buy specific tokens and clarify token tickers.",
      "aliases": [
        "Serikiki"
      ]
    },
    {
      "name": "Omid Sa",
      "type": "user",
      "description": "A community member and supporter within the elizaOS project who actively assists users with technical issues, such as token migration problems. They also contribute to discussions about project development and future launches.",
      "aliases": [
        "Omid Sa"
      ]
    },
    {
      "name": "jintern",
      "type": "user",
      "description": "An active member of the elizaOS community providing technical support and information, particularly regarding plugin CLI commands and security-related hotlines. They offer assistance on development tools and best practices.",
      "aliases": [
        "jintern"
      ]
    },
    {
      "name": "hildi",
      "type": "user",
      "description": "A community member who provides explanations and support regarding complex processes like exchange token swaps. They help clarify difficulties that arise during such financial operations.",
      "aliases": [
        "hildi"
      ]
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-29T08:08:51.278278Z"
  }
}