{
  "source": "2025-06-25.json",
  "entities": [
    {
      "name": "ElizaOS",
      "type": "project",
      "description": "An open-source operating system for AI.\nIt focuses on providing a platform for users to run and develop AI agents.",
      "aliases": [
        "elizaOS"
      ]
    },
    {
      "name": "$degenai",
      "type": "token",
      "description": "A cryptocurrency token associated with the ElizaOS ecosystem.\nIt has been subject to sales from the DAO treasury to fund liquidity pools.",
      "aliases": []
    },
    {
      "name": "DAO",
      "type": "project",
      "description": "Decentralized Autonomous Organization. A blockchain-based organization run by smart contracts and community governance.",
      "aliases": []
    },
    {
      "name": "daos.fun",
      "type": "project",
      "description": "A platform or service related to DAO operations and Automated Market Maker (AMM) liquidity pools.\nIt is mentioned in the context of replenishing liquidity for $degenai tokens.",
      "aliases": []
    },
    {
      "name": "Bun",
      "type": "project",
      "description": "Fast JavaScript runtime, bundler, and package manager. Logo is a white bun/dumpling on black.",
      "aliases": []
    },
    {
      "name": "X",
      "type": "project",
      "description": "A social media platform, formerly known as Twitter.\nIt is used for project announcements and community engagement.",
      "aliases": [
        "Twitter"
      ]
    },
    {
      "name": "ELI5",
      "type": "token",
      "description": "Unknown - needs research",
      "aliases": []
    },
    {
      "name": "EDDY",
      "type": "token",
      "description": "Unknown - needs research",
      "aliases": []
    },
    {
      "name": "Dot",
      "type": "token",
      "description": "Unknown - needs research",
      "aliases": []
    },
    {
      "name": "COM",
      "type": "token",
      "description": "Unknown - needs research",
      "aliases": []
    },
    {
      "name": "TAPS",
      "type": "token",
      "description": "Unknown - needs research",
      "aliases": []
    },
    {
      "name": "CULTVESTING",
      "type": "user",
      "description": "An individual or entity involved in cryptocurrency discussions, who warned about a potential market dip.",
      "aliases": []
    },
    {
      "name": "Gemma3:12b",
      "type": "project",
      "description": "A specific language model notable for its performance with limited VRAM. It is recommended for use with ElizaOS on resource-constrained hardware.",
      "aliases": []
    },
    {
      "name": "辞尘鸽鸽",
      "type": "user",
      "description": "A community member who shared on-chain evidence of $degenai token sales from the DAO treasury.",
      "aliases": []
    },
    {
      "name": "Kenk",
      "type": "user",
      "description": "A community member providing clarifications on wallet addresses and project status, including the X account suspension.",
      "aliases": []
    },
    {
      "name": "Dr. Neuro",
      "type": "user",
      "description": "A member of the ElizaOS community who commented on the release status of V2.",
      "aliases": []
    },
    {
      "name": "Void",
      "type": "user",
      "description": "A community member who provided an update on the Spartan prototype's completion status.",
      "aliases": []
    },
    {
      "name": "Shaw",
      "type": "user",
      "description": "A key figure involved in ElizaOS development, confirmed to be active on GitHub and in dev channels, and created a camera plugin.",
      "aliases": []
    },
    {
      "name": "Farcaster",
      "type": "project",
      "description": "A decentralized social network protocol that allows users to host and control their own social media data.",
      "aliases": []
    },
    {
      "name": "0xbbjoker",
      "type": "user",
      "description": "A developer who released a fix for issues related to the knowledge plugin, specifically file path loading and UI uploads.",
      "aliases": []
    },
    {
      "name": "jin",
      "type": "user",
      "description": "A user who encountered Docker container configuration problems and suggested a specific fix using bun.",
      "aliases": []
    },
    {
      "name": "Johannes Weniger",
      "type": "user",
      "description": "A user who experienced formatting issues in agent responses and received recommendations on using markdown.",
      "aliases": []
    },
    {
      "name": "DorianD",
      "type": "user",
      "description": "A community member who asked about using OpenAI versus local models and reported successful CLI testing.",
      "aliases": []
    },
    {
      "name": "Odilitime",
      "type": "user",
      "description": "A community member who provided insights on resource requirements for models, plugin compatibility, and the X account suspension.",
      "aliases": []
    },
    {
      "name": "GitHub",
      "type": "project",
      "description": "A web-based platform for version control and collaboration using Git. It is used for hosting and managing the ElizaOS codebase.",
      "aliases": []
    },
    {
      "name": "Discord",
      "type": "project",
      "description": "A voice over IP and instant messaging social platform designed for communication for video gaming communities and businesses. It is used as a primary communication channel for ElizaOS.",
      "aliases": []
    },
    {
      "name": "jasyn_bjorn",
      "type": "user",
      "description": "A team member who explained the rationale behind token sales for $degenai and confirmed replenishment.",
      "aliases": []
    },
    {
      "name": "KENK",
      "type": "user",
      "description": "A community member who provided updates on the X account suspension and the project's plans for visibility.",
      "aliases": []
    },
    {
      "name": "兔兔大富",
      "type": "user",
      "description": "A community member who questioned the sale of $degenai tokens from the DAO wallet.",
      "aliases": []
    },
    {
      "name": "CJFT",
      "type": "user",
      "description": "A community member who provided a technical solution for getting the test agent to use OpenAI instead of local models.",
      "aliases": []
    },
    {
      "name": "Furkan Nabi Sumji",
      "type": "user",
      "description": "A community member who asked about receiving WebSocket responses.",
      "aliases": []
    },
    {
      "name": "Sayonara",
      "type": "user",
      "description": "A community member who provided guidance on checking implementation examples for WebSocket responses.",
      "aliases": []
    },
    {
      "name": "Bealers",
      "type": "user",
      "description": "A community member experiencing issues with CLI versioning and seeking a solution.",
      "aliases": []
    },
    {
      "name": "s",
      "type": "user",
      "description": "A community member who provided instructions on how to resolve CLI version conflicts by uninstalling and reinstalling with bun.",
      "aliases": []
    },
    {
      "name": "vincent789.",
      "type": "user",
      "description": "A community member who inquired about the status of the project's X (Twitter) account.",
      "aliases": []
    },
    {
      "name": "OpenAI",
      "type": "project",
      "description": "An artificial intelligence research laboratory and company that develops and deploys AI models, including large language models, that can be integrated with other platforms.",
      "aliases": []
    },
    {
      "name": "harperaa",
      "type": "user",
      "description": "A user who reported a bug titled 'Knowledge management (RAG) not working (implemented) in 1.0.6' on GitHub.",
      "aliases": []
    },
    {
      "name": "claude",
      "type": "user",
      "description": "An individual who provided a summary of missing implementations in the ElizaOS codebase related to knowledge processing.",
      "aliases": []
    },
    {
      "name": "MDMnvest",
      "type": "user",
      "description": "A community member who expressed interest in the launch date of the 'Dot' cryptocurrency token.",
      "aliases": []
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-29T07:37:53.320962Z"
  }
}