{
  "source": "2025-12-04.json",
  "entities": [
    {
      "name": "ai16z",
      "type": "token",
      "description": "Unknown - needs research",
      "aliases": [
        "AI16Z"
      ]
    },
    {
      "name": "elizaOS",
      "type": "project",
      "description": "A decentralized operating system project focused on AI and social media integration. Potentially a platform for running agents and dApps.",
      "aliases": [
        "elizaOS/eliza"
      ]
    },
    {
      "name": "Bithumb",
      "type": "project",
      "description": "A South Korean cryptocurrency exchange platform.",
      "aliases": []
    },
    {
      "name": "Kraken",
      "type": "project",
      "description": "A major cryptocurrency exchange platform known for its security and wide range of trading pairs.",
      "aliases": []
    },
    {
      "name": "Twitter",
      "type": "project",
      "description": "A social media platform for microblogging and real-time information sharing.",
      "aliases": [
        "X"
      ]
    },
    {
      "name": "Zama",
      "type": "project",
      "description": "A company focused on privacy-preserving machine learning, likely developing tools or infrastructure for AI.",
      "aliases": []
    },
    {
      "name": "Dune",
      "type": "project",
      "description": "A blockchain analytics platform that allows users to create and share dashboards for on-chain data visualization.",
      "aliases": []
    },
    {
      "name": "Babylon",
      "type": "project",
      "description": "A project focused on growth and user acquisition, utilizing an airdrop point system as an incentive.",
      "aliases": []
    },
    {
      "name": "Stan",
      "type": "user",
      "description": "A developer implementing a 'plugin-waitlist' concept and submitting PRs to the elizaOS/eliza repository.",
      "aliases": []
    },
    {
      "name": "Odilitime",
      "type": "user",
      "description": "A community member whose concept for a 'plugin-waitlist' is being implemented by Stan. Also confirmed migration procedures.",
      "aliases": []
    },
    {
      "name": "Loaf",
      "type": "user",
      "description": "A former team member of elizaOS who has created a new project called 'daydreams.systems'.",
      "aliases": []
    },
    {
      "name": "Galego",
      "type": "user",
      "description": "A former team member of elizaOS who previously created unused v2 designs and has launched a new project called 'daydreams.systems'.",
      "aliases": []
    },
    {
      "name": "daydreams.systems",
      "type": "project",
      "description": "A new project launched by former elizaOS team members Loaf and Galego.",
      "aliases": []
    },
    {
      "name": "Anthropic",
      "type": "project",
      "description": "A major AI company that is potentially preparing for an IPO, indicating growing mainstream investment interest in the AI sector.",
      "aliases": []
    },
    {
      "name": "77qVj3adpxbKjLuD9FoeFvDxHuAsro1cjvLVjuPQcEZ5",
      "type": "project",
      "description": "A specific wallet address mentioned for manual token migration during the ai16z to elizaOS process.",
      "aliases": []
    },
    {
      "name": "Jeffro",
      "type": "user",
      "description": "A user concerned about sending tokens to a specific address for manual migration.",
      "aliases": []
    },
    {
      "name": "lulu",
      "type": "user",
      "description": "A user asking about migrating ai16z tokens when the migration web interface indicates they are not eligible.",
      "aliases": []
    },
    {
      "name": "거북알",
      "type": "user",
      "description": "A user asking how to migrate tokens from Bithumb and how to prove they were part of the 11.11 snapshot.",
      "aliases": []
    },
    {
      "name": "Kenk",
      "type": "user",
      "description": "A community member providing information on migrating tokens from Bithumb and on message API channel IDs.",
      "aliases": []
    },
    {
      "name": "boja",
      "type": "user",
      "description": "A user asking for the channel ID for the message API.",
      "aliases": []
    },
    {
      "name": "mgeissa",
      "type": "user",
      "description": "A user who recently purchased ai16z and is unsure if they can still convert to ElizaOS.",
      "aliases": []
    },
    {
      "name": "Omid Sa",
      "type": "user",
      "description": "A community member who clarified official support channels for migration and warned about scam attempts.",
      "aliases": []
    },
    {
      "name": "CosmicCoyote",
      "type": "user",
      "description": "A contributor advising on frontend development best practices for dApps, specifically regarding wallet session verification.",
      "aliases": []
    },
    {
      "name": "Jasyn_bjorn",
      "type": "user",
      "description": "A community member who directed users with migration problems to the appropriate support channels.",
      "aliases": []
    },
    {
      "name": "Sayonara",
      "type": "user",
      "description": "A community member who confirmed that Deepseek can be used as a provider through the openrouter plugin.",
      "aliases": []
    },
    {
      "name": "0xbbjoker",
      "type": "user",
      "description": "A developer discussing the implementation of Claude-like skills in plugin memories and table migrations for cloud.",
      "aliases": []
    },
    {
      "name": "Borko",
      "type": "user",
      "description": "A team member confirming that the project timeline is still on track.",
      "aliases": []
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-29T08:07:00.195991Z"
  }
}