{
  "source": "2025-05-29.json",
  "entities": [
    {
      "name": "ElizaOS",
      "type": "project",
      "description": "An operating system designed for AI agents, focusing on intelligence, memory systems, and user interface improvements. It aims to enable autonomous AI accounts and collaborative agent networks.",
      "aliases": [
        "ElizaOS v2",
        "1.0.0",
        "Eliza 1.0.0"
      ]
    },
    {
      "name": "@theinterndotfun",
      "type": "user",
      "description": "Unknown - needs research",
      "aliases": []
    },
    {
      "name": "@iEx_ec",
      "type": "user",
      "description": "Unknown - needs research",
      "aliases": []
    },
    {
      "name": "@comput3ai",
      "type": "user",
      "description": "Unknown - needs research",
      "aliases": []
    },
    {
      "name": "AI16Z",
      "type": "token",
      "description": "An AI-related token associated with the ElizaOS ecosystem. Its utility is discussed in the context of project development and potential demand drivers.",
      "aliases": [
        "$Ai16z"
      ]
    },
    {
      "name": "Raydium",
      "type": "project",
      "description": "A decentralized exchange (DEX) and automated market maker (AMM) built on the Solana blockchain. It facilitates token swaps and liquidity provision, often used for launching new tokens.",
      "aliases": []
    },
    {
      "name": "@ElizaEcoFund",
      "type": "user",
      "description": "Unknown - needs research",
      "aliases": []
    },
    {
      "name": "@shawmakesmagic",
      "type": "user",
      "description": "Unknown - needs research",
      "aliases": [
        "Shaw"
      ]
    },
    {
      "name": "Kenk",
      "type": "user",
      "description": "A prominent individual involved in the technical development and discussion surrounding ElizaOS, providing insights into its architecture and future releases.",
      "aliases": []
    },
    {
      "name": "abhi_ironman",
      "type": "user",
      "description": "A community member who provides critical feedback on ElizaOS, focusing on project momentum, token performance, and strategic direction.",
      "aliases": []
    },
    {
      "name": "bitcryptowski_btc",
      "type": "user",
      "description": "Unknown - needs research",
      "aliases": []
    },
    {
      "name": "OpenRouter",
      "type": "project",
      "description": "A service that provides a unified API for accessing LLM providers with features like reasoning summary streaming and end-user ID submission. It also supports crypto invoices.",
      "aliases": []
    },
    {
      "name": "ELI5",
      "type": "token",
      "description": "A token within the ElizaOS ecosystem that is being integrated as a 'CTO' agent in the upcoming terminal interface. Its price recovery is anticipated with the v2 launch.",
      "aliases": []
    },
    {
      "name": "EDDY",
      "type": "token",
      "description": "A token within the ElizaOS ecosystem integrated as a 'CTO' agent alongside ELI5 in the terminal. Optimism exists regarding its price recovery post-v2 launch.",
      "aliases": []
    },
    {
      "name": "Jin",
      "type": "user",
      "description": "Unknown - needs research",
      "aliases": []
    },
    {
      "name": "Aiquant.fun",
      "type": "project",
      "description": "An investment opportunity within the ElizaOS ecosystem, attracting participation from notable investors.",
      "aliases": []
    },
    {
      "name": "Spartan",
      "type": "user",
      "description": "A character name associated with the creation of animated content, for whom ARKit expressions were added.",
      "aliases": []
    },
    {
      "name": "elizaos.ai",
      "type": "project",
      "description": "The official website associated with ElizaOS, serving as a platform for new users and potentially housing the agent terminal.",
      "aliases": []
    },
    {
      "name": "flyio",
      "type": "project",
      "description": "Unknown - needs research",
      "aliases": []
    },
    {
      "name": "plugin-mcp",
      "type": "project",
      "description": "A component or module within the ElizaOS ecosystem related to plugin management, undergoing migration processes.",
      "aliases": []
    },
    {
      "name": "Comput3",
      "type": "project",
      "description": "A competitor project within the AI token ecosystem, whose token performance is contrasted with that of ELI5.",
      "aliases": [
        "Comput3"
      ]
    },
    {
      "name": "Auto.fun",
      "type": "project",
      "description": "A platform or project within the ElizaOS ecosystem that facilitates token launches and discussions about investment merits, known for its fee structure.",
      "aliases": [
        "auto.fun"
      ]
    },
    {
      "name": "PayAI",
      "type": "project",
      "description": "A project within the ElizaOS ecosystem that hosts ecosystem events.",
      "aliases": []
    },
    {
      "name": "farm2",
      "type": "token",
      "description": "A token mentioned in community discussions regarding investment merits within the ElizaOS ecosystem, compared against ELI5.",
      "aliases": []
    },
    {
      "name": "Virtual",
      "type": "project",
      "description": "An AI agent framework mentioned as a competitor, similar to how ElizaOS v2 is positioned for the Solana blockchain.",
      "aliases": []
    },
    {
      "name": "eliza.gg",
      "type": "project",
      "description": "A website related to ElizaOS, which is temporarily down for redevelopment in preparation for the v2 release.",
      "aliases": []
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-29T07:32:54.993862Z"
  }
}