{
  "source": "2025-06-23.json",
  "entities": [
    {
      "name": "ElizaOS",
      "type": "project",
      "description": "An open-source AI agent framework focused on composability, modularity, and flexibility. The project aims to empower agents with diverse tools and intelligence sources, integrating with various Web2 and Web3 ecosystems.",
      "aliases": [
        "ElizaOS"
      ]
    },
    {
      "name": "Eliza v2",
      "type": "project",
      "description": "The second version of the ElizaOS framework, featuring enhanced capabilities such as an autocoder for complex agent creation and significant improvements in development speed. It represents a major leap in the platform's agent development capabilities.",
      "aliases": [
        "Eliza v2",
        "v2"
      ]
    },
    {
      "name": "Twitter",
      "type": "project",
      "description": "A social media platform known for its microblogging service. Its API access and pricing have become a point of contention for AI agent developers.",
      "aliases": [
        "Twitter",
        "X"
      ]
    },
    {
      "name": "Ollama",
      "type": "project",
      "description": "An open-source platform that makes it easy to run large language models, locally. It is one of the AI provider options integrated into the ElizaOS ecosystem.",
      "aliases": [
        "Ollama"
      ]
    },
    {
      "name": "Google Generative AI",
      "type": "project",
      "description": "A suite of AI models offered by Google, designed for a wide range of generative tasks. Gemini is a prominent model within this suite, integrated into ElizaOS.",
      "aliases": [
        "Google Generative AI",
        "Gemini"
      ]
    },
    {
      "name": "OpenAI",
      "type": "project",
      "description": "A research organization focused on artificial intelligence, known for developing advanced AI models such as GPT. OpenAI is one of the supported AI providers in the ElizaOS ecosystem.",
      "aliases": [
        "OpenAI"
      ]
    },
    {
      "name": "Anthropic",
      "type": "project",
      "description": "An AI safety and research company that develops AI systems. Anthropic is listed as one of the AI provider options within the ElizaOS ecosystem.",
      "aliases": [
        "Anthropic"
      ]
    },
    {
      "name": "Farcaster",
      "type": "project",
      "description": "A decentralized social network protocol designed to be open and extensible. ElizaOS is considering building a presence on Farcaster as an alternative to Twitter.",
      "aliases": [
        "Farcaster"
      ]
    },
    {
      "name": "Unitree G1",
      "type": "project",
      "description": "A specific model of a general-purpose humanoid robot designed for various applications. ElizaOS is being explored for potential use in programming and training robots like the Unitree G1.",
      "aliases": [
        "Unitree G1"
      ]
    },
    {
      "name": "WhatsApp",
      "type": "project",
      "description": "A popular messaging application that allows users to send text and voice messages, make voice and video calls, and share images, documents, user locations, and other media. ElizaOS is exploring integration possibilities for AI agents on WhatsApp.",
      "aliases": [
        "WhatsApp"
      ]
    },
    {
      "name": "GitHub",
      "type": "project",
      "description": "A web-based platform for version control and collaboration, primarily used for software development. It hosts repositories for various projects, including those related to ElizaOS.",
      "aliases": [
        "GitHub"
      ]
    },
    {
      "name": "Discord",
      "type": "project",
      "description": "A voice-over-IP (VoIP) application and digital distribution platform designed for communication communities, such as gamers. It serves as a primary community hub for ElizaOS discussions.",
      "aliases": [
        "Discord"
      ]
    },
    {
      "name": "AutoFun",
      "type": "project",
      "description": "A source code or toolset used in the context of creating tokens or smart contracts, mentioned in relation to users experiencing errors during token creation with live contracts.",
      "aliases": [
        "AutoFun"
      ]
    },
    {
      "name": "Pyth",
      "type": "project",
      "description": "A decentralized oracle network that provides real-time market data to smart contracts. It is listed as a plugin available for ElizaOS agents to access market data.",
      "aliases": [
        "pyth"
      ]
    },
    {
      "name": "CoinMarketCap",
      "type": "project",
      "description": "A website that lists and tracks the prices, market capitalization, and other data for cryptocurrencies. It is available as a plugin for ElizaOS agents to access market data.",
      "aliases": [
        "CoinMarketCap",
        "coinmarketcap"
      ]
    },
    {
      "name": "CoinGecko",
      "type": "project",
      "description": "A cryptocurrency data aggregation website that provides market data, including prices, volume, and historical data, for thousands of coins. It is available as a plugin for ElizaOS agents.",
      "aliases": [
        "CoinGecko",
        "coingecko"
      ]
    },
    {
      "name": "Shaw",
      "type": "user",
      "description": "A key individual within the ElizaOS community, likely a core contributor or leader. Shaw provides updates on project development, such as the completion of Eliza v2 and account status.",
      "aliases": [
        "Shaw"
      ]
    },
    {
      "name": "DegenAI",
      "type": "token",
      "description": "A cryptocurrency token mentioned in the context of a controversial transaction where it was sold for AI16z tokens. Its market activity is noted as potentially affecting investment in ElizaOS-related projects.",
      "aliases": [
        "DegenAI"
      ]
    },
    {
      "name": "AI16z",
      "type": "token",
      "description": "A cryptocurrency token involved in a transaction where DegenAI tokens were sold for it. This transaction caused controversy within the community.",
      "aliases": [
        "AI16z"
      ]
    },
    {
      "name": "Jupiter DAO",
      "type": "project",
      "description": "A decentralized autonomous organization associated with token allocation proposals and voting mechanisms. Controversies within Jupiter DAO regarding governance and community trust are discussed as insights for ElizaOS.",
      "aliases": [
        "Jupiter DAO",
        "Jup DAO"
      ]
    },
    {
      "name": "Bitcoin",
      "type": "token",
      "description": "The original and most well-known cryptocurrency, based on a proof-of-work consensus mechanism driven by mining. It is mentioned as a comparison point for governance models.",
      "aliases": [
        "Bitcoin"
      ]
    },
    {
      "name": "Odalitime",
      "type": "user",
      "description": "A community member who provided information and assistance within the ElizaOS community, including explanations regarding X account restoration and the status of the agent-twitter-client repository.",
      "aliases": [
        "Odilitime"
      ]
    },
    {
      "name": "Kenk",
      "type": "user",
      "description": "A community member involved in providing guidance and information within the ElizaOS ecosystem. Kenk directed users to documentation and plugins for building agents, and shared information about AI art projects.",
      "aliases": [
        "Kenk"
      ]
    },
    {
      "name": "DorianD",
      "type": "user",
      "description": "A community member who proposed a system for Eliza Nodes to scrape and store X data, and assisted with WhatsApp integration queries. DorianD also mentioned the existence of an older WhatsApp plugin.",
      "aliases": [
        "DorianD"
      ]
    },
    {
      "name": "AWS Bedrock",
      "type": "project",
      "description": "A managed service from Amazon Web Services that provides access to pre-trained AI models for building and scaling AI applications. Supporting AWS Bedrock through dedicated plugins is a strategic move for ElizaOS.",
      "aliases": [
        "AWS Bedrock"
      ]
    },
    {
      "name": "Book of Truth",
      "type": "project",
      "description": "A project mentioned as having worked on AI live arts that can be used for NFTs. It is cited as an example in discussions about AI-generated art for NFTs.",
      "aliases": [
        "Book of Truth"
      ]
    },
    {
      "name": "ElizaBAO",
      "type": "user",
      "description": "A community member who reported experiencing errors when trying to create tokens using AutoFun source code with live contracts. Odilitime provided assistance with this issue.",
      "aliases": [
        "ElizaBAO"
      ]
    },
    {
      "name": "ConsenSys",
      "type": "project",
      "description": "Unknown - needs research",
      "aliases": [
        "ConsenSys"
      ]
    },
    {
      "name": "Ethereum",
      "type": "token",
      "description": "A decentralized, open-source blockchain system with smart contract functionality. Ethereum is a foundational blockchain for many dApps and tokens.",
      "aliases": [
        "Ethereum"
      ]
    },
    {
      "name": "Infura",
      "type": "project",
      "description": "Unknown - needs research",
      "aliases": [
        "Infura"
      ]
    },
    {
      "name": "OpenSea",
      "type": "project",
      "description": "A peer-to-peer marketplace for buying, selling, and discovering unique digital items, including NFTs. OpenSea is a prominent platform in the NFT space.",
      "aliases": [
        "OpenSea"
      ]
    },
    {
      "name": "AI16z",
      "type": "project",
      "description": "Unknown - needs research",
      "aliases": [
        "AI16z"
      ]
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-29T07:37:37.859146Z"
  }
}