{
  "source": "2025-10-18.json",
  "entities": [
    {
      "name": "ElizaOS",
      "type": "project",
      "description": "A decentralized AI project focused on building prediction markets, autonomous agents, and a credibly neutral alternative to corporate AI platforms. It aims to leverage blockchain technology for agent coordination, reputation systems, and economic incentives. The project is migrating to cloud infrastructure and implementing an '8004' protocol as a decentralized app discovery layer.",
      "aliases": [
        "elizaOS"
      ]
    },
    {
      "name": "AI16Z",
      "type": "token",
      "description": "Unknown - needs research",
      "aliases": [
        "ai16z",
        "$ai16z",
        "AI16Z"
      ]
    },
    {
      "name": "ElizaOS Token",
      "type": "token",
      "description": "The native token of the ElizaOS project, used for functions within its decentralized AI ecosystem. It is undergoing a migration from AI16Z and will function as a gas token on its planned L2/L3 network.",
      "aliases": [
        "$elizaOS",
        "$elizaOS",
        "elizaOS"
      ]
    },
    {
      "name": "8004 protocol",
      "type": "project",
      "description": "A decentralized app discovery layer being implemented by ElizaOS. It serves as a decentralized app discovery and interaction layer within the ElizaOS ecosystem.",
      "aliases": [
        "'8004' protocol",
        "ERC-8004"
      ]
    },
    {
      "name": "Twitter/X plugin",
      "type": "project",
      "description": "A plugin for ElizaOS that integrates with the Twitter/X platform. It requires a Basic subscription to the X API for full functionality.",
      "aliases": [
        "Twitter/X plugin",
        "twitter-plugin",
        "Twitter plugin"
      ]
    },
    {
      "name": "X API",
      "type": "project",
      "description": "The application programming interface for the X (formerly Twitter) platform, which allows developers to access and interact with X's features and data.",
      "aliases": [
        "X API"
      ]
    },
    {
      "name": "prediction market",
      "type": "project",
      "description": "A market where participants trade contracts whose payoff depends on the outcome of future events. ElizaOS is developing a prediction market system involving AI agents and potentially human betting.",
      "aliases": [
        "prediction markets"
      ]
    },
    {
      "name": "autonomous agents",
      "type": "project",
      "description": "Software entities that can perceive their environment, make decisions, and take actions to achieve goals autonomously. ElizaOS is building a project involving autonomous agents.",
      "aliases": [
        "autonomous agents",
        "AI agents"
      ]
    },
    {
      "name": "LLM",
      "type": "project",
      "description": "Large Language Model, a type of artificial intelligence model trained on vast amounts of text data to understand and generate human-like language. LLMs are used in ElizaOS for generating bets and outcomes in its prediction market system.",
      "aliases": [
        "LLM"
      ]
    },
    {
      "name": "cloud migration",
      "type": "project",
      "description": "The process of moving digital assets, services, and applications from on-premises infrastructure to cloud-based platforms. ElizaOS is undergoing a cloud migration to enhance its technical infrastructure.",
      "aliases": [
        "cloud migration"
      ]
    },
    {
      "name": "bunified plugins",
      "type": "project",
      "description": "Plugins for ElizaOS that are built using the 'bun' JavaScript runtime and bundler, aiming for improved performance and integration within the ElizaOS ecosystem. Examples include plugin-solana and plugin-OpenAI.",
      "aliases": [
        "'bunified' plugins",
        "bunified plugins"
      ]
    },
    {
      "name": "bun",
      "type": "project",
      "description": "A fast JavaScript runtime, bundler, and package manager. It is used in ElizaOS for building 'bunified' plugins.",
      "aliases": [
        "bun"
      ]
    },
    {
      "name": "plugin-solana",
      "type": "project",
      "description": "A 'bunified' plugin for ElizaOS that provides integration with the Solana blockchain.",
      "aliases": [
        "plugin-solana"
      ]
    },
    {
      "name": "plugin-OpenAI",
      "type": "project",
      "description": "A 'bunified' plugin for ElizaOS that integrates with OpenAI's services.",
      "aliases": [
        "plugin-OpenAI"
      ]
    },
    {
      "name": "SPL Contract",
      "type": "project",
      "description": "A type of smart contract used on the Solana blockchain, often associated with the SPL Token standard. The AI16Z token is an SPL Contract.",
      "aliases": []
    },
    {
      "name": "SVM",
      "type": "project",
      "description": "Solana Virtual Machine, the execution environment for smart contracts on the Solana blockchain. The ElizaOS token will be SVM-native.",
      "aliases": [
        "SVM"
      ]
    },
    {
      "name": "EVM-native",
      "type": "project",
      "description": "Refers to smart contracts or tokens that are natively compatible with or run on the Ethereum Virtual Machine, enabling interoperability with Ethereum and EVM-compatible blockchains.",
      "aliases": [
        "EVM-native"
      ]
    },
    {
      "name": "CCIP",
      "type": "project",
      "description": "Cross-Chain Interoperability Protocol, a technology that enables secure communication and token transfers between different blockchain networks. It is being used for the ElizaOS token's multichain approach.",
      "aliases": [
        "CCIP"
      ]
    },
    {
      "name": "Base",
      "type": "token",
      "description": "A secure, scalable, low-cost blockchain built to enable the deployment of dollar-denominated assets and the creation of new cryptocurrency projects. It is one of the blockchains where the ElizaOS token will be available.",
      "aliases": []
    },
    {
      "name": "Chainlink",
      "type": "project",
      "description": "A decentralized oracle network that provides real-world data to smart contracts on the blockchain. Chainlink's technology is being used to make the ElizaOS token multichain.",
      "aliases": []
    },
    {
      "name": "SAFT",
      "type": "project",
      "description": "Simple Agreement for Future Tokens, a type of investment contract used in early-stage cryptocurrency projects to raise funds by selling future tokens. It represents a funding round for ElizaOS.",
      "aliases": []
    },
    {
      "name": "L2/L3 rollup network",
      "type": "project",
      "description": "An Ethereum scaling solution that bundles multiple transactions off-chain and submits a single proof to the main chain (L1), with L3s further building on top of L2s for enhanced scalability. ElizaOS plans to implement an L2/L3 rollup network where its token will function as a gas token.",
      "aliases": [
        "L2/L3 rollup network"
      ]
    },
    {
      "name": "ERC-4337",
      "type": "project",
      "description": "A standard that enables account abstraction on Ethereum, allowing for more flexible and user-friendly wallet management, including features like gas payment handling by paymasters. ElizaOS plans to implement an ERC-4337 paymaster system.",
      "aliases": [
        "ERC-4337"
      ]
    },
    {
      "name": "Trusted Execution Environments",
      "type": "project",
      "description": "Secure areas within a processor that are isolated from the rest of the system, designed to protect sensitive data and code execution. ElizaOS will use TEEs for its 'games as oracles' concept.",
      "aliases": [
        "Trusted Execution Environments",
        "TEEs"
      ]
    },
    {
      "name": "Phantom wallet",
      "type": "project",
      "description": "A popular cryptocurrency wallet primarily for the Solana ecosystem, used for storing and managing digital assets. Users are advised to use Phantom wallet for the ElizaOS token migration.",
      "aliases": [
        "Phantom wallet"
      ]
    },
    {
      "name": "OpenRouter",
      "type": "project",
      "description": "A service that provides a unified API for accessing multiple large language models. They announced the launch of their Responses API Beta.",
      "aliases": [
        "OpenRouter"
      ]
    },
    {
      "name": "AI Elements",
      "type": "project",
      "description": "Unknown - needs research",
      "aliases": [
        "AI Elements"
      ]
    },
    {
      "name": "Privy",
      "type": "project",
      "description": "A service that provides authentication solutions for decentralized applications, helping users connect and manage their identities. ElizaOS is using Privy for its authentication approach.",
      "aliases": [
        "Privy"
      ]
    },
    {
      "name": "Shaw",
      "type": "user",
      "description": "An individual involved in the ElizaOS project, who outlined plans for the L2/L3 rollup network and discussed network validator structures.",
      "aliases": []
    },
    {
      "name": "DannyNOR NoFapArc",
      "type": "user",
      "description": "A community member who confirmed that migrated ElizaOS tokens are immediately unlocked upon blockchain settlement.",
      "aliases": []
    },
    {
      "name": "Odilitime",
      "type": "user",
      "description": "A community member who confirmed that migrated ElizaOS tokens are immediately unlocked after chain settlement.",
      "aliases": []
    },
    {
      "name": "Kenk",
      "type": "user",
      "description": "A member of the ElizaOS team who stated that communications about trading venues for $elizaOS will be provided post-launch.",
      "aliases": []
    },
    {
      "name": "cjft",
      "type": "user",
      "description": "An individual who provided technical details about the ElizaOS Twitter/X plugin, its API requirements, and the status of 'bunified' plugins.",
      "aliases": []
    },
    {
      "name": "Rocky",
      "type": "user",
      "description": "An individual who provided Docker run commands and recommendations for volume mounts for ElizaOS packages and configurations.",
      "aliases": []
    },
    {
      "name": "Zola",
      "type": "project",
      "description": "Unknown - needs research",
      "aliases": []
    },
    {
      "name": "Sparka",
      "type": "project",
      "description": "Unknown - needs research",
      "aliases": []
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-29T08:00:21.100452Z"
  }
}