{
  "source": "2025-10-21.json",
  "entities": [
    {
      "name": "ElizaOS",
      "type": "project",
      "description": "ElizaOS is a project preparing for a significant token migration. It is involved in technical development with feature additions and bug fixes. The project has a token migration underway from $AI16Z to $ElizaOS with a 1:6 conversion ratio.",
      "aliases": [
        "elizaOS"
      ]
    },
    {
      "name": "$AI16Z",
      "type": "token",
      "description": "A cryptocurrency token involved in a migration process to the $ElizaOS token.",
      "aliases": [
        "$AI16Z"
      ]
    },
    {
      "name": "$ElizaOS",
      "type": "token",
      "description": "A cryptocurrency token that is the target of a migration from the $AI16Z token. It has a 1:6 conversion ratio in the migration.",
      "aliases": [
        "$ElizaOS",
        "$eliza",
        "elizaOS"
      ]
    },
    {
      "name": "Binance",
      "type": "project",
      "description": "A cryptocurrency exchange platform that has had its CEO mentioned in relation to the ElizaOS project. It is also mentioned in the context of potentially supporting the new $ElizaOS token.",
      "aliases": []
    },
    {
      "name": "CZ",
      "type": "user",
      "description": "The CEO of Binance, who made a post related to ElizaOS. Mentioned in discussions within the ElizaOS community.",
      "aliases": []
    },
    {
      "name": "Discord",
      "type": "project",
      "description": "A communication platform used by the ElizaOS community for discussions and sharing information. It features various channels for different topics such as discussions, technical development, and partnerships.",
      "aliases": []
    },
    {
      "name": "Phantom",
      "type": "project",
      "description": "A cryptocurrency wallet recommended for users to migrate tokens to, specifically for self-custody after transferring from CEXs. It is described as a good wallet to hold $AI16Z before migrating to $ElizaOS.",
      "aliases": []
    },
    {
      "name": "Metamask",
      "type": "project",
      "description": "A cryptocurrency wallet recommended for users to migrate tokens to, specifically for self-custody after transferring from CEXs. It is mentioned as a suitable wallet for holding $AI16Z before migrating to $ElizaOS.",
      "aliases": []
    },
    {
      "name": "Streamdown",
      "type": "project",
      "description": "A technology or feature being integrated into the ElizaOS ecosystem, focusing on enhancing the UI experience for AI responses with modern rendering capabilities.",
      "aliases": []
    },
    {
      "name": "MCP",
      "type": "project",
      "description": "Stands for Model Control Protocol. It is an architecture discussed within the ElizaOS project, distinguishing between clients (such as claude code, cursor, codex) and servers (eliza mcp).",
      "aliases": [
        "Model Control Protocol"
      ]
    },
    {
      "name": "claude code",
      "type": "project",
      "description": "Mentioned as a client within the MCP architecture of the ElizaOS project. It is part of the technical discussions.",
      "aliases": []
    },
    {
      "name": "cursor",
      "type": "project",
      "description": "Mentioned as a client within the MCP architecture of the ElizaOS project. It is part of the technical discussions.",
      "aliases": []
    },
    {
      "name": "codex",
      "type": "project",
      "description": "Mentioned as a client within the MCP architecture of the ElizaOS project. It is part of the technical discussions.",
      "aliases": []
    },
    {
      "name": "plugin-telegram",
      "type": "project",
      "description": "A plugin for the ElizaOS project that is undergoing technical development, including refactoring attempts and deployment challenges. It is mentioned in the context of both cloud deployments and local functionality.",
      "aliases": []
    },
    {
      "name": "DigitalOcean",
      "type": "project",
      "description": "A cloud hosting provider where users have experienced difficulty deploying the plugin-telegram. It is mentioned as a platform for hosting agents and services.",
      "aliases": []
    },
    {
      "name": "wuhuoqiu",
      "type": "user",
      "description": "A user whose Twitter/X post was shared within the ElizaOS community. Their post was mentioned alongside a comment about the potential for randomness in short-term observations.",
      "aliases": []
    },
    {
      "name": "Twitter/X",
      "type": "project",
      "description": "A social media platform where posts from Binance CEO CZ and user wuhuoqiu were shared within the ElizaOS community. Used for external mentions and discussions.",
      "aliases": [
        "X"
      ]
    },
    {
      "name": "Solfare",
      "type": "project",
      "description": "A platform or exchange where users hold $AI16Z tokens. Questions were raised about whether $AI16Z on Solfare would auto-migrate to ElizaOS.",
      "aliases": []
    },
    {
      "name": "Bybit",
      "type": "project",
      "description": "A centralized exchange (CEX) from which users need to transfer $AI16Z tokens to self-custody wallets to participate in the migration to $ElizaOS.",
      "aliases": []
    },
    {
      "name": "Railway",
      "type": "project",
      "description": "A cloud hosting platform mentioned in relation to deployment challenges for plugin-telegram and limitations with FTP uploads for large databases. Alternatives were suggested.",
      "aliases": []
    },
    {
      "name": "OpenAI",
      "type": "project",
      "description": "A provider of AI models, with users experiencing context size limitations when using their services with large databases (1GB+).",
      "aliases": []
    },
    {
      "name": "Layer One X",
      "type": "project",
      "description": "An entity that reached out to ElizaOS with a partnership proposal. The proposal includes offerings such as liquidity provision, cross-chain launch capabilities, and exchange listing access.",
      "aliases": []
    },
    {
      "name": "xiaozhi-esp32",
      "type": "project",
      "description": "A GitHub project related to hardware integration that ElizaOS is exploring for potential partnership opportunities.",
      "aliases": []
    },
    {
      "name": "Hetzner",
      "type": "project",
      "description": "A hosting provider suggested as an alternative for agents with large databases, particularly for users who require FTP access.",
      "aliases": []
    },
    {
      "name": "OVH VPSes",
      "type": "project",
      "description": "A hosting provider recommended as an alternative for agents with large databases, offering Virtual Private Servers (VPS) and FTP access.",
      "aliases": []
    },
    {
      "name": "WholesaleInternet",
      "type": "project",
      "description": "A hosting provider suggested as an alternative for agents with large databases, offering solutions potentially suitable for large database hosting.",
      "aliases": []
    },
    {
      "name": "BuyVM",
      "type": "project",
      "description": "A hosting provider recommended as an alternative for agents with large databases, suitable for users requiring robust hosting solutions.",
      "aliases": []
    },
    {
      "name": "Postgres",
      "type": "project",
      "description": "A database management system mentioned in the context of hosting solutions for agents. It is suggested for use with dump uploads or custom images for platforms like Railway.",
      "aliases": []
    },
    {
      "name": "pglite",
      "type": "project",
      "description": "A database-related component or technology mentioned in relation to creating custom images for platforms like Railway, specifically for hosting agents with large databases.",
      "aliases": []
    },
    {
      "name": "Microsoft",
      "type": "project",
      "description": "A company whose spec-kit framework was used in a refactoring attempt by a developer on the ElizaOS project. The attempt involved challenges and was eventually rolled back.",
      "aliases": []
    },
    {
      "name": "spec-kit",
      "type": "project",
      "description": "A framework developed by Microsoft that was used in a refactoring attempt by a developer within the ElizaOS project. The developer rolled back the changes due to difficulties encountered.",
      "aliases": []
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-29T08:00:35.165644Z"
  }
}