{
  "source": "2025-04-10.json",
  "entities": [
    {
      "name": "ElizaOS",
      "type": "project",
      "description": "An open-source operating system for AI agents and a development platform for creating and deploying them. It features a modular architecture with support for plugins and customizable agent capabilities.",
      "aliases": [
        "ElizaOS v1",
        "ElizaOS v2",
        "ElizaOS v1 and v2"
      ]
    },
    {
      "name": "Shaw",
      "type": "user",
      "description": "A developer and contributor to projects like Auto.fun and ElizaOS, focusing on AI development, testing, and community engagement.",
      "aliases": [
        "Shaw (@shawmakesmagic)"
      ]
    },
    {
      "name": "Auto.fun",
      "type": "project",
      "description": "A platform or project being developed by Shaw, involving extensive development, testing, and 'playtesting' over the coming weeks.",
      "aliases": []
    },
    {
      "name": "Twitter",
      "type": "project",
      "description": "A social media platform known for its microblogging services, often used by developers and projects for announcements and community interaction.",
      "aliases": [
        "twitter plugin"
      ]
    },
    {
      "name": "SpartanAI",
      "type": "project",
      "description": "A project that was previously known as DegenAI and has been reactivated on Twitter. It is currently using v1 while v2 development continues.",
      "aliases": [
        "DegenAI"
      ]
    },
    {
      "name": "ElizaDAO",
      "type": "project",
      "description": "A decentralized autonomous organization focused on community governance and coordinated action, organized as a 'Supermind' with working circles and a reputation tracking system.",
      "aliases": []
    },
    {
      "name": "Vincent Paul",
      "type": "user",
      "description": "An individual who initiated the organization of ElizaDAO as a 'Supermind' with five working circles.",
      "aliases": []
    },
    {
      "name": "Jin",
      "type": "user",
      "description": "A community member who shared development of a reputation/contribution tracking system for ElizaDAO, monitoring engagement, analyzing sentiment, and scoring GitHub contributions.",
      "aliases": []
    },
    {
      "name": "Model Context Protocol",
      "type": "project",
      "description": "A protocol designed to act as a bridge between Large Language Models (LLMs) and current software paradigms, facilitating dynamic agent communication.",
      "aliases": [
        "MCP"
      ]
    },
    {
      "name": "DorianD",
      "type": "user",
      "description": "A community member who proposed an 'Eliza agent registry' using JSON 'Agent Cards' with trust scores for capability discovery and selection.",
      "aliases": []
    },
    {
      "name": "GitHub",
      "type": "project",
      "description": "A web-based platform and service for version control using Git, widely used for software development and collaboration. It hosts repositories and facilitates code reviews.",
      "aliases": [
        "GitHub authentication"
      ]
    },
    {
      "name": "Grok3 API",
      "type": "project",
      "description": "An API service that has been announced as 'up', indicating its operational status. Further details about its functionality are not provided.",
      "aliases": []
    },
    {
      "name": "Solana",
      "type": "token",
      "description": "A high-performance blockchain platform designed for decentralized applications and cryptocurrencies, known for its speed and scalability.",
      "aliases": []
    },
    {
      "name": "Raydium",
      "type": "project",
      "description": "A decentralized exchange (DEX) and automated market maker (AMM) built on the Solana blockchain, facilitating token swaps and liquidity provision.",
      "aliases": []
    },
    {
      "name": "OpenAI",
      "type": "project",
      "description": "An artificial intelligence research and deployment company focused on creating safe and beneficial artificial general intelligence. Known for developing advanced LLMs.",
      "aliases": [
        "OpenAI TTS"
      ]
    },
    {
      "name": "Solflare",
      "type": "project",
      "description": "A cryptocurrency wallet designed for the Solana blockchain, used for managing digital assets and interacting with decentralized applications.",
      "aliases": []
    },
    {
      "name": "Phantom",
      "type": "project",
      "description": "A cryptocurrency wallet primarily for the Solana and EVM ecosystems, used for managing digital assets, NFTs, and interacting with dApps.",
      "aliases": []
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-29T07:20:01.315867Z"
  }
}