{
  "source": "2025-04-21.json",
  "entities": [
    {
      "name": "Auto.fun",
      "type": "project",
      "description": "A token launchpad platform developed by the ElizaOS team, focusing on AI token creation and token-gated content sharing. It also serves as a strategic expansion for ElizaOS, connecting it with tokenization.",
      "aliases": [
        "auto.fun"
      ]
    },
    {
      "name": "ElizaOS",
      "type": "project",
      "description": "A development platform or ecosystem that includes plugins for Discord and Telegram, and supports the creation of AI agents and token launchpad platforms.",
      "aliases": [
        "ElizaOS v2"
      ]
    },
    {
      "name": "Shaw",
      "type": "user",
      "description": "A developer or contributor associated with ElizaOS and the launch of Auto.fun.",
      "aliases": []
    },
    {
      "name": "ai16z",
      "type": "token",
      "description": "The native token associated with the Auto.fun platform, created by the ElizaOS team and DAO. It is involved in fee buybacks and ecosystem liquidity.",
      "aliases": [
        "$ai16z"
      ]
    },
    {
      "name": "SOL",
      "type": "token",
      "description": "Solana is a blockchain platform known for its high transaction speeds and low costs, often used in the tokenization and DeFi space.",
      "aliases": []
    },
    {
      "name": "Jupiter",
      "type": "project",
      "description": "A decentralized exchange aggregator on the Solana blockchain, facilitating token swaps and providing liquidity.",
      "aliases": []
    },
    {
      "name": "WETH",
      "type": "token",
      "description": "Wrapped Ethereum is an ERC-20 token that represents Ether (ETH) on the Ethereum blockchain, allowing ETH to be used in smart contracts and DeFi applications.",
      "aliases": [
        "Wrapped Ethereum"
      ]
    },
    {
      "name": "Raydium",
      "type": "project",
      "description": "A permissionless decentralized exchange (DEX) and automated market maker (AMM) built on the Solana blockchain, known for its liquidity pools and yield farming capabilities.",
      "aliases": []
    },
    {
      "name": "Meteora",
      "type": "project",
      "description": "A decentralized finance (DeFi) protocol on the Solana blockchain that offers various liquidity solutions, including concentrated liquidity.",
      "aliases": []
    },
    {
      "name": "Aubrey de Grey",
      "type": "user",
      "description": "An individual potentially serving as a scientific advisor or researcher, whose persona is being considered for AI agent impersonation.",
      "aliases": []
    },
    {
      "name": "DAO",
      "type": "project",
      "description": "Decentralized Autonomous Organization is a type of organization represented by rules encoded as a computer program that is transparent, user-controlled, and censorship-resistant.",
      "aliases": []
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-29T07:22:49.665445Z"
  }
}