{
  "source": "2025-08-02.json",
  "entities": [
    {
      "name": "ElizaOS",
      "type": "project",
      "description": "An operating system for AI agents focused on development and cloud integration. It aims to provide a robust platform for building and deploying autonomous agents.",
      "aliases": [
        "ElizaOS"
      ]
    },
    {
      "name": "Eliza Cloud",
      "type": "project",
      "description": "A cloud platform for deploying and hosting AI agents developed by ElizaOS. It focuses on integration with various cloud providers and enabling AI-assisted agent creation.",
      "aliases": [
        "Eliza Cloud"
      ]
    },
    {
      "name": "Railway",
      "type": "project",
      "description": "A cloud deployment platform that allows developers to deploy applications easily. It supports various databases like Postgres and Redis.",
      "aliases": [
        "Railway"
      ]
    },
    {
      "name": "Phala Cloud",
      "type": "project",
      "description": "A decentralized cloud computing platform that offers confidential computing services. It is used for deploying AI agents and applications.",
      "aliases": [
        "Phala cloud"
      ]
    },
    {
      "name": "Stripe",
      "type": "project",
      "description": "A financial services and technology company that offers payment processing software and APIs for e-commerce websites and mobile applications. It supports both fiat and crypto payments.",
      "aliases": [
        "Stripe"
      ]
    },
    {
      "name": "x402",
      "type": "project",
      "description": "A payment system integrated with ElizaOS. It likely offers account top-up services and potentially supports cryptocurrency payments.",
      "aliases": [
        "x402"
      ]
    },
    {
      "name": "Twitter API",
      "type": "project",
      "description": "An application programming interface provided by Twitter that allows developers to interact with Twitter's data and features. Authentication methods have evolved to use keys.",
      "aliases": [
        "Twitter API"
      ]
    },
    {
      "name": "X (Twitter)",
      "type": "project",
      "description": "A social media and microblogging platform. It is used for communication and currently faces issues with its API authentication.",
      "aliases": [
        "X (Twitter)",
        "Twitter"
      ]
    },
    {
      "name": "Kenk",
      "type": "user",
      "description": "A key individual involved in ElizaOS development, frequently providing clarifications and updates on project status and technical issues.",
      "aliases": [
        "Kenk"
      ]
    },
    {
      "name": "Redis",
      "type": "project",
      "description": "An open-source, in-memory data structure store, used as a database, cache, and message broker. It supports features like job management and queuing.",
      "aliases": [
        "Redis"
      ]
    },
    {
      "name": "MySQL",
      "type": "project",
      "description": "An open-source relational database management system. It is used within the ElizaOS ecosystem for data storage, and issues related to its support have been addressed.",
      "aliases": [
        "MySQL"
      ]
    },
    {
      "name": "Poink",
      "type": "project",
      "description": "A team that claimed to switch from ElizaOS to another platform, though ElizaOS disputes any prior working relationship. Their product's robustness has been questioned.",
      "aliases": [
        "Poink",
        "Oink"
      ]
    },
    {
      "name": "openserv",
      "type": "project",
      "description": "An alternative platform that a team named Poink claimed to have switched to from ElizaOS. ElizaOS has no record of working with this team.",
      "aliases": [
        "openserv"
      ]
    },
    {
      "name": "npm",
      "type": "project",
      "description": "A package manager for the JavaScript programming language. ElizaOS plans to package its editor for publishing on npm.",
      "aliases": [
        "npm"
      ]
    },
    {
      "name": "WorkOS",
      "type": "project",
      "description": "A platform focused on providing authentication solutions for businesses. It is planned for integration into ElizaOS for authentication purposes.",
      "aliases": [
        "WorkOS"
      ]
    },
    {
      "name": "Claude",
      "type": "project",
      "description": "A large language model developed by Anthropic. It is mentioned as a potential cost-saving alternative in the context of AI agent development.",
      "aliases": [
        "Claude"
      ]
    },
    {
      "name": "Anthropic",
      "type": "project",
      "description": "An artificial intelligence safety and research company. They are known for developing large language models like Claude.",
      "aliases": [
        "Anthropic"
      ]
    },
    {
      "name": "USDC",
      "type": "token",
      "description": "A stablecoin cryptocurrency, typically pegged to the US dollar. It is mentioned in the context of payment options alongside fiat currency.",
      "aliases": [
        "USDC"
      ]
    },
    {
      "name": "Postgres",
      "type": "project",
      "description": "An open-source relational database system known for its reliability and feature robustness. It is used in cloud deployments for ElizaOS agents.",
      "aliases": [
        "Postgres"
      ]
    },
    {
      "name": "Drizzle ORM",
      "type": "project",
      "description": "An Object-Relational Mapping library for JavaScript and TypeScript, primarily used with SQL databases. It is facing integration challenges within ElizaOS development.",
      "aliases": [
        "Drizzle ORM"
      ]
    },
    {
      "name": "PGlite",
      "type": "project",
      "description": "A lightweight, in-browser SQLite database solution. There's a discussion about whether to keep PGlite or standardize on PostgreSQL within ElizaOS.",
      "aliases": [
        "PGlite"
      ]
    },
    {
      "name": "Dexscreener Plugin",
      "type": "project",
      "description": "A plugin for ElizaOS that provides access to cryptocurrency market data, likely from the Dexscreener platform. It has recently been updated.",
      "aliases": [
        "Dexscreener Plugin"
      ]
    },
    {
      "name": "Farcaster",
      "type": "project",
      "description": "A decentralized social network protocol. ElizaOS plans to implement Farcaster support using webhooks for integration.",
      "aliases": [
        "Farcaster"
      ]
    },
    {
      "name": "Neynar",
      "type": "project",
      "description": "A platform or service that provides tools for interacting with the Farcaster protocol, likely offering webhook functionalities for integration.",
      "aliases": [
        "Neynar"
      ]
    },
    {
      "name": "Eli5",
      "type": "token",
      "description": "A community cryptocurrency launched on the Auto.Fun platform, with potential future plans to be developed into an AI agent.",
      "aliases": [
        "Eli5"
      ]
    },
    {
      "name": "Auto.Fun",
      "type": "project",
      "description": "A platform, potentially a launchpad or exchange, where the 'Eli5' cryptocurrency was launched. Shaw, associated with ElizaOS, is involved with this platform.",
      "aliases": [
        "Auto.Fun"
      ]
    },
    {
      "name": "Docker",
      "type": "project",
      "description": "An open-source platform for developing, shipping, and running applications in containers. It is used for setting up local services and deployments for ElizaOS.",
      "aliases": [
        "Docker"
      ]
    },
    {
      "name": "Podman",
      "type": "project",
      "description": "An open-source container engine for developing, managing, and running OCI Containers. It is mentioned as being supported alongside Docker for ElizaOS.",
      "aliases": [
        "Podman"
      ]
    },
    {
      "name": "Shaw",
      "type": "user",
      "description": "A key figure in ElizaOS development, involved in outlining the Eliza Cloud roadmap, integrations, and payment systems. Also associated with the Auto.Fun platform.",
      "aliases": [
        "Shaw"
      ]
    },
    {
      "name": "Sam-developer",
      "type": "user",
      "description": "A developer who successfully deployed Eliza Cloud to Railway, including Postgres and Redis, with CI/CD integration.",
      "aliases": [
        "sam-developer"
      ]
    },
    {
      "name": "Joshua",
      "type": "user",
      "description": "An agent or developer who created and shared rules for deploying Eliza Cloud to Phala Cloud, including a working example.",
      "aliases": [
        "Agent Joshua"
      ]
    },
    {
      "name": "Vercel AI SDK",
      "type": "project",
      "description": "A software development kit provided by Vercel for integrating AI models into applications. It has a 'system' field for system prompts.",
      "aliases": [
        "vercel ai sdk"
      ]
    },
    {
      "name": "Spartan",
      "type": "project",
      "description": "A name associated with a Farcaster integration or bot within ElizaOS. There were discussions about its posting frequency and efficiency.",
      "aliases": [
        "Spartan"
      ]
    },
    {
      "name": "Manus",
      "type": "project",
      "description": "A system mentioned as a comparison for creating autonomous agents that can communicate and collaborate on tasks, similar to the capabilities being explored in ElizaOS.",
      "aliases": [
        "Manus"
      ]
    },
    {
      "name": "Kimi K2",
      "type": "project",
      "description": "A service or product referred to in the context of a 'flatrate' for stakers, potentially offering an alternative for AI compute.",
      "aliases": [
        "Kimi K2"
      ]
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-29T07:43:00.724276Z"
  }
}