{
  "source": "2025-08-20.json",
  "entities": [
    {
      "name": "Clank Tank",
      "type": "project",
      "description": "A new AI-powered governance system for token-based voting, inspired by Shark Tank, that transforms traditional DAO governance into engaging video content. It allows users to send tokens to influence AI judges' decisions, with those tokens being burned.",
      "aliases": [
        "clank tank"
      ]
    },
    {
      "name": "Twitter plugin",
      "type": "project",
      "description": "A plugin or integration related to the Twitter platform, which has been experiencing technical issues.",
      "aliases": []
    },
    {
      "name": "Cross-environment logger",
      "type": "project",
      "description": "A component or system designed to support logging across different environments.",
      "aliases": []
    },
    {
      "name": "SQL parameters",
      "type": "project",
      "description": "Parameters used in SQL queries, with fixes implemented for entity creation.",
      "aliases": []
    },
    {
      "name": "Jin",
      "type": "user",
      "description": "A user or contributor involved in discussions and project development.",
      "aliases": []
    },
    {
      "name": "DAO",
      "type": "project",
      "description": "Decentralized Autonomous Organization, a type of community-led entity with no central authority.",
      "aliases": []
    },
    {
      "name": "plugin-bootstrap repository",
      "type": "project",
      "description": "A repository related to bootstrapping plugins, which has been moved to a monorepo structure.",
      "aliases": []
    },
    {
      "name": "monorepo",
      "type": "project",
      "description": "A software development strategy where code for many projects is stored in the same repository.",
      "aliases": []
    },
    {
      "name": "standalone plugins",
      "type": "project",
      "description": "Plugins that can function independently and are not tightly coupled to a main application.",
      "aliases": []
    },
    {
      "name": "ai16z",
      "type": "token",
      "description": "A token associated with the AI16Z project, used for voting and potentially undergoing rebranding.",
      "aliases": [
        "$AI16Z",
        "AI16Z"
      ]
    },
    {
      "name": "Discord",
      "type": "project",
      "description": "A communication platform popular for communities, used for discussions and voting.",
      "aliases": []
    },
    {
      "name": "clanktank.tv",
      "type": "project",
      "description": "A website or platform associated with Clank Tank, used for voting on submissions and viewing content.",
      "aliases": []
    },
    {
      "name": "elizaOS",
      "type": "project",
      "description": "A project or platform, potentially undergoing rebranding from AI16Z, involved in blockchain standards and interoperability.",
      "aliases": []
    },
    {
      "name": "blockchain",
      "type": "token",
      "description": "A decentralized, distributed ledger technology used for recording transactions across many computers.",
      "aliases": []
    },
    {
      "name": "Solana",
      "type": "token",
      "description": "A high-throughput blockchain designed for scalability, supporting decentralized applications and cryptocurrencies.",
      "aliases": []
    },
    {
      "name": "Chainlink",
      "type": "project",
      "description": "A decentralized oracle network that provides real-world data to smart contracts on the blockchain.",
      "aliases": []
    },
    {
      "name": "CCIP",
      "type": "project",
      "description": "Cross-Chain Interoperability Protocol, a standard developed by Chainlink for enabling secure cross-chain communication.",
      "aliases": [
        "Cross-Chain Token standard"
      ]
    },
    {
      "name": "Vulcan",
      "type": "project",
      "description": "An alternative service suggested to replace CollabLand for managing partners and channels.",
      "aliases": []
    },
    {
      "name": "CollabLand",
      "type": "project",
      "description": "A service or tool used for managing community roles and access, which has been experiencing issues.",
      "aliases": []
    },
    {
      "name": "AWS Agent-as-a-service gateway",
      "type": "project",
      "description": "A gateway service for managing agents on AWS, referred to as AaaS.",
      "aliases": [
        "AaaS"
      ]
    },
    {
      "name": "Shaw",
      "type": "user",
      "description": "An individual previously associated with live coding streams and development efforts, with inquiries about their current activities.",
      "aliases": []
    },
    {
      "name": "GitHub",
      "type": "project",
      "description": "A web-based platform for version control using Git, used for hosting software development projects and collaboration.",
      "aliases": []
    },
    {
      "name": "Phala CLI",
      "type": "project",
      "description": "A Command Line Interface tool for the Phala Network, used for deployment and management.",
      "aliases": []
    },
    {
      "name": "Phala Network",
      "type": "token",
      "description": "A privacy-preserving cloud computing network built on Substrate and compatible with Polkadot.",
      "aliases": []
    },
    {
      "name": "Eliza-nextjs-starter",
      "type": "project",
      "description": "A starter template or project based on Next.js, likely for developing applications within the Eliza ecosystem.",
      "aliases": []
    },
    {
      "name": "plugin-embeddings",
      "type": "project",
      "description": "A plugin or module related to embeddings, discussed in the context of service placement and event handlers.",
      "aliases": []
    },
    {
      "name": "daos.fun",
      "type": "project",
      "description": "A platform or service related to DAOs, mentioned in the context of expiring token utility.",
      "aliases": []
    },
    {
      "name": "auto.fun",
      "type": "project",
      "description": "A platform or service that may integrate with Clank Tank for project incubation or accelerator programs.",
      "aliases": []
    },
    {
      "name": "Eliza brandkit",
      "type": "project",
      "description": "A repository or collection of brand assets and style guidelines for the Eliza project.",
      "aliases": []
    },
    {
      "name": "Ponzi",
      "type": "user",
      "description": "A name considered for an agent, referencing Charles Ponzi, a historical figure known for a financial scheme.",
      "aliases": []
    },
    {
      "name": "Charles Ponzi",
      "type": "user",
      "description": "A historical figure associated with Ponzi schemes, mentioned in the context of naming an agent.",
      "aliases": []
    },
    {
      "name": "quick-start method",
      "type": "project",
      "description": "A streamlined process or template for quickly setting up new projects, with guidance on custom plugin integration.",
      "aliases": []
    },
    {
      "name": "bun",
      "type": "project",
      "description": "Fast JavaScript runtime, bundler, and package manager. Logo is a white bun/dumpling on black.",
      "aliases": []
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-29T07:50:51.975049Z"
  }
}