{
  "source": "2025-07-20.json",
  "entities": [
    {
      "name": "ElizaOS",
      "type": "project",
      "description": "A project focusing on protocol-level tokenomics and integrating AI technologies like Ollama.",
      "aliases": [
        "elizaOS"
      ]
    },
    {
      "name": "AI16Z",
      "type": "token",
      "description": "A token associated with the ElizaOS project, with discussions revolving around its mint authority and contract transparency.",
      "aliases": []
    },
    {
      "name": "Ollama",
      "type": "project",
      "description": "An open-source project that allows running large language models on local hardware, integrated into ElizaOS.",
      "aliases": []
    },
    {
      "name": "X",
      "type": "project",
      "description": "A social media platform, formerly known as Twitter, whose users include the ElizaOS team.",
      "aliases": [
        "Twitter"
      ]
    },
    {
      "name": "GitHub",
      "type": "project",
      "description": "A web-based platform for version control and collaboration, where the ElizaOS project's code is hosted and developed.",
      "aliases": []
    },
    {
      "name": "starlord",
      "type": "user",
      "description": "A user who created a GitHub branch to implement Ollama integration for the plugin-knowledge component of ElizaOS.",
      "aliases": []
    },
    {
      "name": "Kenk",
      "type": "user",
      "description": "A team representative for ElizaOS who provided updates on X account suspension and protocol-level tokenomics.",
      "aliases": []
    },
    {
      "name": "DorianD",
      "type": "user",
      "description": "A representative who provided information regarding the AI16Z token contract transparency and mint authority.",
      "aliases": []
    },
    {
      "name": "traderlv",
      "type": "user",
      "description": "A user who commented on ElizaOS's marketing strategy, emphasizing product quality over marketing efforts.",
      "aliases": []
    },
    {
      "name": "Discord",
      "type": "project",
      "description": "A communication platform used for community discussions related to the ElizaOS project.",
      "aliases": []
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-29T07:41:01.734316Z"
  }
}