{
  "source": "2025-10-29.json",
  "entities": [
    {
      "name": "ElizaOS",
      "type": "project",
      "description": "An operating system focused on AI and decentralized technologies. Its development involves implementation of middleware, protocol development, and token migration preparations.",
      "aliases": [
        "elizaOS"
      ]
    },
    {
      "name": "Spartan",
      "type": "project",
      "description": "A component or feature within the ElizaOS ecosystem, possibly related to LLM trading or a trading tool.",
      "aliases": []
    },
    {
      "name": "x402",
      "type": "project",
      "description": "A standard or technology being integrated into ElizaOS, with ongoing middleware development and potential partnerships.",
      "aliases": [
        "x402.org"
      ]
    },
    {
      "name": "Protocol 8004",
      "type": "project",
      "description": "A protocol being developed within the ElizaOS ecosystem, with plans for a functional MVP by mid-November's Devcon.",
      "aliases": []
    },
    {
      "name": "Odilitime",
      "type": "user",
      "description": "A contributor working on the x402 middleware implementation for Spartan within the ElizaOS development.",
      "aliases": []
    },
    {
      "name": "x402scan.com",
      "type": "project",
      "description": "A service or platform related to x402, from which specific requirements for middleware development are being drawn.",
      "aliases": []
    },
    {
      "name": "Stan",
      "type": "user",
      "description": "A developer who implemented a 'smart merge solution' to fix an environment variable bug in the ElizaOS project.",
      "aliases": []
    },
    {
      "name": "Coinbase",
      "type": "project",
      "description": "A cryptocurrency exchange platform, involved in coordination meetings regarding X402.",
      "aliases": []
    },
    {
      "name": "Borko",
      "type": "user",
      "description": "A contributor involved in the development of protocol 8004 and plans for its functional MVP.",
      "aliases": []
    },
    {
      "name": "Otaku",
      "type": "project",
      "description": "A new agent within the ElizaOS ecosystem that is currently in beta testing, with early access offered to partners.",
      "aliases": []
    },
    {
      "name": "Devcon",
      "type": "project",
      "description": "A conference event where a functional MVP for protocol 8004 is planned to be ready.",
      "aliases": []
    },
    {
      "name": "DorianD",
      "type": "user",
      "description": "A proponent of a narrative around 'Artificial Social Intelligence Credits' and a suggested fear and greed marketing strategy for ElizaOS.",
      "aliases": []
    },
    {
      "name": "Artificial Social Intelligence Credits",
      "type": "project",
      "description": "A proposed reputation system within the ElizaOS ecosystem, designed to function similarly to credit systems.",
      "aliases": [
        "ASICs"
      ]
    },
    {
      "name": "Komi",
      "type": "user",
      "description": "A team member urging to capitalize on the current momentum around Base's 402 narrative.",
      "aliases": []
    },
    {
      "name": "Base",
      "type": "token",
      "description": "A Layer 2 scaling solution for Ethereum, alongside its associated '402 narrative' which the team is urged to capitalize on.",
      "aliases": []
    },
    {
      "name": "Toni",
      "type": "user",
      "description": "A team member who explained the fixed migration ratio and incentives for ElizaOS token migration.",
      "aliases": []
    },
    {
      "name": "AI16Z",
      "type": "token",
      "description": "A token from which users are inquiring about migration to ElizaOS, with details on ratios and incentives.",
      "aliases": [
        "$ai16z"
      ]
    },
    {
      "name": "Spartan LLM Trading tool",
      "type": "project",
      "description": "A tool within the ElizaOS ecosystem, possibly related to Spartan, where users can try out LLM trading.",
      "aliases": []
    },
    {
      "name": "Spartan Arena",
      "type": "project",
      "description": "An upcoming component or feature within the ElizaOS ecosystem, related to Spartan.",
      "aliases": []
    },
    {
      "name": "Erik Reppel",
      "type": "user",
      "description": "The creator of x402.org, whose interview suggests intentions to integrate with the x402 standard within the ElizaOS ecosystem.",
      "aliases": []
    },
    {
      "name": "Gnosis",
      "type": "project",
      "description": "A decentralized prediction market, serving as inspiration for the 'Artificial Social Intelligence Credits' within ElizaOS.",
      "aliases": []
    },
    {
      "name": "Opinion Labs",
      "type": "project",
      "description": "A prediction market platform that, along with Gnosis, inspired the concept of 'Artificial Social Intelligence Credits' within ElizaOS.",
      "aliases": []
    },
    {
      "name": "GitHub",
      "type": "project",
      "description": "A platform for version control and software development, where pull requests and issues are managed for ElizaOS.",
      "aliases": []
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-29T08:03:30.267660Z"
  }
}