{
  "source": "2025-10-27.json",
  "entities": [
    {
      "name": "ElizaOS",
      "type": "project",
      "description": "A decentralized operating system or platform. It seems to be a successor or evolution of AI16Z, with a focus on Solana as its native chain and cross-chain functionality.",
      "aliases": [
        "elizaOS"
      ]
    },
    {
      "name": "AI16Z",
      "type": "token",
      "description": "An existing token that is undergoing a migration to the ElizaOS token. It is the predecessor or current version of ElizaOS tokens.",
      "aliases": [
        "AI16Z"
      ]
    },
    {
      "name": "Solana",
      "type": "token",
      "description": "A high-performance public blockchain platform known for its speed and low transaction costs. It utilizes a Proof-of-History (PoH) consensus mechanism in addition to Proof-of-Stake (PoS).",
      "aliases": [
        "SOL"
      ]
    },
    {
      "name": "CCIP",
      "type": "project",
      "description": "Cross-Chain Interoperability Protocol, a standard or system used to enable communication and asset transfer between different blockchain networks.",
      "aliases": []
    },
    {
      "name": "Ethereum",
      "type": "token",
      "description": "A decentralized, open-source, public blockchain system that features smart contract functionality. It is the second-largest blockchain by market capitalization and is known for its smart contract capabilities.",
      "aliases": []
    },
    {
      "name": "Base",
      "type": "token",
      "description": "A layer-2 scaling solution built on top of the Ethereum blockchain, developed by Coinbase. It aims to provide lower transaction fees and faster confirmation times.",
      "aliases": []
    },
    {
      "name": "BNB Chain",
      "type": "token",
      "description": "A decentralized blockchain network developed by the cryptocurrency exchange Binance. It consists of BNB Beacon Chain (for governance and staking) and BNB Smart Chain (for smart contracts and dApps).",
      "aliases": []
    },
    {
      "name": "GitHub",
      "type": "project",
      "description": "A web-based platform for version control using Git that offers distributed version control and source code management (SCM) functionality. It is widely used for software development and collaboration.",
      "aliases": []
    },
    {
      "name": "x402",
      "type": "project",
      "description": "An emerging ecosystem or standard that ElizaOS is integrating with, particularly for agent messaging and payment capabilities.",
      "aliases": []
    },
    {
      "name": "DegenAI",
      "type": "token",
      "description": "A token that will coexist with the ElizaOS token after the migration. It is suggested by some community members to be currently undervalued.",
      "aliases": [
        "degenAI"
      ]
    },
    {
      "name": "PayAI",
      "type": "project",
      "description": "An entity that the ElizaOS team has identified a security threat related to, involving fake accounts running airdrop scams. The team plans to inform PayAI about the situation.",
      "aliases": []
    },
    {
      "name": "Spartan Arena",
      "type": "project",
      "description": "A project related to trading bots or LLMs competing in trading, indicating expansion into the algorithmic trading space.",
      "aliases": []
    },
    {
      "name": "Rati AI",
      "type": "project",
      "description": "An entity that has filed a trademark, as announced in the ElizaOS community discussions.",
      "aliases": []
    },
    {
      "name": "Web3 authentication",
      "type": "project",
      "description": "A method or flow for authenticating users within decentralized applications, typically involving the use of cryptocurrency wallets.",
      "aliases": []
    },
    {
      "name": "Metalos",
      "type": "project",
      "description": "Unknown - needs research",
      "aliases": []
    },
    {
      "name": "Coinbase",
      "type": "project",
      "description": "A cryptocurrency exchange platform and one of the largest major exchanges globally. It also develops and supports blockchain technologies.",
      "aliases": []
    },
    {
      "name": "Polygon",
      "type": "token",
      "description": "A blockchain scaling solution that provides an easy-to-use interface for developers to build and launch DApps and other blockchain-based projects. It aims to improve scalability and reduce transaction fees on Ethereum.",
      "aliases": []
    },
    {
      "name": "WuAI",
      "type": "project",
      "description": "A platform for launching AI agents that replicate a user's digital footprint, with plans to integrate x402.",
      "aliases": []
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-29T08:03:17.432660Z"
  }
}