{
  "source": "2025-11-18.json",
  "entities": [
    {
      "name": "ElizaOS",
      "type": "project",
      "description": "An operating system or platform that involves token migration, technical development, and community discussions. It is associated with a token migration process and the development of a cloud service.",
      "aliases": [
        "ElizaOS",
        "elizaOS"
      ]
    },
    {
      "name": "AI16Z",
      "type": "token",
      "description": "A token associated with the ElizaOS project, from which migration is occurring. It is mentioned in the context of conversion ratios and liquidity pools with ELIZAOS.",
      "aliases": [
        "AI16Z"
      ]
    },
    {
      "name": "ELIZAOS",
      "type": "token",
      "description": "The token of the ElizaOS project, undergoing migration from AI16Z. It is planned to be used for the Eliza Cloud service and potentially has token-gated use cases.",
      "aliases": [
        "ELIZAOS",
        "ELIZAOS"
      ]
    },
    {
      "name": "Bithumb",
      "type": "project",
      "description": "A Korean cryptocurrency exchange that posted a rebranding notice for ElizaOS, indicating continued support during the token transition.",
      "aliases": [
        "Bithumb"
      ]
    },
    {
      "name": "DorianD",
      "type": "user",
      "description": "A user involved in technical discussions on ElizaOS, exploring the implementation of ZK primitives for game features and a distributed runtime.",
      "aliases": [
        "DorianD"
      ]
    },
    {
      "name": "Stan",
      "type": "user",
      "description": "A user who shared a GitHub pull request for an Eliza NextJS starter, contributing to the technical development discussions.",
      "aliases": [
        "Stan"
      ]
    },
    {
      "name": "Eliza NextJS starter",
      "type": "project",
      "description": "A starter project for NextJS developed within the ElizaOS ecosystem, indicated by its sharing on GitHub.",
      "aliases": [
        "Eliza NextJS starter"
      ]
    },
    {
      "name": "Borko",
      "type": "user",
      "description": "A user assigned to conduct product research on the Tolans app, focusing on its onboarding process.",
      "aliases": [
        "Borko"
      ]
    },
    {
      "name": "Tolans app",
      "type": "project",
      "description": "An application that is undergoing product research, with a specific focus on its onboarding process.",
      "aliases": [
        "Tolans app"
      ]
    },
    {
      "name": "Dr. Neuro",
      "type": "user",
      "description": "A community member whose 7k images are of interest for export as a dataset for a LoRa model, suggesting a role in content creation or art.",
      "aliases": [
        "Dr. Neuro"
      ]
    },
    {
      "name": "Omid sa",
      "type": "user",
      "description": "A helper in the ElizaOS community who provided assistance with token migration issues and answered questions about unclaimed tokens.",
      "aliases": [
        "Omid sa"
      ]
    },
    {
      "name": "The Light",
      "type": "user",
      "description": "A helper in the ElizaOS community who provided answers regarding the use case of the new token and guided users on submitting tickets.",
      "aliases": [
        "The Light"
      ]
    },
    {
      "name": "jasyn_bjorn",
      "type": "user",
      "description": "A user in the ElizaOS community who received an answer regarding future token releases and participated in discussions.",
      "aliases": [
        "jasyn_bjorn"
      ]
    },
    {
      "name": "Odilitime",
      "type": "user",
      "description": "A helper in the ElizaOS community who provided a link to a Bithumb exchange notice.",
      "aliases": [
        "Odilitime"
      ]
    },
    {
      "name": "Carrabre",
      "type": "user",
      "description": "A helper in the ElizaOS community who warned a user about suspicious instructions and emphasized vigilance.",
      "aliases": [
        "Carrabre"
      ]
    },
    {
      "name": "DegenAI",
      "type": "project",
      "description": "A project that is still under development and is mentioned in the context of potential token-gated use cases for ELIZAOS tokens, serving as an example of token utility implementation.",
      "aliases": [
        "DegenAI"
      ]
    },
    {
      "name": "cjft",
      "type": "user",
      "description": "A community member who provided clarification on the ElizaOS core and runtime working in browsers and discussed the functions runtime::generateText and runtime::useModel.",
      "aliases": [
        "cjft"
      ]
    },
    {
      "name": "GitHub",
      "type": "project",
      "description": "A web-based platform and version control system for software development, where a pull request for an Eliza NextJS starter was shared and repository activity is tracked.",
      "aliases": [
        "GitHub"
      ]
    },
    {
      "name": "LoRa model",
      "type": "project",
      "description": "A type of machine learning model, specifically a low-rank adaptation technique, for which there is interest in using Dr. Neuro's images as a dataset.",
      "aliases": [
        "LoRa model"
      ]
    },
    {
      "name": "zk-SNARKs",
      "type": "project",
      "description": "Unknown - needs research",
      "aliases": [
        "zero-knowledge primitives",
        "ZK"
      ]
    },
    {
      "name": "ElizaOS Cloud",
      "type": "project",
      "description": "A future service developed by ElizaOS that is expected to generate revenue to buy back ELIZAOS tokens, thus creating demand and stabilizing token value.",
      "aliases": [
        "ElizaOS Cloud service",
        "Eliza Cloud service",
        "Eliza Cloud"
      ]
    },
    {
      "name": "LangChain",
      "type": "project",
      "description": "A framework for developing applications powered by language models. It was mentioned in the context of migrating from v0.3 to @langchain/textsplitters v1.0 in a GitHub pull request.",
      "aliases": [
        "LangChain v0.3",
        "@langchain/textsplitters v1.0"
      ]
    },
    {
      "name": "Phantom wallet",
      "type": "project",
      "description": "A cryptocurrency wallet that was recommended for users to import and migrate ElizaOS tokens from.",
      "aliases": [
        "Phantom wallet"
      ]
    },
    {
      "name": "Tangem wallet",
      "type": "project",
      "description": "A cryptocurrency wallet that was involved in token migration issues, with a recommendation to transfer tokens back to it and then import to another wallet.",
      "aliases": [
        "Tangem wallet"
      ]
    }
  ],
  "_metadata": {
    "extracted_at": "2025-12-29T08:05:23.425716Z"
  }
}