{
  "version": "1.0",
  "type": "repository",
  "interval": "day",
  "date": "2025-12-30",
  "generatedAt": "2025-12-30T23:13:02.358Z",
  "sourceLastUpdated": "2025-12-30T23:13:02.358Z",
  "contentFormat": "markdown",
  "contentHash": "91aefa2ea1795a43d2fd988b4302726f7b4e8278c33be0fa7f8501effc2dba72",
  "entity": {
    "repoId": "elizaos/eliza",
    "owner": "elizaos",
    "repo": "eliza"
  },
  "content": "# elizaos/eliza Daily Update (Dec 30, 2025)\n## OVERVIEW \nToday's development focused on critical bug fixes, specifically addressing an issue where streaming LLM calls were not being logged to the database. Several new features and fixes are in review, and multiple issues related to UI and documentation were closed.\n\n## KEY TECHNICAL DEVELOPMENTS\n\n### Core Runtime Stability\n*   A critical bug was fixed where streaming LLM calls were not being logged to the database due to incorrect placement of logging code after a return statement in the streaming path. This ensures all LLM calls are now properly recorded. ([#6296](https://github.com/elizaos/eliza/pull/6296))\n\n## NEWLY OPENED PULL REQUESTS\n*   A new pull request introduces unified hooks with multi-transport support for HTTP, SSE, and WebSocket, aiming to streamline communication mechanisms ([#6300](https://github.com/elizaos/eliza/pull/6300)).\n*   A minor fix addresses a typo, changing \"saftey\" to \"safety\" ([#6297](https://github.com/elizaos/eliza/pull/6297)).\n\n## CLOSED ISSUES\n\n### UI/UX Improvements\n*   Issues related to spacing in numbered items were resolved ([#6283](https://github.com/elizaos/eliza/issues/6283)).\n*   An issue where agent cards were not resizing to match dashboard agent cards was closed ([#6291](https://github.com/elizaos/eliza/issues/6291)).\n*   The behavior where clicking an agent always led to a brand new chat, instead of an existing conversation if one existed, has been addressed ([#6295](https://github.com/elizaos/eliza/issues/6295)).\n\n### Documentation and Monorepo Maintenance\n*   Documentation for the monorepo was fixed and updated ([#6284](https://github.com/elizaos/eliza/issues/6284)).\n\n## NEW ISSUES\n\n### Messaging API Refinements\n*   A new issue highlights several architectural problems within the current messaging API, including double/triple processing of messages and the presence of dead code related to WebSocket handling ([#6298](https://github.com/elizaos/eliza/issues/6298)).\n\n### Application Usability\n*   A new issue titled \"Unslop Apps\" has been opened, indicating a need to address general application sloppiness or lack of polish ([#6299](https://github.com/elizaos/eliza/issues/6299)).\n\n## ACTIVE ISSUES\nNo active issues with more than 3 comments."
}