{
  "ai-news": {
    "elizaos": {
      "discord_md_last_3_days": [
        {
          "filename": "2025-05-13.md",
          "content": "# elizaOS Discord - 2025-05-13\n\n## Overall Discussion Highlights\n\n### ElizaOS Development Status\n- ElizaOS v2 release is scheduled for the current month, with team members indicating they'll update when it's ready\n- Users can track development progress on GitHub at https://github.com/elizaos/eliza\n- ElizaOS is confirmed to be an open-source project with resources available at eliza.how and GitHub repositories\n\n### Technical Challenges\n- Multiple users experiencing plugin loading failures, particularly with Farcaster and Bootstrap plugins\n- Entity relationship constraints in SQL causing errors when entities aren't properly stored\n- Twitter/X integration issues including scheduling posts and handling replies without threading\n- Local AI model configuration with Ollama showing connection timeout errors\n- Discord integration issues, particularly with formatting responses as replies\n- v2-develop branch challenges including character definition problems and frontend display issues\n\n### AI Agent Applications & Monetization\n- Discussion about potential monetization strategies for AI agents, including subscription models vs. token-based access\n- Reference to terminal.cookie.fun using AI agents for trading analysis\n- Suggestions for AI applications in financial analysis, particularly SEC filing analysis\n- Limitations of AI in determining sentiment were discussed\n\n### Community Concerns\n- Some community members expressed frustration about a DOOD token airdrop allocation process\n- Discussion about cryptocurrency tokens including eli5, squid, and autofun, with brief mentions of market performance\n\n## Key Questions & Answers\n\n**Q: What happened to eliza.how? Is it not working anymore?**  \nA: It works (answered by Osint)\n\n**Q: Can someone share resource(s) where I can learn the scope of the character file for ElizaOS agent?**  \nA: https://eliza.how and https://github.com/elizaOS/characterfile (answered by Osint)\n\n**Q: Shaw has recently mentioned on v2 release as this week or next week…do team have further update or clarity on this?**  \nA: We'll update when we have the release ready (answered by Kenk)\n\n**Q: How is v2 going?**  \nA: You can always go and check in github at https://github.com/elizaos/eliza (answered by Osint)\n\n**Q: How can I make Twitter replies use single tweets instead of threads?**  \nA: Have it a try, should not use threads (answered by der.jogi)\n\n**Q: How does tweet scheduling work in ElizaOS?**  \nA: Set both TWITTER_POST_INTERVAL_MIN and TWITTER_POST_INTERVAL_MAX to the same value for consistent timing (answered by der.jogi)\n\n## Community Help & Collaboration\n\n1. **Character File Resources**\n   - Osint provided GitHub links to character file repository and eliza.how website to help Tahlil learn about character files for ElizaOS agents\n\n2. **Token Allocation Support**\n   - jasyn_bjorn offered to give their own DOOD token allocation to sukrucildirr who was upset about missing the allocation\n\n3. **Twitter Configuration Assistance**\n   - der.jogi shared solutions for tweet scheduling timing issues and avoiding threading in replies\n   - der.jogi shared GitHub links to client and server socket implementation code for WebSocket endpoint questions\n\n4. **Project Perspective**\n   - MDMnvest provided perspective to Xyness that Autofun is in early days and needs time to grow as success stories emerge\n\n## Action Items\n\n### Technical\n- Fix Farcaster plugin loading failures - resolve module loading strategies for @Eliza#3900os/plugin-farcaster (mentioned by thescoho)\n- Fix entity relationship constraints - ensure entities are stored before creating relationships (mentioned by der.jogi)\n- Resolve Ollama connection timeout errors - fix \"Headers Timeout Error\" when connecting to local Ollama instance (mentioned by der.jogi)\n- Fix Bootstrap plugin loading failure - resolve module loading strategies for @elizaos/plugin-bootstrap (mentioned by der.jogi)\n- Fix Twitter mention response functionality - agent not responding to Twitter mentions despite successful tweeting (mentioned by der.jogi)\n- Fix character definition display in v2-develop - character definitions not showing correctly in frontend (mentioned by der.jogi)\n- Fix cross-posting between Twitter and Discord - enable forwarding matching tweets to Discord channels (mentioned by der.jogi)\n- Fix local AI model initialization hanging - system gets stuck after model path validation (mentioned by starlord)\n- Check GitHub repository for ElizaOS v2 development progress (mentioned by Osint)\n\n### Documentation\n- Update Twitter agent guide for v2 - current guide doesn't work properly with v2-develop branch (mentioned by der.jogi)\n\n### Feature\n- Create LinkedIn plugin for ElizaOS - add LinkedIn integration capabilities (mentioned by der.jogi)\n- Consider releasing Elizav2 while market conditions are favorable (mentioned by ryanthelad)\n- Consider monetization strategies for AI agents - subscription models vs. token-based access (mentioned by Osint)\n- Explore AI agent applications for financial analysis - potential for AI to analyze SEC filings and financial data (mentioned by The Prophet)"
        },
        {
          "filename": "2025-05-12.md",
          "content": "# elizaOS Discord - 2025-05-12\n\n## Overall Discussion Highlights\n\n### Technical Issues & Development\n- **Knowledge Import Functionality**: Users reported that string-based knowledge imports work successfully, but file path and directory references fail despite setting `ragKnowledge: true` in the Eliza OS platform.\n- **Discord Integration Challenges**: Several users discussed difficulties with Discord plugin functionality, particularly getting proper @username mentions with notifications working correctly.\n- **Ollama Configuration**: Users discovered they need to explicitly add `@elizaos/plugins-ollama` to their character file rather than relying on environment variables alone to prevent unnecessary node-llama-cpp installation.\n- **Video Generation**: Videos generated by agents save to cache but may not display properly in the GUI, creating usability issues.\n- **Fee Collection Issue**: A technical issue with fee collection on auto.fun was reported and subsequently fixed by the team overnight.\n\n### Token Discussions\n- **Dood Token Distribution**: Discussions about eligibility for Dood tokens, with clarification that the Dood team airdropped to holders individually rather than through the elizaOS team directly.\n- **ELI5 Token Development**: Community members debated the potential of ELI5 as an AI education tool that could explain concepts simply to users, with proposals for community pages, Twitter accounts, and Reddit integration.\n- **Auto.fun Platform Strategy**: Ongoing discussion about auto.fun's positioning as an AI-focused launchpad with verified teams versus competitors, with suggestions to pivot toward being a launchpad for startups rather than memes.\n\n### Community Management\n- **Discord Scammer Report**: A user reported a Discord scammer, which was promptly addressed by a moderator.\n- **Channel Moderation**: Off-topic discussions about market conditions and cryptocurrency prices were redirected to appropriate channels by moderators.\n\n## Key Questions & Answers\n\n- **Q**: Why didn't I receive Dood tokens? (asked by sukrucildirr)  \n  **A**: \"If you haven't had any Dood sent you weren't eligible\" (answered by Kenk)\n\n- **Q**: How will Dood tokens be distributed without collecting addresses? (asked by sukrucildirr)  \n  **A**: \"The dood team airdropped our holders individually, not the team directly ser\" (answered by jasyn_bjorn)\n\n- **Q**: Where or what channel can we use to report discord scammer? (asked by Die Antwoord)  \n  **A**: \"Here\" (answered by Osint)\n\n- **Q**: Is \"@elizaos/plugin-direct\" deprecated? Can't understand why it's stopping character from loading. (asked by techcomthanh)  \n  **A**: \"You don't need that\" (answered by techcomthanh)\n\n- **Q**: Will there be a launch today? (asked by r)  \n  **A**: \"Nope no launch today\" (answered by noj)\n\n- **Q**: Is there a launch today? (asked by velja)  \n  **A**: \"No idea\" (answered by Kenk)\n\n## Community Help & Collaboration\n\n1. **Discord Scammer Report**\n   - **Helper**: Osint (aka not_a_dev_ai)\n   - **Helpee**: Die Antwoord\n   - **Context**: Reporting a Discord scammer with user_id: 1331066099864829964\n   - **Resolution**: \"Taken care of, thank you for the report\"\n\n2. **Ollama Configuration Support**\n   - **Helper**: techcomthanh\n   - **Helpee**: techcomthanh (self-help shared with community)\n   - **Context**: Ollama configuration causing node-llama-cpp installation despite using remote resource\n   - **Resolution**: Explained need to add `@elizaos/plugins-ollama` to character file in addition to environment variables\n\n3. **Fee Collection Issue Resolution**\n   - **Helper**: Kenk\n   - **Helpee**: gummy\n   - **Context**: Issue with collecting fees on auto.fun\n   - **Resolution**: Team pushed a fix overnight and confirmed it was working after user tested again\n\n4. **ELI5 Community Development**\n   - **Helper**: gummy\n   - **Helpee**: Community\n   - **Context**: Proposing to create ELI5 community page and X communities\n   - **Resolution**: Kenk approved the idea and gummy committed to setting up X communities\n\n## Action Items\n\n### Technical\n- Fix knowledge import functionality for file paths and directories in beta 49 (Mentioned by techcomthanh)\n- Fix Discord @username mentions to properly highlight and send notifications (Mentioned by techcomthanh)\n- Improve video display in GUI for videos generated by agents (Mentioned by techcomthanh)\n- Resolve issue with node-llama-cpp installation when using remote Ollama endpoint (Mentioned by techcomthanh)\n- Fix fee collection issue on auto.fun (Mentioned by Kenk)\n- Create ELI5 Twitter account that replies to questions with simple explanations (Mentioned by gummy)\n- Integrate ELI5 agent with Reddit community (Mentioned by ryanthelad)\n\n### Documentation\n- Provide sample files and code examples for knowledge import from files (Mentioned by techcomthanh)\n- Clarify Ollama plugin setup requirements in documentation (Mentioned by techcomthanh)\n- Document how to build tweet threads with agent-twitter-client repo (Mentioned by Bitcoin Broccoli)\n- Clarify Dood token distribution eligibility criteria (Mentioned by sukrucildirr)\n\n### Feature\n- Create ELI5 community page or main page (Mentioned by gummy)\n- Set up X communities for ELI5 (Mentioned by gummy)\n- Fix token locked chat for ELI5 on website (Mentioned by ryanthelad)\n- Pivot auto.fun to be leading launchpad for startups instead of memes (Mentioned by wire)"
        }
      ],
      "dev_md_last_3_days": [
        {
          "filename": "2025-05-13.md",
          "content": "# elizaOS Development Discord - 2025-05-13\n\n## Overall Discussion Highlights\n\n### Knowledge Integration in Character Files\n- Discussions focused on how to properly reference knowledge files in character.json\n- Paths are relative to the characters/knowledge directory\n- RAG (Retrieval-Augmented Generation) knowledge works by setting \"ragknowledge: true\" in character settings\n- Users explored the codebase, specifically examining how knowledge is processed through ragknowledge.ts\n- Version differences between v1 and v2 of the Eliza codebase were mentioned, with a link to the v2-develop branch\n\n### Plugin Development\n- Plugins have been moved to a separate repository (elizaos-plugins)\n- Question raised about LinkedIn plugin availability for Eliza\n- GitHub link shared: https://github.com/elizaos-plugins\n\n### Community Guidelines\n- Ruby expressed disinterest in providing feedback on gambling or token projects\n- Preference stated for building useful tools rather than enabling speculation\n- Some promotional messages from freelancers were flagged as potential spam\n\n## Key Questions & Answers\n\n**Q: How does knowledge work in character files and what is the path relative to?** (asked by LemonS)  \n**A:** The path specified in character.json is relative to characters/knowledge directory, and you can't use \"./\" or \"../\" (answered by Nooters)\n\n**Q: Is there an example of character JSON files referencing a knowledge path?** (asked by DorianD)  \n**A:** Core/runtime reads what's defined in knowledge, which can be a path, array or similar (answered by 0xbbjoker)\n\n**Q: Where are the plugins now that they've been moved out of the core repo?** (asked by DorianD)  \n**A:** https://github.com/elizaos-plugins (answered by shaw)\n\n## Community Help & Collaboration\n\n1. **Knowledge Path Implementation**\n   - Nooters helped LemonS understand how knowledge paths work in character files\n   - Explained directory structure and provided guidance on relative paths\n\n2. **RAG Knowledge Configuration**\n   - 0xbbjoker assisted DorianD in understanding RAG knowledge implementation\n   - Explained the need to set \"ragknowledge: true\" in settings and add paths to files\n\n3. **Plugin Repository Location**\n   - shaw directed DorianD to the new elizaos-plugins repository\n   - Provided the GitHub link to help locate moved plugins\n\n4. **Knowledge Implementation Exploration**\n   - DorianD investigated the codebase and found relevant code in ragknowledge.ts\n   - Shared findings about how knowledge processing is handled\n\n## Action Items\n\n### Technical\n- **Implement proper knowledge file referencing in character.json files** (Mentioned by Nooters)\n  - Ensure paths are relative to characters/knowledge directory\n\n### Feature\n- **LinkedIn plugin for Eliza** (Mentioned by aith)\n  - Create a LinkedIn plugin similar to existing Twitter plugin\n\n### Documentation\n- **Document the knowledge referencing system** (Mentioned by DorianD)\n  - Create clear documentation on how to properly reference knowledge files in character.json"
        },
        {
          "filename": "2025-05-12.md",
          "content": "# elizaOS Development Discord - 2025-05-12\n\n## Overall Discussion Highlights\n\n### Character Configuration & Development\n- Discussion about referencing one character file from another (e.g., importing woman.character.json into eliza.character.json)\n- Detailed troubleshooting of character.json configuration issues in v2, including voice settings and knowledge directory paths\n- Recommendation to keep a minimal approach when starting with character configurations before adding complexity\n\n### Tools & Integrations\n- Interest in news integration capabilities for agents, with suggestion to build an RSS plugin\n- Introduction of Screenpipe (https://screenpi.pe/), a tool for recording screen activity that can be used for AI training\n- Discussion about potential plugin development for Screenpipe\n\n### System Architecture & Security\n- Emphasis on proper credential management, keeping sensitive information in .env files rather than character configurations\n- Clarification on the differences between CLI and manual workflows in v2, noting that CLI has its own mental model\n\n## Key Questions & Answers\n\n**Q: Has anyone done something like have a main character file reference/import another character file?**  \nA: Self-answered that it would require modifying the runtime that reads the JSON files (DorianD)\n\n**Q: Is there a plugin to get the latest news and add it as knowledge into the agent? Like News API connection?**  \nA: Build an RSS plugin (sayonara)\n\n**Q: Does anyone have a link to the online Eliza Helper Bot interface?**  \nA: The helper bot interface was deprecated a while back - the new v2 workflow is more flexible but has a steeper learning curve. (Ruby)\n\n**Q: Why doesn't the template include info for the OpenAI key? What LLM backend would it use?**  \nA: The OpenAI key and LLM settings go in your .env file or environment variables. The default backend is gpt-4 but you can override that in your project's main config. (Ruby)\n\n**Q: Should the Supabase keys also be put into the .env file and kept out of the character JSON? What's the format?**  \nA: Yes! Definitely keep those keys in .env - never in the character json. The format is simple: SUPABASE_URL=your_url_here SUPABASE_ANON_KEY=your_key_here (Ruby)\n\n## Community Help & Collaboration\n\n- **Ruby helped Hidden Forces** with character.json configuration issues, providing a simplified template and explaining the proper way to manage credentials\n- **Ruby clarified** the conceptual differences between CLI and manual workflows in v2, explaining that CLI isn't just an automated version of manual steps\n- **sayonara suggested** building an RSS plugin to Titan who was looking for news integration capabilities\n- **Terexitarius shared** Screenpipe tool with the community, suggesting it might be useful for personal knowledge management and AI training\n\n## Action Items\n\n### Technical\n- Build an RSS plugin for news integration with agents (mentioned by sayonara)\n- Fix character.json configuration issues including voice model/url values and knowledge directory path (mentioned by Ruby)\n- Address privacy concerns in screen recording with selective capture or data retention policies for Screenpipe (mentioned by Ruby)\n- Potential EVM chains support for an unspecified project (mentioned by Terexitarius)\n\n### Documentation\n- Improve documentation on differences between manual work and CLI in v2 (mentioned by Hidden Forces)\n- Create a guide on key differences between CLI and manual approaches (mentioned by Ruby)\n\n### Feature\n- Character file import system to allow referencing one character file from another (mentioned by DorianD)\n- News integration plugin to get latest news and add it as knowledge into agents (mentioned by Titan)\n- Potential Screenpipe plugin development for the screen recording tool (mentioned by Terexitarius)"
        }
      ]
    }
  },
  "github": {
    "summaries": {
      "week": [
        {
          "filename": "2025-05-11.md",
          "content": "# ElizaOS Weekly Update (May 11 - 17, 2025)\n\n## OVERVIEW\nThis week saw significant improvements to the ElizaOS framework with a focus on enhancing CLI functionality, fixing critical bugs in plugins, and improving the developer experience. The team made substantial progress on the Jimmy project manager agent, implemented better error handling across multiple plugins, and addressed several Unicode and serialization issues. Infrastructure improvements included better caching mechanisms and more consistent environment variable handling.\n\n## KEY TECHNICAL DEVELOPMENTS\n\n### CLI and Agent Improvements\n- Enhanced the `elizaos agent` CLI command with fixes for JSON output and file saving options in [#4560](https://github.com/elizaos/eliza/pull/4560)\n- Added support for third-party plugin installation with improved testing in [#4568](https://github.com/elizaos/eliza/pull/4568)\n- Implemented the Jimmy project manager agent with Anthropic plugin support in [#4471](https://github.com/elizaos/eliza/pull/4471) and [#4549](https://github.com/elizaos/eliza/pull/4549)\n- Refactored model handling in AgentRuntime to support provider and priority settings in [#4507](https://github.com/elizaos/eliza/pull/4507)\n\n### Plugin System and Database Enhancements\n- Fixed PGLite JSON serialization to handle invalid Unicode escape sequences in [#4458](https://github.com/elizaos/eliza/pull/4458)\n- Improved Twitter plugin with better error handling and configurable retry settings in [#4506](https://github.com/elizaos/eliza/pull/4506)\n- Fixed Discord plugin build issues after merge conflicts in [#4552](https://github.com/elizaos/eliza/pull/4552)\n- Enhanced Telegram plugin with strict typing and improved error handling in [#4559](https://github.com/elizaos/eliza/pull/4559)\n- Addressed PGLite migration issues in [#4532](https://github.com/elizaos/eliza/pull/4532) and [#4531](https://github.com/elizaos/eliza/pull/4531)\n\n### Infrastructure and Developer Experience\n- Improved CI reliability by adding commit SHA to CLI cache action in [#4571](https://github.com/elizaos/eliza/pull/4571)\n- Enhanced TEE (Trusted Execution Environment) support for CI in [#4572](https://github.com/elizaos/eliza/pull/4572)\n- Disabled loading instrumentation when not enabled to reduce startup logs in [#4530](https://github.com/elizaos/eliza/pull/4530)\n- Replaced REST ping with WebSocket status checks for more responsive client connections in [#4551](https://github.com/elizaos/eliza/pull/4551)\n- Enforced TypeScript in CLI and plugin-sql packages, fixing missing DB functions in [#4529](https://github.com/elizaos/eliza/pull/4529)\n\n## CLOSED ISSUES\n\n### Plugin Compatibility and Documentation\n- Resolved Twitter interaction reactions implementation issue in [#4181](https://github.com/elizaos/eliza/issues/4181)\n- Fixed Twitter space functionality problems in [#4180](https://github.com/elizaos/eliza/issues/4180)\n- Addressed the need to clearly mark or remove plugins not compatible with Eliza v2 in [#4164](https://github.com/elizaos/eliza/issues/4164)\n- Fixed documentation in the \"Building a Social AI Agent in 15 Minutes\" tutorial in [#3880](https://github.com/elizaos/eliza/issues/3880)\n\n### Community and Miscellaneous\n- Closed job posting for Eliza framework developer in [#4432](https://github.com/elizaos/eliza/issues/4432)\n- Resolved PGLite log entry Unicode escape error in [#4457](https://github.com/elizaos/eliza/issues/4457)\n\n## NEW ISSUES\n\n### TEE and Installation Improvements\n- Need to improve Eliza in TEE Oasis with support for custom installations and streamlined local builds in [#4528](https://github.com/elizaos/eliza/issues/4528)\n\n### Package and Dependency Management\n- Module resolution error for '@elizaos/core' reported in [#4536](https://github.com/elizaos/eliza/issues/4536)\n- Request to publish to npm to resolve zod dependency conflicts in [#4562](https://github.com/elizaos/eliza/issues/4562)\n\n### Documentation and CI\n- Missing path for internationalized documentation in [#4565](https://github.com/elizaos/eliza/issues/4565)\n- CI activity error reported in [#4561](https://github.com/elizaos/eliza/issues/4561)"
        }
      ],
      "month": [
        {
          "filename": "2025-05-01.md",
          "content": "# ElizaOS Monthly Update (May 2025)\n\n## OVERVIEW\nMay was a transformative month for ElizaOS, with significant advancements in the framework's core architecture and plugin ecosystem. The team focused on enhancing the CLI experience, improving plugin management, and strengthening the framework's reliability. Major strides were made in refactoring the codebase for better maintainability, fixing critical bugs, and streamlining the developer experience across both Web2 and Web3 integrations.\n\n## KEY TECHNICAL DEVELOPMENTS\n\n### CLI Enhancements\n- Improved the CLI publishing workflow with unified pipeline for plugins and projects ([#4424](https://github.com/elizaos/eliza/pull/4424))\n- Enhanced environment information system for better diagnostics ([#4445](https://github.com/elizaos/eliza/pull/4445))\n- Fixed incorrect version detection to show proper latest CLI version ([#4435](https://github.com/elizaos/eliza/pull/4435))\n- Added support for third-party plugin installation with tests ([#4568](https://github.com/elizaos/eliza/pull/4568))\n\n### Plugin System Improvements\n- Prepared version 0.x for sharing plugins with 1.x ([#4384](https://github.com/elizaos/eliza/pull/4384))\n- Enhanced plugin loading with better error handling and logging ([#4478](https://github.com/elizaos/eliza/pull/4478))\n- Fixed plugin installation command and startup process ([#4456](https://github.com/elizaos/eliza/pull/4456))\n- Made plugin routes work properly ([#4415](https://github.com/elizaos/eliza/pull/4415))\n\n### Authentication & Security\n- Added authentication middleware and API key dialog for unauthorized access ([#4420](https://github.com/elizaos/eliza/pull/4420))\n- Improved error handling and logging in the bootstrap plugin ([#4548](https://github.com/elizaos/eliza/pull/4548))\n\n### Database & Storage Improvements\n- Implemented unique PGLite folder creation if not provided ([#4423](https://github.com/elizaos/eliza/pull/4423))\n- Fixed PGLite directory configuration ([#4497](https://github.com/elizaos/eliza/pull/4497))\n- Enhanced database migrations ([#4532](https://github.com/elizaos/eliza/pull/4532))\n- Added proper database connection handling ([#4529](https://github.com/elizaos/eliza/pull/4529))\n\n### AI Model Handling\n- Extended OpenAI plugin to support custom embedding endpoints ([#4421](https://github.com/elizaos/eliza/pull/4421))\n- Optimized reply functionality to use small model for better performance ([#4416](https://github.com/elizaos/eliza/pull/4416))\n- Added model usage events for embeddings and image description ([#4438](https://github.com/elizaos/eliza/pull/4438))\n- Refactored model handling in AgentRuntime to support provider and priority ([#4507](https://github.com/elizaos/eliza/pull/4507))\n\n### Social Media Integration\n- Implemented Twitter timeline functionality ([#4429](https://github.com/elizaos/eliza/pull/4429))\n- Added comprehensive tutorial for Twitter AI agent setup ([#4425](https://github.com/elizaos/eliza/pull/4425))\n- Fixed and improved Twitter plugin ([#4506](https://github.com/elizaos/eliza/pull/4506))\n- Enhanced message handling with better text escaping ([#4508](https://github.com/elizaos/eliza/pull/4508))\n\n### Documentation & Developer Experience\n- Added docstrings to multiple components ([#4446](https://github.com/elizaos/eliza/pull/4446), [#4469](https://github.com/elizaos/eliza/pull/4469), [#4498](https://github.com/elizaos/eliza/pull/4498))\n- Updated documentation to prefer direct usage instead of npx ([#4493](https://github.com/elizaos/eliza/pull/4493))\n- Fixed broken documentation links ([#4460](https://github.com/elizaos/eliza/pull/4460))\n- Updated CLI command documentation ([#4448](https://github.com/elizaos/eliza/pull/4448))\n\n### Performance & Optimization\n- Implemented faster agent loading when dealing with many agents ([#4519](https://github.com/elizaos/eliza/pull/4519))\n- Fixed client scroll bars for better UI experience ([#4465](https://github.com/elizaos/eliza/pull/4465))\n- Improved semantic text splitting for better RAG knowledge retrieval ([#4235](https://github.com/elizaos/eliza/pull/4235))\n- Added API and client hooks to wipe all memories in a single request ([#4467](https://github.com/elizaos/eliza/pull/4467))\n\n## CLOSED ISSUES\n\n### Twitter Integration Issues\n- Fixed issues with Twitter interactions and reactions implementation ([#4181](https://github.com/elizaos/eliza/issues/4181))\n- Resolved Twitter space functionality problems ([#4180](https://github.com/elizaos/eliza/issues/4180))\n- Addressed issues with Twitter agent not replying to target accounts ([#4054](https://github.com/elizaos/eliza/issues/4054))\n- Fixed raw newline characters appearing in tweets ([#3972](https://github.com/elizaos/eliza/issues/3972))\n\n### CLI and Installation Problems\n- Resolved CLI creation errors ([#4107](https://github.com/elizaos/eliza/issues/4107))\n- Fixed Windows build issues ([#4094](https://github.com/elizaos/eliza/issues/4094))\n- Improved remote debugging capabilities ([#3978](https://github.com/elizaos/eliza/issues/3978))\n\n### Documentation and Tutorials\n- Updated outdated tutorial content ([#3880](https://github.com/elizaos/eliza/issues/3880))\n- Fixed missing context in autodoc file usage documentation ([#3912](https://github.com/elizaos/eliza/issues/3912))\n\n### Plugin Compatibility\n- Addressed confusion around plugins not yet compatible with Eliza v2 ([#4164](https://github.com/elizaos/eliza/issues/4164))\n\n### Integration Issues\n- Fixed Discord message disappearance problems ([#3952](https://github.com/elizaos/eliza/issues/3952))\n- Resolved Anthropic API key errors ([#4049](https://github.com/elizaos/eliza/issues/4049))\n- Added capability to block interactions with specific accounts ([#4117](https://github.com/elizaos/eliza/issues/4117))\n\n## NEW ISSUES\n\n### API and Integration Challenges\n- Handler not found for TEXT_EMBEDDING with OpenAI ([#4418](https://github.com/elizaos/eliza/issues/4418))\n- Missing 'preconnect' property in type definition ([#4440](https://github.com/elizaos/eliza/issues/4440))\n- PGLite log entry Unicode escape error ([#4457](https://github.com/elizaos/eliza/issues/4457))\n- Discord autoPost setting not implemented in v2 ([#4461](https://github.com/elizaos/eliza/issues/4461))\n\n### Configuration and Deployment Issues\n- Agent hanging after core initialization with Anthropic and Twitter config ([#4486](https://github.com/elizaos/eliza/issues/4486))\n- Need for improved Eliza in TEE oasis support ([#4528](https://github.com/elizaos/eliza/issues/4528))\n- Request for Ollama support ([#4503](https://github.com/elizaos/eliza/issues/4503))\n\n### Module and Dependency Problems\n- Cannot find module '@elizaos/core' or its corresponding type declarations ([#4536](https://github.com/elizaos/eliza/issues/4536))\n- Missing"
        }
      ]
    }
  }
}
