{
  "ai-news": {
    "elizaos": {
      "discord_md_last_3_days": [
        {
          "filename": "2025-05-12.md",
          "content": "# elizaOS Discord - 2025-05-12\n\n## Overall Discussion Highlights\n\n### Technical Issues & Development\n- **Knowledge Import Functionality**: Users reported that string-based knowledge imports work successfully, but file path and directory references fail despite setting `ragKnowledge: true` in the Eliza OS platform.\n- **Discord Integration Challenges**: Several users discussed difficulties with Discord plugin functionality, particularly getting proper @username mentions with notifications working correctly.\n- **Ollama Configuration**: Users discovered they need to explicitly add `@elizaos/plugins-ollama` to their character file rather than relying on environment variables alone to prevent unnecessary node-llama-cpp installation.\n- **Video Generation**: Videos generated by agents save to cache but may not display properly in the GUI, creating usability issues.\n- **Fee Collection Issue**: A technical issue with fee collection on auto.fun was reported and subsequently fixed by the team overnight.\n\n### Token Discussions\n- **Dood Token Distribution**: Discussions about eligibility for Dood tokens, with clarification that the Dood team airdropped to holders individually rather than through the elizaOS team directly.\n- **ELI5 Token Development**: Community members debated the potential of ELI5 as an AI education tool that could explain concepts simply to users, with proposals for community pages, Twitter accounts, and Reddit integration.\n- **Auto.fun Platform Strategy**: Ongoing discussion about auto.fun's positioning as an AI-focused launchpad with verified teams versus competitors, with suggestions to pivot toward being a launchpad for startups rather than memes.\n\n### Community Management\n- **Discord Scammer Report**: A user reported a Discord scammer, which was promptly addressed by a moderator.\n- **Channel Moderation**: Off-topic discussions about market conditions and cryptocurrency prices were redirected to appropriate channels by moderators.\n\n## Key Questions & Answers\n\n- **Q**: Why didn't I receive Dood tokens? (asked by sukrucildirr)  \n  **A**: \"If you haven't had any Dood sent you weren't eligible\" (answered by Kenk)\n\n- **Q**: How will Dood tokens be distributed without collecting addresses? (asked by sukrucildirr)  \n  **A**: \"The dood team airdropped our holders individually, not the team directly ser\" (answered by jasyn_bjorn)\n\n- **Q**: Where or what channel can we use to report discord scammer? (asked by Die Antwoord)  \n  **A**: \"Here\" (answered by Osint)\n\n- **Q**: Is \"@elizaos/plugin-direct\" deprecated? Can't understand why it's stopping character from loading. (asked by techcomthanh)  \n  **A**: \"You don't need that\" (answered by techcomthanh)\n\n- **Q**: Will there be a launch today? (asked by r)  \n  **A**: \"Nope no launch today\" (answered by noj)\n\n- **Q**: Is there a launch today? (asked by velja)  \n  **A**: \"No idea\" (answered by Kenk)\n\n## Community Help & Collaboration\n\n1. **Discord Scammer Report**\n   - **Helper**: Osint (aka not_a_dev_ai)\n   - **Helpee**: Die Antwoord\n   - **Context**: Reporting a Discord scammer with user_id: 1331066099864829964\n   - **Resolution**: \"Taken care of, thank you for the report\"\n\n2. **Ollama Configuration Support**\n   - **Helper**: techcomthanh\n   - **Helpee**: techcomthanh (self-help shared with community)\n   - **Context**: Ollama configuration causing node-llama-cpp installation despite using remote resource\n   - **Resolution**: Explained need to add `@elizaos/plugins-ollama` to character file in addition to environment variables\n\n3. **Fee Collection Issue Resolution**\n   - **Helper**: Kenk\n   - **Helpee**: gummy\n   - **Context**: Issue with collecting fees on auto.fun\n   - **Resolution**: Team pushed a fix overnight and confirmed it was working after user tested again\n\n4. **ELI5 Community Development**\n   - **Helper**: gummy\n   - **Helpee**: Community\n   - **Context**: Proposing to create ELI5 community page and X communities\n   - **Resolution**: Kenk approved the idea and gummy committed to setting up X communities\n\n## Action Items\n\n### Technical\n- Fix knowledge import functionality for file paths and directories in beta 49 (Mentioned by techcomthanh)\n- Fix Discord @username mentions to properly highlight and send notifications (Mentioned by techcomthanh)\n- Improve video display in GUI for videos generated by agents (Mentioned by techcomthanh)\n- Resolve issue with node-llama-cpp installation when using remote Ollama endpoint (Mentioned by techcomthanh)\n- Fix fee collection issue on auto.fun (Mentioned by Kenk)\n- Create ELI5 Twitter account that replies to questions with simple explanations (Mentioned by gummy)\n- Integrate ELI5 agent with Reddit community (Mentioned by ryanthelad)\n\n### Documentation\n- Provide sample files and code examples for knowledge import from files (Mentioned by techcomthanh)\n- Clarify Ollama plugin setup requirements in documentation (Mentioned by techcomthanh)\n- Document how to build tweet threads with agent-twitter-client repo (Mentioned by Bitcoin Broccoli)\n- Clarify Dood token distribution eligibility criteria (Mentioned by sukrucildirr)\n\n### Feature\n- Create ELI5 community page or main page (Mentioned by gummy)\n- Set up X communities for ELI5 (Mentioned by gummy)\n- Fix token locked chat for ELI5 on website (Mentioned by ryanthelad)\n- Pivot auto.fun to be leading launchpad for startups instead of memes (Mentioned by wire)"
        },
        {
          "filename": "2025-05-11.md",
          "content": "# elizaOS Discord - 2025-05-11\n\n## Overall Discussion Highlights\n\n### Development & Technical Issues\n- Several users reported issues with the Eliza agent setup, particularly around environment configuration and plugin integration\n- Problems with API connectivity in WSL2 were discussed, where Postman requests worked but backend-to-backend calls failed with 502 errors\n- Users encountered challenges with local AI models being downloaded despite environment settings to use external models\n- Plugin installation and build errors were reported, particularly with the Twitter plugin\n- Discord integration configuration problems were mentioned by multiple users\n\n### Community & Project Updates\n- The team is seeking beta testers for an unspecified project\n- Shaw mentioned challenges with collecting contributor wallet addresses for a potential airdrop\n- There's ongoing work on tooling to better collect contributor wallets in the future\n- A request for Rust developers was posted\n\n### Cryptocurrency Discussions\n- Users discussed price movements of tokens like COM and ELI5 on the auto.fun platform\n- COM reportedly reached all-time highs due to promotion by an influencer with 50,000 followers\n- Nick dask advised taking profits at the all-time high, warning about potential retracement\n- Discussion about a potential community meme launch on autofun, with wire offering to lead it with a team of artists\n- User \"gummy\" reported issues with claiming fees from dev wallet creation\n\n## Key Questions & Answers\n\n**Q: Any news about DOOD airdrop?**  \nA: \"I have no idea about dood airdrop tbh\" (Osint) and \"i have no info on the airdrop though, sorry\" (shaw)\n\n**Q: How to install the new version of eliza on windows?**  \nA: WSL is recommended (Deniz)\n\n**Q: How can I use LLM from OpenAI or grok instead of llama?**  \nA: modelProvider is no longer used in newer versions, you need to set all required values in .env file and include the plugins in your characterfile (scooter8992)\n\n**Q: Does anyone know why COM is running?**  \nA: Because a KOL (key opinion leader) with 50k followers called it. (Nick dask)\n\n**Q: Who is launching today?**  \nA: It's the weekend. (Osint)\n\n## Community Help & Collaboration\n\n1. **Environment Configuration Help**\n   - **Helper:** scooter8992\n   - **Helpee:** pupathebig\n   - **Context:** Twitter plugin not respecting TWITTER_DRY_RUN=true setting\n   - **Resolution:** Suggested adding LOG_LEVEL=debug to .env and checking Discord gateway intents\n\n2. **Discord Integration Debugging**\n   - **Helper:** scooter8992\n   - **Helpee:** scooter8992\n   - **Context:** Discord client not loading when agent starts\n   - **Resolution:** Suggested adding runtime event listener code to debug Discord connection\n\n3. **Proper Configuration File Placement**\n   - **Helper:** scooter8992\n   - **Helpee:** scooter8992\n   - **Context:** Proper .env file placement\n   - **Resolution:** Clarified that .env should be in the root folder, which improved CLI output\n\n4. **Airdrop Wallet Collection Explanation**\n   - **Helper:** shaw\n   - **Helpee:** sukrucildirr\n   - **Context:** Explaining the situation with wallet collection for airdrops\n   - **Resolution:** Explained they asked for wallets last minute and are working on tooling for future wallet collection\n\n5. **Cryptocurrency Trading Advice**\n   - **Helper:** Nick dask\n   - **Helpee:** hxf\n   - **Context:** hxf asked why COM token was running in price\n   - **Resolution:** Nick explained it was due to a key opinion leader with 50k followers promoting it, and warned about potential manipulation due to 60% being held by one holder\n\n## Action Items\n\n### Technical\n- Fix Twitter plugin to properly respect TWITTER_DRY_RUN=true setting (mentioned by pupathebig)\n- Investigate 502 error when backend service calls Eliza API while Postman works (mentioned by scooter8992)\n- Fix issue with local models being downloaded despite configuration for external models (mentioned by scooter8992)\n- Fix plugin build error: \"Module '@elizaos/core-plugin-v1' has no exported member 'Plugin'\" (mentioned by pupathebig)\n- Fix issue with claiming fees from dev wallet creation (mentioned by gummy)\n- Working on tooling to collect contributor wallets (mentioned by shaw)\n\n### Documentation\n- Create guide for proper environment configuration to use external models instead of local ones (mentioned by scooter8992)\n- Document global configuration file location and purpose (mentioned by scooter8992)\n\n### Feature\n- Implement option to restrict Twitter bot to only post and reply to tagged messages (mentioned by Sthx)\n- Beta testers recruitment for an unspecified project (mentioned by Blazo101)\n- Organize a community meme launch on autofun with a team of artists (mentioned by wire)"
        }
      ],
      "dev_md_last_3_days": [
        {
          "filename": "2025-05-12.md",
          "content": "# elizaOS Development Discord - 2025-05-12\n\n## Overall Discussion Highlights\n\n### Character Configuration & Development\n- Discussion about referencing one character file from another (e.g., importing woman.character.json into eliza.character.json)\n- Detailed troubleshooting of character.json configuration issues in v2, including voice settings and knowledge directory paths\n- Recommendation to keep a minimal approach when starting with character configurations before adding complexity\n\n### Tools & Integrations\n- Interest in news integration capabilities for agents, with suggestion to build an RSS plugin\n- Introduction of Screenpipe (https://screenpi.pe/), a tool for recording screen activity that can be used for AI training\n- Discussion about potential plugin development for Screenpipe\n\n### System Architecture & Security\n- Emphasis on proper credential management, keeping sensitive information in .env files rather than character configurations\n- Clarification on the differences between CLI and manual workflows in v2, noting that CLI has its own mental model\n\n## Key Questions & Answers\n\n**Q: Has anyone done something like have a main character file reference/import another character file?**  \nA: Self-answered that it would require modifying the runtime that reads the JSON files (DorianD)\n\n**Q: Is there a plugin to get the latest news and add it as knowledge into the agent? Like News API connection?**  \nA: Build an RSS plugin (sayonara)\n\n**Q: Does anyone have a link to the online Eliza Helper Bot interface?**  \nA: The helper bot interface was deprecated a while back - the new v2 workflow is more flexible but has a steeper learning curve. (Ruby)\n\n**Q: Why doesn't the template include info for the OpenAI key? What LLM backend would it use?**  \nA: The OpenAI key and LLM settings go in your .env file or environment variables. The default backend is gpt-4 but you can override that in your project's main config. (Ruby)\n\n**Q: Should the Supabase keys also be put into the .env file and kept out of the character JSON? What's the format?**  \nA: Yes! Definitely keep those keys in .env - never in the character json. The format is simple: SUPABASE_URL=your_url_here SUPABASE_ANON_KEY=your_key_here (Ruby)\n\n## Community Help & Collaboration\n\n- **Ruby helped Hidden Forces** with character.json configuration issues, providing a simplified template and explaining the proper way to manage credentials\n- **Ruby clarified** the conceptual differences between CLI and manual workflows in v2, explaining that CLI isn't just an automated version of manual steps\n- **sayonara suggested** building an RSS plugin to Titan who was looking for news integration capabilities\n- **Terexitarius shared** Screenpipe tool with the community, suggesting it might be useful for personal knowledge management and AI training\n\n## Action Items\n\n### Technical\n- Build an RSS plugin for news integration with agents (mentioned by sayonara)\n- Fix character.json configuration issues including voice model/url values and knowledge directory path (mentioned by Ruby)\n- Address privacy concerns in screen recording with selective capture or data retention policies for Screenpipe (mentioned by Ruby)\n- Potential EVM chains support for an unspecified project (mentioned by Terexitarius)\n\n### Documentation\n- Improve documentation on differences between manual work and CLI in v2 (mentioned by Hidden Forces)\n- Create a guide on key differences between CLI and manual approaches (mentioned by Ruby)\n\n### Feature\n- Character file import system to allow referencing one character file from another (mentioned by DorianD)\n- News integration plugin to get latest news and add it as knowledge into agents (mentioned by Titan)\n- Potential Screenpipe plugin development for the screen recording tool (mentioned by Terexitarius)"
        },
        {
          "filename": "2025-05-11.md",
          "content": "# elizaOS Development Discord - 2025-05-11\n\n## Overall Discussion Highlights\n\n### Project Announcements\n- User **joaointech** shared their website project called **plinkoincinerator.com** and requested community feedback.\n\n### AI Agent Development\n- Discussion about the **AI Agent Dev School v2** content by Shaw\n- Clarification that the current available video (approximately 1 hour 15 minutes) only covers CLI basics\n- Information that advanced topics like memory systems, multi-agent architectures, and custom plugins are still in development\n- Recommendation to use the **#agent-dev** channel for discussions on advanced features like memory implementations while waiting for official content\n\n## Key Questions & Answers\n\n### AI Agent Dev School Content\n**Q:** Is there only one AI Agent Dev School for v2 by Shaw?  \n**A:** Yes, currently there's just one official dev school program by Shaw, though it's still in development. (answered by Ruby)\n\n**Q:** Are you referring to the new AI Agent Dev School video that's about an hour and 15 minutes long?  \n**A:** Yes, the current video only covers CLI basics, with advanced topics coming soon. (answered by Ruby)\n\n## Community Help & Collaboration\n\n### Agent Development Resources\n- **Ruby** helped **ualp.** by clarifying the status of AI Agent Dev School content and suggesting alternative resources\n- Ruby recommended using the Discord's **#agent-dev** channel for discussions on memory implementations while waiting for the full curriculum\n\n## Action Items\n\n### Technical\n- **Community feedback needed:** for plinkoincinerator.com website (Mentioned by joaointech)\n\n### Documentation\n- **Advanced curriculum:** covering memory systems, multi-agent architectures, and custom plugins (Mentioned by Ruby)\n\n### Feature\n- **Release of advanced AI Agent Dev School content:** beyond CLI basics (Mentioned by Ruby)"
        }
      ]
    }
  },
  "github": {
    "summaries": {
      "week": [
        {
          "filename": "2025-05-11.md",
          "content": "# ElizaOS Weekly Update (Week of May 11, 2025)\n\n## OVERVIEW\nThis week saw significant progress in stabilizing the ElizaOS framework with numerous bug fixes across core components, particularly in PGLite and agent functionality. A new Project Manager agent was introduced, while code quality improved through TypeScript enforcement and refactored model handling.\n\n## PROJECT METRICS\n- PRs: 23 merged PR's, 30 new PRs\n- Issues: 2 new issues, 6 closed issues\n- Unique Contributors: 19\n- Code Changes: +10674/-5324 lines across 125 files\n- Total Commits: 67\n- Most Active Contributors: wtfsayo, yungalgo, ChristopherTrimboli, 0xbbjoker, harperaa\n\n## TOP ISSUES\n\n### Database and Migration Challenges\n- PGLite migration issues required multiple fixes and ultimately removal of problematic migrations [#4531](https://github.com/elizaos/eliza/pull/4531), [#4532](https://github.com/elizaos/eliza/pull/4532)\n- Missing database functions in SQL plugin needed resolution [#4529](https://github.com/elizaos/eliza/pull/4529)\n\n### Agent Runtime and Model Handling\n- TEXT_EMBEDDING error affecting agent functionality [#4336](https://github.com/elizaos/eliza/issues/4336)\n- Environment resolution issues impacting agent operations [#4547](https://github.com/elizaos/eliza/pull/4547)\n- LLM plugin compatibility problems requiring temporary fixes [#4544](https://github.com/elizaos/eliza/pull/4544)\n\n## KEY TECHNICAL DEVELOPMENTS\n\n### Agent Capabilities Enhancement\n- Added new Project Manager agent functionality [#4471](https://github.com/elizaos/eliza/pull/4471)\n- Refactored model handling in AgentRuntime to support provider and priority settings [#4507](https://github.com/elizaos/eliza/pull/4507)\n- Fixed agent response issues and improved logging/tracing in bootstrap plugin [#4548](https://github.com/elizaos/eliza/pull/4548)\n- Resolved TEXT_EMBEDDING error affecting agent functionality [#4537](https://github.com/elizaos/eliza/pull/4537)\n\n### Infrastructure and Stability Improvements\n- Fixed PGLite JSON serialization to handle invalid Unicode escape sequences [#4458](https://github.com/elizaos/eliza/pull/4458)\n- Enforced TypeScript on /cli and /plugin-sql components [#4529](https://github.com/elizaos/eliza/pull/4529)\n- Optimized performance by disabling loading instrumentation when not needed [#4530](https://github.com/elizaos/eliza/pull/4530)\n- Updated dependencies across multiple directories [#4502](https://github.com/elizaos/eliza/pull/4502)\n- Improved environment handling with consistent naming for project manager agent [#4549](https://github.com/elizaos/eliza/pull/4549)"
        }
      ],
      "month": [
        {
          "filename": "2025-05-01.md",
          "content": "# ElizaOS Monthly Update (May 2025)\n\n## OVERVIEW\nMay was focused on performance optimization, plugin architecture improvements, and codebase cleanup. Key achievements include faster agent loading, enhanced OpenAI plugin capabilities, Twitter integration, and significant refactoring of the CLI commands and environment handling.\n\n## PROJECT METRICS\n- PRs: 97 merged PR's, 135 new PRs\n- Issues: 9 new issues, 18 closed issues\n- Unique Contributors: 53\n- Code Changes: +23512/-29736 lines across 478 files\n- Total Commits: 495\n- Most Active Contributors: wtfsayo, 0xbbjoker, yungalgo, ChristopherTrimboli, K1mc4n\n\n## TOP ISSUES\n\n### Plugin Compatibility\n- Cross-version plugin sharing between 0.x and 1.x versions\n- Plugin loading errors when many agents are present\n- Plugin installation command failures\n\n### Environment Management\n- Inconsistent environment variable resolution\n- PGLite directory configuration issues\n- Runtime type inconsistencies\n\n### Authentication & Security\n- API key authentication implementation\n- Missing middleware for secure endpoints\n\n### Performance Bottlenecks\n- Slow agent loading with multiple agents\n- Unnecessary Express object creation\n- Database migration issues\n\n### User Interface\n- Client scrollbar issues\n- Authentication dialog implementation\n- Twitter timeline integration challenges\n\n### Documentation Gaps\n- Broken documentation links\n- Outdated installation instructions\n- Missing docstrings in critical components\n\n### Model Management\n- Text embedding endpoint configuration\n- Model usage tracking\n- Provider priority implementation\n\n### CLI Experience\n- Incorrect version detection\n- Platform-specific publish options\n- Missing .gitignore in plugin templates\n\n## KEY TECHNICAL DEVELOPMENTS\n\n### Performance Optimizations\n- Implemented faster agent loading when many agents are present [#4519](https://github.com/elizaos/eliza/pull/4519)\n- Removed unnecessary Express object creation [#4414](https://github.com/elizaos/eliza/pull/4414)\n- Optimized BM25 search and updated dependencies [#4411](https://github.com/elizaos/eliza/pull/4411)\n- Added unique PGLite folder if not provided [#4423](https://github.com/elizaos/eliza/pull/4423)\n\n### Plugin Architecture Enhancements\n- Prepared 0.x for sharing plugins with 1.x [#4384](https://github.com/elizaos/eliza/pull/4384)\n- Fixed plugin routes functionality [#4415](https://github.com/elizaos/eliza/pull/4415)\n- Removed forced bootstrap plugin addition [#4417](https://github.com/elizaos/eliza/pull/4417)\n- Implemented cleaner plugin loading code [#4478](https://github.com/elizaos/eliza/pull/4478)\n\n### OpenAI Integration Improvements\n- Extended OpenAI plugin to support custom embedding endpoints [#4421](https://github.com/elizaos/eliza/pull/4421)\n- Added model usage events for embeddings and image description [#4438](https://github.com/elizaos/eliza/pull/4438)\n- Fixed error with TEXT_EMBEDDING [#4537](https://github.com/elizaos/eliza/pull/4537)\n\n### Twitter Integration\n- Implemented Twitter timeline functionality [#4429](https://github.com/elizaos/eliza/pull/4429)\n- Added blog for Twitter agent setup [#4425](https://github.com/elizaos/eliza/pull/4425)\n- Fixed Twitter integration issues [#4506](https://github.com/elizaos/eliza/pull/4506)\n\n### Authentication & Security\n- Added authentication middleware and API key dialog [#4420](https://github.com/elizaos/eliza/pull/4420)\n- Improved agent response and logging in bootstrap plugin [#4548](https://github.com/elizaos/eliza/pull/4548)\n\n### CLI Improvements\n- Fixed incorrect version detection to show correct latest CLI version [#4435](https://github.com/elizaos/eliza/pull/4435)\n- Refactored and enhanced publish CLI command [#4424](https://github.com/elizaos/eliza/pull/4424)\n- Fixed publish CLI options for platform and registry skipping [#4492](https://github.com/elizaos/eliza/pull/4492)\n- Added missing .gitignore in plugins created with global CLI installation [#4489](https://github.com/elizaos/eliza/pull/4489)\n\n### Model Management Refactoring\n- Refactored model handling in AgentRuntime to support provider and priority [#4507](https://github.com/elizaos/eliza/pull/4507)\n- Implemented small model usage for Reply functionality [#4416](https://github.com/elizaos/eliza/pull/4416)\n\n### Database Improvements\n- Used real Drizzle ORM for DB base operation types [#4500](https://github.com/elizaos/eliza/pull/4500)\n- Fixed PGLite migrations [#4532](https://github.com/elizaos/eliza/pull/4532)\n- Fixed JSON serialization to handle invalid Unicode escape sequences [#4458](https://github.com/elizaos/eliza/pull/4458)\n\n### Documentation Enhancements\n- Added docstrings to multiple components [#4446](https://github.com/elizaos/eliza/pull/4446), [#4469](https://github.com/elizaos/eliza/pull/4469), [#4498](https://github.com/elizaos/eliza/pull/4498)\n- Updated documentation to prefer direct usage instead of npx [#4493](https://github.com/elizaos/eliza/pull/4493)\n- Fixed broken Eliza documentation links [#4460](https://github.com/elizaos/eliza/pull/4460)\n\n### Codebase Cleanup\n- Removed several plugins from monorepo for better maintenance [#4406](https://github.com/elizaos/eliza/pull/4406), [#4402](https://github.com/elizaos/eliza/pull/4402), [#4439](https://github.com/elizaos/eliza/pull/4439)\n- Refactored environment variable handling [#4445](https://github.com/elizaos/eliza/pull/4445)\n- Enforced TypeScript on /cli and /plugin-sql [#4529](https://github.com/elizaos/eliza/pull/4529)\n\n## SUMMARY\nMay 2025 was a productive month for ElizaOS with significant improvements to performance, plugin architecture, and user experience. The team successfully addressed key issues in agent loading, environment management, and authentication while enhancing Twitter integration and OpenAI plugin capabilities. The codebase cleanup and documentation improvements have set a solid foundation for future development."
        }
      ]
    }
  }
}
