{
  "ai-news": {
    "elizaos": {
      "discord_md_last_7_days": [
        {
          "filename": "2025-04-29.md",
          "content": "# elizaOS Discord - 2025-04-29\n\n## Overall Discussion Highlights\n\n### ElizaOS Development\n- **ElizaOS v2 Progress**: Shaw mentioned that ElizaOS v2 with multi-agent capabilities will be wrapped up in the next couple of weeks.\n- **Technical Challenges**: Several users reported issues with the installation process, model compatibility, and API integration.\n- **RAM Limitations**: Users discussed hardware constraints when running local models, particularly that LLAMA 3 8B requires 20+ GB of VRAM.\n- **Node.js Compatibility**: Issues were reported with dynamic requires not being supported in Node.js 23+.\n- **Integration Options**: Discussions about integrating ElizaOS with other frontends, with references to agent API endpoints in the agent.ts file.\n\n### Auto.fun Platform\n- **Token Launches**: Several partner projects were launched through Auto.fun, including FightFi, SQUID by Allora Network, with discussions about upcoming launches like xfractal.\n- **Platform Issues**: Users reported problems with DexScreener not updating for some launches (FightAlgo and FightBrawl), causing loss of momentum.\n- **UI Improvements**: The platform team implemented timeframe options for charts during this period.\n- **LP Issues**: Some users experienced incorrect token amounts when purchasing through liquidity pools.\n- **Branding Challenges**: Discussions about consolidating ai16z (token) and ElizaOS (platform) under a single name for better brand recognition.\n\n### Community Projects\n- **Mental Health App**: Cliff shared details about a mental health application built on ElizaOS, featuring a mobile app that works with a smart ring to track physical activities and mood, with versions for both Android and iOS (iOS approval pending).\n- **OpenRouter Integration**: Jin shared positive feedback about using OpenRouter's web search feature to enhance content for elizaOS partners.\n- **Exchange Listings**: Bithumb exchange listed ai16z, according to community member Avanc.\n\n### Market Discussions\n- **ELI5 Token**: Community members discussed price targets between $10-50 million market cap by end of Q2, with some suggesting a more ambitious $30M target within the week.\n- **CEX Listings**: Brief discussion about potential centralized exchange listings for Degenai, with the note that such information is typically under NDAs.\n\n## Key Questions & Answers\n\n### Technical\n- **Q**: How to run local models to test Eliza when hitting RAM limits?  \n  **A**: \"Your macbook doesn't have the hardware capability to run the model you're using. Either quantize it, use a smaller model or use a cloud server.\" (answered by starlord)\n\n- **Q**: How to integrate Eliza AI framework to another chatting frontend demo?  \n  **A**: \"You can take reference of all the agents API endpoints from the agent.ts file.\" (answered by elldee)\n\n- **Q**: Can I adjust the supply of the tokens when creating?  \n  **A**: \"Token supply is fixed at 1 billion.\" (answered by ben)\n\n### Platform & Community\n- **Q**: How do you get verified (green check)?  \n  **A**: \"Verified are projects we are confident are legitimate agent builders.\" (answered by Kenk)\n\n- **Q**: What are the profile \"Points\" for?  \n  **A**: \"More will be revealed with points shortly.\" (answered by Kenk)\n\n- **Q**: Will image uploads be supported soon in AI Create?  \n  **A**: \"Yep, more features will be added to AI create over time.\" (answered by Kenk)\n\n- **Q**: Is there an actual plan for auto.fun's marketing?  \n  **A**: \"The head of marketing was in Spain with power/internet issues, but the team is working to improve engagement.\" (answered by whobody and eskender.eth)\n\n- **Q**: Price target for eli?  \n  **A**: \"Compared to many other AI agents, I think $10-50 mil mcap is doable before end of Q2. Long term, it depends on utility, community, mind share.\" (answered by MDMnvest)\n\n- **Q**: What's the status on consolidating ai16z and elizaOS under the same ticker?  \n  **A**: \"The team needs daos.fun to enable these changes and currently can't make them.\" (answered by Kenk)\n\n- **Q**: Were the partner projects launched on auto.fun specially chosen or did they apply on their own?  \n  **A**: \"Both - the team reached out to potential partnerships weeks ago while still building.\" (answered by jasyn_bjorn)\n\n- **Q**: Does Degenai have any listing plan on the cex?  \n  **A**: \"Most CEX listings are under NDA and can't be discussed.\" (answered by Odilitime)\n\n## Community Help & Collaboration\n\n1. **Model Compatibility Assistance**\n   - **Helper**: starlord\n   - **Helpee**: uedersonferreira\n   - **Context**: RAM limitations when running local models\n   - **Resolution**: Advised to quantize model, use smaller model, or use cloud server\n\n2. **Project Sharing Guidance**\n   - **Helper**: Kenk\n   - **Helpee**: Cliff ツ\n   - **Context**: Cliff wanted to know where to share his ElizaOS-based mental health project\n   - **Resolution**: Kenk shared a link to sign up for weekly demos (https://tally.so/r/nrYKXR)\n\n3. **New Developer Introduction**\n   - **Helper**: Osint (aka not_a_dev_ai)\n   - **Helpee**: BigBoss\n   - **Context**: Introducing a new developer to the community\n   - **Resolution**: Osint introduced BigBoss to the community, shared his credentials, and tipped him 30 ai16z tokens\n\n4. **Exchange Listing Information**\n   - **Helper**: Avanc\n   - **Helpee**: Multiple users\n   - **Context**: Sharing news about Bithumb exchange listing\n   - **Resolution**: Informed the community about ai16z being listed on Korea's second largest exchange\n\n5. **Integration Support**\n   - **Helper**: elldee\n   - **Helpee**: elldee (self-help shared with community)\n   - **Context**: Integrating Eliza AI framework with another frontend\n   - **Resolution**: Shared GitHub reference to agent API endpoints file\n\n## Action Items\n\n### Technical\n1. **Complete ElizaOS v2 with multi-agent capabilities** (Mentioned by shaw)\n2. **Improve auto.fun UI/UX for better mobile compatibility** (Mentioned by shaw)\n3. **Add \"ElizaOS Inside\" branding to auto.fun** (Mentioned by DorianD)\n4. **Create a staking mechanism for ai16z on auto.fun** (Mentioned by Spyros)\n5. **Investigate \"World not found for worldId null\" error** (Mentioned by elldee)\n6. **Fix Twitter client integration error (Maximum call stack size exceeded)** (Mentioned by elldee)\n7. **Resolve dynamic require of \"util\" not supported in Node.js 23+** (Mentioned by orayo)\n8. **Address memory issues causing crashes in GUI when getting responses** (Mentioned by elldee)\n9. **Resolve LP issue for Quill token** (Mentioned by fen sama)\n10. **Implement timeframe options for charts** (Mentioned by Simon | PEPELIZA creatooor 🐸)\n11. **Build a mental health infrastructure with AI therapist/coach functionality on ElizaOS** (Mentioned by Cliff ツ)\n12. **Integration of OpenRouter web search API to enrich elizaOS partner pages** (Mentioned by jin)\n13. **Improve DexScreener integration for token launches** (Mentioned by ryanthelad)\n14. **Investigate why OTTO and DOT lost verification status** (Mentioned by MDMnvest)\n\n### Documentation\n1. **Create guide for integrating ElizaOS with external frontends** (Mentioned by elldee)\n2. **Document hardware requirements for running different models locally** (Mentioned by elldee)\n3. **Improve explanation of how auto.fun agents differ from other bots** (Mentioned by 찌 G 跻 じ PrudentSpartan)\n4. **Create clearer documentation about the relationship between ai16z, ElizaOS, and auto.fun** (Mentioned by DorianD)\n5. **Clarify token minting process and visibility in wallets** (Mentioned by Skullcross)\n6. **Clarify token verification process** (Mentioned by Simon | PEPELIZA creatooor 🐸)\n7. **Explain profile points system** (Mentioned by Simon | PEPELIZA creatooor 🐸)\n\n### Feature\n1. **Implement token swap from ai16z to a simpler ticker like \"E\" or \"Eliza\"** (Mentioned by DorianD and Spyros)\n2. **Create an AI agent on Twitter that aggregates community feedback** (Mentioned by vincentpaul)\n3. **Integrate auto.fun with Hyperfy for 3D virtual environments** (Mentioned by Odilitime)\n4. **Implement AI safety tools/guardrails against prompt injections** (Mentioned by elldee)\n5. **Develop Deepseek plugin for Eliza v2** (Mentioned by elldee)\n6. **Improve compatibility with McP plugin for Notion** (Mentioned by Stan ⚡)\n7. **Add image upload support to AI Create** (Mentioned by Simon | PEPELIZA creatooor 🐸)\n8. **Support adjustable token supply** (Mentioned by Tocheee)\n9. **Address launch notification system** (Mentioned by anon)\n10. **Weekly demos for builders to share their projects** (Mentioned by Kenk)"
        },
        {
          "filename": "2025-04-28.md",
          "content": "# elizaOS Discord - 2025-04-28\n\n## Overall Discussion Highlights\n\n### Platform Development\n- **ElizaOS v2 Development**: Stan mentioned working on \"v2\" of the ElizaOS framework, though specific details were not shared.\n- **Plugin Integration Issues**: Multiple users reported problems with newly added plugins not appearing in the UI search, with `npx elizaos start` suggested as a workaround.\n- **Documentation Build Problems**: Issues were reported with documentation builds on the v2-develop branch.\n- **Docker Optimization**: Questions raised about reducing the Docker image size for Eliza repo (currently 3.32GB).\n\n### Auto.fun Platform\n- **Launch Status**: The auto-fun marketing launch is scheduled to begin tomorrow, though the feature itself is not yet complete.\n- **Token Launch Confusion**: Community members discussed an anticipated token launch on the auto.fun platform, with confusion about whether FightFi (reportedly the first partner) was actually launching.\n- **Migration Issues**: Users reported problems migrating from Auto.fun to Solana, experiencing delays and complications.\n- **Wallet Connection Errors**: Multiple users encountered \"WalletNotConnectedError\" when attempting to create tokens on-chain.\n\n### AI Integration\n- **Model Provider Support**: Discussions about implementing Gemini as a model provider in Eliza, with suggestions to fork the OpenAI implementation and adapt it using Vercel AI's building blocks.\n- **Twitter Integration**: Issues reported with Twitter integration not posting tweets despite logs showing generation.\n- **MCP Plugin Functionality**: Confirmation that the Fleek MCP plugin works properly for connecting to Eliza.\n- **OpenRouter Updates**: Announcements about new providers, OAuth state parameter support, Gemini parallel tool calling, and the launch of Qwen3 models.\n\n### Community & Governance\n- **DAO Structure**: Multiple inquiries about the DAO's structure and governance, with Kenk explaining that governance is still in early stages.\n- **Contributor Rewards**: Questions about potential airdrops or rewards for contributors to ElizaOS, with mention of possible future retroactive rewards.\n- **Agent Integration**: Discussions about integrating agents into Auto.fun, with guidance on promotion and utility.\n\n## Key Questions & Answers\n\n### Technical\n- **Q**: How to fix a plugin not showing in the UI search?  \n  **A**: Try using `npx elizaos start` (answered by acul4688)\n\n- **Q**: Is there a Gemini plugin for the new CLI like there is for OpenAI and Anthropic?  \n  **A**: No implementation exists yet; fork the OpenAI implementation and adapt it for Gemini using Vercel AI (answered by Carlos Rene)\n\n- **Q**: Has anyone successfully connected their MCP to Eliza using the Fleek MCP plugin?  \n  **A**: Yes, it works fine (answered by Carlos Rene)\n\n- **Q**: Can Eliza do large scale scraping with Twitter as a replacement for purchasing the Twitter API?  \n  **A**: Hard to not be detected, you can also use RSS feed (answered by MonteCrypto)\n\n### Platform & Governance\n- **Q**: How long does migration take?  \n  **A**: It can take a few days (answered by Kenk)\n\n- **Q**: Where can I get more info on the DAO?  \n  **A**: Take a read about daos.fun + the early days of the project (answered by Kenk)\n\n- **Q**: How does the governance work for the DAO?  \n  **A**: There's no governance at the moment, there are a group of contributors who have been working on this with a view to utilize agents but it's very early (answered by Kenk)\n\n- **Q**: Is there some special airdrop or something for people contributing in ElizaOS framework?  \n  **A**: There might be some retro rewards in the future but this is undefined (answered by Kenk)\n\n## Community Help & Collaboration\n\n1. **Gemini Integration Guidance**:  \n   Carlos Rene advised acul4688 on implementing Gemini as a model provider in Eliza by suggesting to fork the OpenAI implementation and adapt it for Gemini using Vercel AI.\n\n2. **Plugin Troubleshooting**:  \n   acul4688 helped Carlos Rene with a plugin not showing in UI search by suggesting the use of `npx elizaos start` as a workaround.\n\n3. **MCP Plugin Confirmation**:  \n   Carlos Rene confirmed to acul4688 that the Fleek MCP plugin works properly for connecting to Eliza.\n\n4. **Migration Support**:  \n   Kenk provided guidance to multiple users experiencing issues with Auto.fun to Solana migration, directing them to submit details through a Tally form for resolution.\n\n5. **Launch Interpretation**:  \n   ryanthelad helped Pyroman interpret FightFi's denial of launch by suggesting they might be trying to deter snipers.\n\n## Action Items\n\n### Technical Tasks\n- Fix issue with plugins not appearing in UI search (mentioned by Carlos Rene)\n- Investigate Twitter integration not posting tweets despite logs showing generation (mentioned by acul4688)\n- Fix documentation build issues on v2-develop branch (mentioned by acul4688)\n- Develop Gemini model provider plugin for Eliza (mentioned by acul4688)\n- Optimize Docker image size for Eliza repo (mentioned by Mohit)\n- Fix WalletNotConnectedError when creating tokens on-chain (mentioned by dEXploarer)\n- Resolve incorrect token amounts in Quill LP (mentioned by fen sama)\n- Process refunds for users who invested in fake LP pools during migration (mentioned by drkmttr2)\n- Fix migration delays from Auto.fun to Solana (mentioned by ryanthelad)\n- Investigate errors with fightbrawl where clicking \"buy one Solana\" gives only 1% (mentioned by Osint)\n- Integration of ElevenLabs voice synthesis natively into Unity (mentioned by boom)\n- Development of AI partner for scanning and buying trenches (mentioned by iprintmoney)\n\n### Documentation Needs\n- Information about DAO structure and governance (mentioned by Mhardook)\n- Usage guide for Eliza (mentioned by Lily Ayunda)\n- Clarify what the profile \"Points\" feature is used for (mentioned by Simon)\n- Explain the verification process (green check) (mentioned by Simon)\n- Clarify the verification process for launches on the platform (mentioned by frank_grimes_sr)\n\n### Feature Requests\n- Twitter scraping capabilities as an alternative to the API (mentioned by z1)\n- Voting mechanism for token listings (mentioned by abhi_ironman)\n- Consider improved MCP plugin implementation beyond Fleek's version (mentioned by Stan)\n- Support for image uploads in AI Create section (mentioned by Simon)\n- Add time range options to charts (mentioned by Simon)\n- Add market cap display next to coins on mobile app (mentioned by uloze)"
        },
        {
          "filename": "2025-04-27.md",
          "content": "# elizaOS Discord - 2025-04-27\n\n## Overall Discussion Highlights\n\n### ElizaOS v2 Implementation\n- Users are actively troubleshooting ElizaOS v2 implementations, particularly with client integrations\n- Telegram and local clients work properly after fresh installation, while Discord and Twitter clients require additional configuration\n- GitHub Personal Access Token (PAT) is required for plugin downloads, raising some security considerations\n- Model selection discussions highlighted deepseek 3.1 as a preferred option on the free tier\n\n### Auto.fun Platform Development\n- Community members discussed auto.fun's differentiators compared to competitors like virtuals.io and arc.fun\n- Auto.fun is positioned as an open-source experiment currently in MVP stage\n- Key features include vanity addresses for contracts, token-gated chat, creator fees, and well-received design\n- Token migration issues were reported by multiple users, with the team collecting reports via a Tally form\n- A partners-only auto.fun dashboard is in development but hitting Helius API limits\n\n### Blockchain Technology\n- Discussion about Solana permissioned blockchains (appchains) as cost-saving options before migrating to mainnet\n- Debate about node infrastructure costs versus third-party RPC services\n- Interest in Neon EVM for DAO tooling, potentially allowing Solidity contracts to work with Solana\n- Hyperlane bridge implementation mentioned for cross-chain AI16 transactions\n\n### AI Development Tools\n- Comparison of AI coding tools like Cursor, Windsurf, and Replit for developers with varying skill levels\n- Replit highlighted for building applications without traditional IDE involvement\n- Discussion about the feasibility of developing projects with minimal programming knowledge using AI tools\n\n## Key Questions & Answers\n\n**Q: How to access the chat interface after deploying ElizaOS on Phala?**  \nA: Check the appropriate channel and visit https://eliza.how (answered by Osint)\n\n**Q: Is it possible that playing with eliza burned my GPU?**  \nA: No, this is not possible (answered by Osint)\n\n**Q: How did you get telegram and local client working?**  \nA: Run \"npx elizaos create\", cd into the directory, then \"npx elizaos start\". GitHub PAT is required for plugin downloads. (answered by resethill)\n\n**Q: Is the latest starter pack based on Eliza OS 2?**  \nA: Yes, the quickstart guide in eliza.how is based on v2 beta. (answered by Kenk)\n\n**Q: How can I report migration issues with my tokens?**  \nA: Submit your issue through the Tally form at https://tally.so/r/mOr8DM (answered by Kenk)\n\n**Q: Will coins reaching 60k properly migrate to Raydium?**  \nA: Yes, it should work now as previous issues have been resolved (answered by Osint)\n\n**Q: What type of software can I use for speaking with AI and coding?**  \nA: Cursor (answered by whobody)\n\n**Q: Can I develop a project with zero programming knowledge if I have a good idea and define a good system?**  \nA: Yes, but it requires a lot of patience (answered by 7OROY)\n\n## Community Help & Collaboration\n\n### ElizaOS Installation Support\n- resethill helped orayo with ElizaOS v2 installation steps using npx commands and advised on GitHub PAT requirements\n- resethill assisted Fwog with Windows-specific commands to reinstall ElizaOS after encountering path errors\n- Kenk confirmed to Sthx that the quickstart guide is based on v2 beta\n\n### Token Migration Issues\n- Kenk directed multiple users reporting unmigrated tokens to submit issues via a Tally form\n- Osint confirmed to Pyroman that token migration to Raydium should work properly after fixing previous issues\n\n### AI Development Tools Guidance\n- yikesawjeez provided iprintmoney with a detailed comparison of AI coding tools for developers with no programming knowledge\n- 7OROY suggested Windsurf as an alternative to Cursor for AI coding\n- yikesawjeez shared a live example (tournament.x-ware.online) of an AI-built application and explained differences between tools\n\n## Action Items\n\n### Technical\n- Fix Discord client connectivity issues where bot doesn't show up as online despite matching settings with working bots (Mentioned by resethill)\n- Resolve Twitter client functionality for proper posting (Mentioned by resethill)\n- Fix plugin-bootstrap loading issue where loading occurs even when explicitly removed (Mentioned by resethill)\n- Address entities provider slow response time (4s) (Mentioned by resethill)\n- Fix OpenAI timeout overflow warning showing 32-bit signed integer overflow (Mentioned by Sthx)\n- Migrate token with address 8MYgZupEQ7aAJcyz2ZpSkQEXLnfHEPuU6sGJB8GERFUN (Mentioned by vvz1718, Vaunted)\n- Fix token display issue for 9j1ayE6MQLuiUmcVS2qivsjbznajvidLWQcFBjPQ5FUN (Mentioned by casper)\n- Resolve LP issue where user received fewer tokens than expected after migration (Mentioned by fen sama)\n- Explore Solana appchains for auto.fun projects to save costs before migrating to mainnet (Mentioned by DorianD)\n- Investigate economic advantages of running nodes vs. paying for 3rd party RPC infrastructure (Mentioned by DorianD)\n- Explore Neon EVM for DAO tooling to utilize Solidity contracts on Solana (Mentioned by yikesawjeez)\n- Consider Hyperlane bridge implementation for cross-chain AI16 transactions (Mentioned by yikesawjeez)\n\n### Documentation\n- Create guide for Twitter client integration with proper configuration steps (Mentioned by pursue)\n- Provide deployment best practices for various environments (Mentioned by Ouranos)\n- Provide clearer guidance on auto.fun's roadmap and vision (Mentioned by mariocandia)\n- Create more resources on building web interfaces for ElizaOS (Mentioned by Ouranos)\n- Compare AI coding tools (Cursor, Windsurf, Replit, etc.) for developers with different skill levels (Mentioned by yikesawjeez)\n\n### Feature\n- Improve GitHub PAT permission scoping for more granular control (Mentioned by resethill)\n- Improve trading experience on auto.fun platform to be more competitive (Mentioned by mariocandia)\n- Improve chart functionality to include timeframe selection similar to TradingView (Mentioned by abhi_ironman)"
        },
        {
          "filename": "2025-04-26.md",
          "content": "# elizaOS Discord - 2025-04-26\n\n## Overall Discussion Highlights\n\n### ElizaOS Ecosystem Development\n- **Auto.fun Platform**: Recently open-sourced (less than a week old), allowing community contributions. The platform has enhanced security through a liquidity pool funded by buy fees from tokens launched on Auto.fun.\n- **Development Approach**: The team operates without strict roadmaps or deadlines, focusing on continuous development. Shaw is actively working on Eliza v2 and auto.fun.\n- **Token Migration Debate**: Discussions about migrating from ai16z to ElizaOS due to frustrations with developer Baoskee. DorianD advocated for a 1:1.11 swap ratio for early adopters, while HoneyBadger expressed concerns about potential volume drop based on Polygon's migration experience.\n- **QUILL Token Incident**: A bug in the Auto.fun platform incorrectly displayed the amount of QUILL per SOL, allowing someone to drain the liquidity pool. The team acknowledged this as a bug (not an exploit) and promised SOL refunds to affected users.\n\n### Technical Developments\n- **Plugin Development**: Developers are working on plugins for elizaOS v2, including a Livepeer plugin (PR #48) that offers free incentivized inference.\n- **Character Animation System**: Progress reported on implementing a show that steps through JSON data and loads audio with visemes. Artists need to fix viseme order and schema for each character.\n- **Platform Issues**: Several users reported problems with token migration being stuck for extended periods (up to 20 hours) and website loading issues on Auto.fun.\n\n### Community Governance\n- **Discord Moderation**: Discussions about moderation practices after a user was temporarily kicked from the server. Suggestions included moving dangerous permissions to a bot with a supermod team having access to cold admin accounts.\n- **DAO Development**: Mentions of creating a voting module for the DAO and solutions for migrating DAO treasury funds during a potential token swap.\n\n## Key Questions & Answers\n\n### ElizaOS and Auto.fun\n- **Q**: What is the future of Auto.fun in the roadmap and development plan?  \n  **A**: The team is working on Eliza v2 and auto.fun; they don't operate on strict roadmaps but focus on continuous development.\n\n- **Q**: Will there be further development for Auto.fun, $AI16Z, and ElizaOS, or will it simply remain a token launching platform like Pump.fun?  \n  **A**: The platform is less than a week old and open-sourced, which is unique compared to other launchpads that gatekeep their code.\n\n- **Q**: How will Auto.fun benefit DegenAI?  \n  **A**: Through ai16z driving buybacks for DegenAI.\n\n### Technical Issues\n- **Q**: What happened to the $QUILL token?  \n  **A**: There was a bug that incorrectly showed the amount of Quill per SOL, allowing someone to sell Quill into the LP at a premium and drain it. This was a bug on their side, and they deployed a fix. All users who bought this token will be refunded in SOL.\n\n- **Q**: Will users who bought QUILL before and after bonding be refunded?  \n  **A**: Users should fill out the Tally form with transaction details for review.\n\n- **Q**: Is token creation stopped temporarily until the bug is resolved?  \n  **A**: It's an isolated issue directly tied to the migration of that specific token - no other tokens are impacted.\n\n- **Q**: Are auto.fun tokens mintable?  \n  **A**: Not mintable.\n\n- **Q**: Is the site working?  \n  **A**: It hangs sometimes, try refreshing or clearing cache.\n\n### Project Direction\n- **Q**: Should I remove the Unity Clanktank?  \n  **A**: Keep a backup of Unity clank tank just in case, but it's unclear what the plans are when making the same shows in multiple platforms.\n\n- **Q**: How can a token get certification/verification?  \n  **A**: There's a small number of verified projects from teams they're in touch with. This will evolve over time.\n\n## Community Help & Collaboration\n\n1. **Token Creation Issues**:\n   - **Helper**: Kenk\n   - **Helpee**: casper\n   - **Context**: Token not showing up after creation\n   - **Resolution**: Explained that the token was launched before the website was publicly announced, causing the launch not to execute. Advised to use auto.fun site to re-launch.\n\n2. **QUILL Token Incident**:\n   - **Helper**: eskender.eth\n   - **Helpee**: Multiple users concerned about QUILL\n   - **Context**: Explaining the nature of the QUILL token issue\n   - **Resolution**: Clarified it was a bug not an exploit, explained the technical issue, and informed that affected users would be refunded.\n\n3. **Discord Verification Issues**:\n   - **Helper**: Kenk\n   - **Helpee**: DearDaniel\n   - **Context**: DearDaniel believed he was banned from the partner chat\n   - **Resolution**: Kenk explained it was likely a verification issue affecting some users since April 18th, not an actual ban.\n\n4. **Character Animation System**:\n   - **Helper**: boom\n   - **Helpee**: Unspecified team members\n   - **Context**: Sharing correct morphtarget/blendkey order for character visemes\n   - **Resolution**: Provided reference image showing the required order for the first 15 blendkeys.\n\n5. **NSFW Content Creation**:\n   - **Helper**: yikesawjeez\n   - **Helpee**: Patt\n   - **Context**: Patt mentioned needing good uncensored custom models via API for NSFW content\n   - **Resolution**: yikesawjeez offered guidance on using comfyui with civit loras on runpod to create an API.\n\n## Action Items\n\n### Technical\n- Fix the bug that incorrectly shows token amounts per SOL in migrations (mentioned by eskender.eth)\n- Process refunds in SOL to users affected by the QUILL token issue (mentioned by eskender.eth)\n- Resolve stuck token migrations that have been pending for extended periods (mentioned by nim)\n- Fix black screen issue when creating tokens (mentioned by Tocheee)\n- Implement Ledger support (mentioned by DearDaniel)\n- Review and approve Livepeer plugin PR #48 (mentioned by samdeveloper)\n- Investigate AI system crashes when typing in chat (mentioned by samdeveloper)\n- Implement token migration from ai16z to ElizaOS with bonus ratio for early adopters (mentioned by DorianD)\n- Contact exchanges (Kraken, Binance, etc.) to facilitate token swap (mentioned by DorianD)\n- Create voting module for the DAO (mentioned by shaw)\n- Develop solution for migrating DAO treasury funds during token swap (mentioned by DorianD)\n- Add Ai16z and DegenAI to Featured and Marketcap tabs on Auto.fun (mentioned by Void)\n- Fix viseme order and schema for each character (mentioned by boom)\n- Decide on Unity Clanktank implementation (mentioned by boom)\n- Bug fixes for website loading issues (mentioned by frank_grimes_sr)\n- Address LP (liquidity pool) bugs (mentioned by yikesawjeez)\n\n### Documentation\n- Document character file configuration (mentioned by Fwog)\n- Create documentation on the token verification process (mentioned by 🧧ThanosDaSith24🧧)\n- Improve communication channels for real-time updates during incidents (mentioned by Kenk)\n- Clarify Discord moderation roles and permissions (mentioned by kalshnikov and yikesawjeez)\n- Document required morphtarget/blendkey order (mentioned by boom)\n- Verification process clarification (mentioned by Kenk)\n\n### Feature\n- Revenue-generating AI agents (mentioned by abhi_ironman)\n- Unmoderated partner chat (mentioned by DearDaniel)\n- Highlight Clank Tank winners on autofun with voting for weekly winners (mentioned by Curtisdonthurtus)\n- Create eli5 bot for explaining concepts (mentioned by DorianD and yikesawjeez)\n- Make the token creation process more reliable across devices (mentioned by Akuma The Pirate)\n- Consider implementing bug bounty & auditing services (mentioned by yikesawjeez)"
        },
        {
          "filename": "2025-04-25.md",
          "content": "# elizaOS Discord - 2025-04-25\n\n## Overall Discussion Highlights\n\n### Auto.fun Platform Launch and Development\n- **Platform Launch**: Shaw announced the launch of auto.fun, a new token launchpad that has been open-sourced. The platform generated $12 million in volume within 12 hours of launch and approximately $2k in fees in a single day.\n- **Technical Status**: The platform has been operational for less than a week. Users reported various technical issues including tokens not appearing after creation, migration delays, and UI problems.\n- **Community Reception**: Partners and community members actively tested the platform and provided detailed feedback about bugs and feature requests.\n- **Security Concerns**: A significant incident occurred with the $QUILL token, where a bug incorrectly displayed token pricing, allowing someone to drain the LP pool. The team acknowledged this as a platform bug (not an exploit) and promised refunds to affected users.\n- **Integration Features**: The platform includes agent-building capabilities through Fleek integration, allowing token creators to build AI agents for their projects.\n\n### ElizaOS v2 Development\n- **Plugin System Challenges**: Developers are struggling with database connections, plugin registration, and general setup of ElizaOS agents in v2.\n- **SQL Plugin Issues**: Multiple users reported errors like \"No version matching '^0.25.6' found\" and database connection timeouts.\n- **Custom Plugin Development**: Developers are working on custom plugins including blockchain functionality (EVM plugin for ETH transfers) and a Livepeer plugin offering \"free incentivized inference.\"\n- **Documentation Concerns**: The v2 documentation was described as \"too simple,\" with confusion about the correct approach for development (v2-develop branch vs. elizaos create project).\n\n### Token Migration and Ecosystem\n- **ElizaOS Token**: The elizaOS token (formerly ai16z) was trading around $0.25 with a market cap of approximately $140M.\n- **Migration Issues**: Discussions about migrating the AI16z token away from daos.fun to auto.fun due to frustrations with the current platform. Several projects like AutoPupper and Quilliana AI reported contract migration issues.\n- **Buyback Plans**: Auto.fun will drive buybacks for DegenAI tokens, with ai16z driving buyback on degenai.\n\n### 3D AI Animation Project\n- **Lip-Syncing Implementation**: Team is working on AI-driven character animations with lip-syncing capabilities, focusing on mapping visemes (visual phonemes) for character models to work with Oculus tools.\n- **Show Runner Development**: Boom is implementing a system that processes pre-generated JSON files and audio files to animate characters.\n- **Workflow Design**: The team is developing a process where the system generates show configurations and audio files, which are then processed by Unity to create animations with proper lip-syncing.\n\n## Key Questions & Answers\n\n### Auto.fun Platform\n- **Q**: What decides if a project gets featured on auto.fun? (asked by Curtisdonthurtus)  \n  **A**: Shaw indicated they would pin the main projects and that featured spots could potentially be sold.\n\n- **Q**: Is Ledger supported on auto.fun? (asked by Seppmos)  \n  **A**: \"Correct, unfortunately this isn't supported at the moment, have logged this with the team to take a look at.\" (answered by Kenk)\n\n- **Q**: How long does migration take? (asked by anon)  \n  **A**: \"it's happening right now, think we know why it is happening also\" (answered by Kenk)\n\n- **Q**: What happened with the $QUILL token? (asked by Dom 💎)  \n  **A**: There was a bug that incorrectly showed the amount of Quill per SOL, allowing someone to drain the LP by selling at a premium (answered by eskender.eth and Kenk)\n\n- **Q**: Will users who bought $QUILL be refunded? (asked by fen sama)  \n  **A**: Yes, all users who bought this token will be refunded in SOL post-fix (answered by eskender.eth)\n\n- **Q**: How to create agents in the current auto.fun? (asked by abhi_ironman)  \n  **A**: If you're the token creator, you will see a button to create agents with fleek on the token page. (answered by ben)\n\n### ElizaOS Development\n- **Q**: Is elizaOs sunset after v2? (asked by orayo)  \n  **A**: No it is not going to be sunset (answered by Kenk)\n\n- **Q**: Is pasting links on knowledge works? or we need text? (asked by Fwog)  \n  **A**: Pretty sure you'll need text (answered by Kenk)\n\n- **Q**: What is the future of Auto.fun in the roadmap and development plan from Shaw and the ElizaOS team? (asked by Johny)  \n  **A**: The team is working on Eliza v2 and auto.fun, focusing on open source development rather than strict roadmaps (answered by Osint)\n\n- **Q**: Does degenai v2 include tokenomics? (asked by deki)  \n  **A**: V2 is just the open source release of elizaOS (answered by Odilitime)\n\n### 3D AI Animation\n- **Q**: Do you need Unity to run the show runner? (implied by boom)  \n  **A**: No, there's a drop-down that lets you choose unity or no unity. (answered by SM Sith Lord)\n\n## Community Help & Collaboration\n\n### Platform Testing and Feedback\n- **Helper**: Curtisdonthurtus | **Helpee**: shaw  \n  **Context**: Extensive QA testing of auto.fun platform, identifying numerous bugs and UI issues  \n  **Resolution**: Shaw acknowledged the feedback and implemented fixes, saying \"Great feedback\" and \"Will make a few fixes\"\n\n- **Helper**: yikesawjeez | **Helpee**: shaw  \n  **Context**: Identified that \"generate occasionally works but is throwing 'not found' error every time despite (incl when works)\"  \n  **Resolution**: Shaw acknowledged and fixed most issues\n\n### Technical Support\n- **Helper**: Osint | **Helpee**: 🧧ThanosDaSith24🧧  \n  **Context**: Founder of Quilliana AI seeking help with contract issues  \n  **Resolution**: Osint directed them to contact Rick who could help connect them with the right person\n\n- **Helper**: Kenk | **Helpee**: DearDaniel  \n  **Context**: User believed they were banned from the partner chat  \n  **Resolution**: Kenk explained it was likely a verification issue affecting some users since April 18th, not a ban\n\n- **Helper**: Osint | **Helpee**: Hunterxsol  \n  **Context**: User couldn't find their $PXC token on the platform  \n  **Resolution**: Osint provided a direct link to the token showing it was still accessible\n\n- **Helper**: ben | **Helpee**: abhi_ironman  \n  **Context**: User wanted to know how to create agents on auto.fun  \n  **Resolution**: Explained that token creators will see a button to create agents with fleek on the token page\n\n### Development Assistance\n- **Helper**: lantianlaoli | **Helpee**: samdeveloper  \n  **Context**: Error with plugin version in v2  \n  **Resolution**: Explained \"The V2 version of the plugin requires you to use the elizaos command to actively download it\"\n\n- **Helper**: Kenk | **Helpee**: samdeveloper  \n  **Context**: Looking for blockchain integration examples  \n  **Resolution**: Suggested looking at Bio Agent plugin with links to documentation and tutorial\n\n- **Helper**: SM Sith Lord | **Helpee**: boom  \n  **Context**: Confusion about show runner requirements and development approach  \n  **Resolution**: Clarified that Unity isn't required and outlined a phased approach - first parse existing files, then develop generation capabilities\n\n## Action Items\n\n### Technical\n- Fix \"not found\" error when generating images on auto.fun (Mentioned by Curtisdonthurtus)\n- Fix issue where platform takes SOL but doesn't create tokens (Mentioned by CΔNCER)\n- Fix backend issue preventing token migrations to Raydium (Mentioned by Multiple users)\n- Fix bug with token price representation in bonding curves (Mentioned by eskender.eth)\n- Fix black screen issue when creating new tokens (Mentioned by Tocheee)\n- Fix mobile version price display (Mentioned by abhi_ironman)\n- Fix \"failed to claim fees\" error (Mentioned by yikesawjeez)\n- Fix chat lag/duplicate message issue on auto.fun (Mentioned by Curtisdonthurtus)\n- Fix \"failed to download image\" error (Mentioned by Curtisdonthurtus)\n- Fix audio and video not working on AI create (Mentioned by Curtisdonthurtus)\n- Fix Pro button for image generation (Mentioned by Curtisdonthurtus)\n- Fix duplicate project images under MC page full view (Mentioned by Curtisdonthurtus)\n- Fix blinking white prompt when copying wallet address (Mentioned by Curtisdonthurtus)\n- Fix social links not saving (Mentioned by yikesawjeez)\n- Fix SQL plugin connection issues with Neon database (Mentioned by samdeveloper)\n- Fix agent crashes during chat interactions (Mentioned by samdeveloper)\n- Fix issue with Eliza getting stuck in \"None\" action when retrying failed actions (Mentioned by egoarka)\n- Fix verification issues affecting some users since April 18th (Mentioned by Kenk)\n- Fix viseme ordering in character models to match Oculus requirements (Mentioned by boom)\n- Fix the ElizaOS JSON endpoint that returns no data (Mentioned by jin)\n- Implement ETH transfer functionality using @Elizaos/plugin-evm (Mentioned by samdeveloper)\n- Implement Ledger hardware wallet support (Mentioned by DorianD)\n- Add DDOS/spam protection to auto.fun (Mentioned by Void)\n- Implement show stepping from pregenerated audio and JSON (Mentioned by boom)\n- Create standalone episode generator tool after parsing functionality is complete (Mentioned by SM Sith Lord)\n- Address platform stability issues (Mentioned by yikesawjeez)\n- Implement security audits and bug bounties (Mentioned by yikesawjeez)\n- Investigate token launch with abnormal market cap (Mentioned by frank_grimes_sr)\n- Update Dexscreener link and image in line with official announcement (Mentioned by Avanc)\n- Update Binance Alpha profile (Mentioned by Odilitime)\n\n### Documentation\n- Create clear documentation for adding existing projects to auto.fun (Mentioned by shadows.13)\n- Create clear documentation on token migration process (Mentioned by Multiple users)\n- Explain verification process for tokens (Mentioned by 🧧ThanosDaSith24🧧)\n- Improve documentation for plugin development in v2 (Mentioned by lantianlaoli)\n- Create a bug reporting system/ticket system (Mentioned by DorianD)\n- Create comprehensive documentation for auto.fun (Mentioned by abhi_ironman)\n- Document proper viseme schema for artists (first 15 blend keys need specific ordering) (Mentioned by boom)\n\n### Feature\n- Pin ai16z and degenai on the featured tab (Mentioned by Void)\n- Highlight Clank Tank winners on auto.fun (Mentioned by Curtisdonthurtus)\n- Implement token migration from ai16z to ElizaOS (Mentioned by shaw)\n- Add voting functionality to auto.fun (Mentioned by shaw)\n- Improve token creation reliability (Mentioned by CΔNCER)\n- Improve trading chart functionality (Mentioned by Prowler)\n- Allow editing token descriptions (Mentioned by MDMnvest)\n- Consider implementing a Telegram bot for trading (Mentioned by mdj7347)\n- Develop revenue-generating AI agents (Mentioned by Osint, abhi_ironman)\n- Review and approve Livepeer plugin PR that offers free incentivized inference (Mentioned by samdeveloper)\n- Add Discord link to Bento.me/SpartanVersus profile (Mentioned by Void)\n- Add affiliate badge with ElizaOS to the second Twitter account (Mentioned by Void)\n- Implement DegenAI V2 as open source release of elizaOS (Mentioned by Odilitime)\n- Continue buyback plan for DegenAI through auto.fun platform (Mentioned by Void)"
        },
        {
          "filename": "2025-04-24.md",
          "content": "# elizaOS Discord - 2025-04-24\n\n## Overall Discussion Highlights\n\n### Auto.fun Platform Updates\n- **Maintenance and Relaunch**: Auto.fun was temporarily down for maintenance to improve cache and database capabilities to handle increased workload, and was later brought back online as announced by Shaw.\n- **Performance**: The successful relaunch generated $12 million in volume within 12 hours, demonstrating strong market interest despite the initial setbacks.\n- **Technical Issues**: Users experienced several problems including tokens not appearing in the UI despite successful on-chain transactions, migration delays, and trading difficulties.\n- **Fleek Integration**: The Autofun team integrated Fleek for no-code agent building functionality, allowing token creators to launch agents alongside their tokens.\n- **Launch Partners**: Launch partner spotlights will begin with FightFI, followed by one launch per day over two weeks.\n\n### ElizaOS V2 Development\n- **Swarm Integration**: ElizaOS V2 features the Swarm integration which enables agent collaboration through Multi-agent Coordination Protocol (MCP).\n- **Swarm Functionality**: Allows agents to share vector memory, use the same wallet safely, chain tasks in sequence, learn over time, and act as one hive mind.\n- **Plugin Development Challenges**: Users are struggling with the transition to v2, which appears to have significant architectural changes from previous versions.\n- **Model Support**: V2 supports local-ai, grok/groq, and ollama, but users noted limited LLM options compared to v1.\n\n### Spartan/DegenAI V2\n- **Active Development**: Odilitime clarified that DegenAI is still actively being developed, addressing concerns about it being \"abandoned.\"\n- **Token Relationship**: \"Every ai16z tx has the carry and creates buy pressure on degenai.\"\n- **Open Source**: A version of Spartan is available on the v2-develop branch of the elizaos/eliza repository.\n- **Resource Consolidation**: The team created a Bento.me page to consolidate DegenAI links.\n\n### 3D AI TV Development\n- **Viseme Implementation**: Technical challenges related to implementing visemes (visual mouth positions for speech) in a 3D AI show system.\n- **Workflow Improvements**: Discussion about creating a version of the runner that just generates show JSON and audio without requiring the full Unity implementation.\n\n## Key Questions & Answers\n\n### Auto.fun & Platform\n**Q**: How to create agents in the current auto.fun?  \n**A**: If you're the token creator, you will see a button to create agents with fleek on the token page. (answered by ben)\n\n**Q**: Why isn't my token migrating?  \n**A**: It can take time; some tokens need manual migration due to a known issue with a fix underway. (answered by Kenk)\n\n**Q**: How many SOL does it take to buy 50% of auto.fun token pre-launch?  \n**A**: Around 20-30 SOL for 60% of tokens. (answered by iprintmoney)\n\n### ElizaOS V2\n**Q**: How is the concept of Swarms intended in Eliza V2?  \n**A**: Swarms in ElizaOS V2 enable agent collaboration through Multi-agent Coordination Protocol, allowing agents to share vector memory, use the same wallet safely, chain tasks in sequence, learn over time, and act as one hive mind. (answered by Osint)\n\n**Q**: When and if will there be a tokenomics paper, an autodotfun and eliza v2 documentation?  \n**A**: Yes, there will be all three. ElizaOS V2 documentation is available at www.eliza.how. (answered by Kenk)\n\n**Q**: How to add plugin about V2? The elizaos project add-plugin command not work.  \n**A**: Use the character file's plugin field or clone v2-develop and copy an existing plugin. (answered by Odilitime)\n\n**Q**: Why doesn't v2 support the deepseek model?  \n**A**: V2 is missing a lot still but supports local-ai, grok/groq, and ollama. (answered by Odilitime)\n\n**Q**: Is elizaOs sunset after v2?  \n**A**: No, it is not going to be sunset. (answered by Kenk)\n\n### Spartan/DegenAI\n**Q**: What is the DegenAI X account?  \n**A**: That's the original dude from CT Shaw based the bot on. (answered by Odilitime)\n\n**Q**: When is Spartan going to be open sourced?  \n**A**: There's a version of him on the v2-develop branch on the elizaos/eliza repo. (answered by Odilitime)\n\n**Q**: I want to know more details about further DegenAI buyback plans?  \n**A**: I have nothing else for you at this time. ai16z drives buy back on degenai. (answered by Odilitime)\n\n### 3D AI TV\n**Q**: Do you need Unity to run the show runner?  \n**A**: No, there's a drop-down that lets you choose unity or no unity. (answered by SM Sith Lord)\n\n## Community Help & Collaboration\n\n### Auto.fun Support\n- **Token Visibility Issues**: Osint helped Hunterxsol locate their missing $PXC token on the platform and provided the link, showing it had -27.11 SOL.\n- **Token Creation Problems**: Osint advised CΔNCER to use the support button at the bottom of the app when the platform took SOL without creating the coin.\n- **Agent Creation Guidance**: Ben explained to abhi_ironman that token creators will see a button to create agents with fleek on the token page.\n\n### ElizaOS V2 Assistance\n- **Telegram Integration**: Santgr shared that to get Telegram working on elizaos v2, users need to disable \"Privacy Mode\" in BotFather, then kick and re-add the bot to groups.\n- **Plugin Development**: Odilitime helped lantianlaoli with adding plugins in v2, suggesting to use character file's plugin field or clone v2-develop and copy an existing plugin.\n- **Wallet Integration**: Lantianlaoli advised blackpink on creating wallet connection functionality by modifying frontend and customizing solana plugin to allow user signing.\n\n### Platform Testing & QA\n- **Thorough Testing**: Curtisdonthurtus provided extensive QA testing of auto.fun dev version, identifying numerous bugs including image generation errors, chat lag, download failures, and duplicate project listings.\n- **DevOps Support**: Yikesawjeez offered DevOps assistance with autoscaling/k8s and to build a portal website with wallet verification for partners.\n\n### 3D AI TV Development\n- **Development Approach**: SM Sith Lord helped boom by clarifying that Unity isn't required for the show runner and outlined a step-by-step development path, suggesting to first parse & process pre-generated show_config.json and MP3s before worrying about generating new content.\n\n## Action Items\n\n### Technical\n- Fix token creation issues where platform takes SOL but doesn't create tokens (mentioned by CΔNCER)\n- Address platform stability issues causing repeated downtime (mentioned by yikesawjeez)\n- Ensure token visibility remains consistent on the platform (mentioned by Hunterxsol)\n- Fix Ledger hardware wallet integration (mentioned by DorianD)\n- Implement spam/DDOS protection for auto.fun (mentioned by Void)\n- Fix image generation \"not found\" errors (mentioned by Curtisdonthurtus)\n- Resolve chat lag and duplicate message issues (mentioned by Curtisdonthurtus)\n- Fix token migration issues for projects (mentioned by Curtisdonthurtus)\n- Fix \"failed to download image\" error (mentioned by Curtisdonthurtus)\n- Fix plugin registration in v2 to properly initialize providers (mentioned by santgr)\n- Improve v2 support for additional LLM models beyond OpenAI and Anthropic (mentioned by lantianlaoli)\n- Fix DTS build errors in plugins (mentioned by santgr)\n- Resolve JSON parsing errors during agent initialization (mentioned by santgr)\n- Fix database connection issues with SQL plugin (mentioned by santgr)\n- Create plugin for user-controlled wallet integration (mentioned by blackpink)\n- Fix viseme ordering to match Oculus requirements (mentioned by boom)\n- Fix ElizaOS JSON endpoint (mentioned by jin)\n- Implement show stepping from pregenerated audio and JSON (mentioned by boom)\n- Create standalone episode generator (mentioned by SM Sith Lord)\n- Complete development of Spartan V2 integrated with ElizaOS V2 (mentioned by Odilitime)\n- Update Binance Alpha profile (mentioned by Odilitime)\n- Update Dexscreener link and image (mentioned by Avanc)\n\n### Documentation\n- Create comprehensive documentation for auto.fun platform (mentioned by abhi_ironman)\n- Document the Fleek integration for agent creation (mentioned by abhi_ironman)\n- Create better documentation for plugin creation in v2 (mentioned by Odilitime)\n- Update documentation to reflect actual code structure in v2 (mentioned by lantianlaoli)\n- Provide clear migration guide from v1 to v2 (mentioned by santgr)\n- Document proper viseme implementation (mentioned by boom)\n- Add Discord link to the Bento.me page (mentioned by Void)\n- Consider adding affiliate badge with ElizaOS to the token Twitter account (mentioned by Void)\n- Clarify expected migration times for tokens (mentioned by LunarFang_416)\n- Provide instructions for users with stuck tokens (mentioned by multiple users)\n- Provide clearer status updates during outages (mentioned by Void)\n- Create comprehensive documentation for Swarm functionality (mentioned by mariocandia)\n\n### Features\n- Improve token creation process to prevent failed transactions (mentioned by CΔNCER)\n- Implement better support for token recovery or transaction issues (mentioned by Hunterxsol)\n- Consider blacklisting certain token names to prevent scams (mentioned by iprintmoney)\n- Pin ai16z and degenai on the featured tab (mentioned by Void)\n- Consider migrating to own the token and bridge liquidity to Base (mentioned by shaw)\n- Implement voting functionality on auto.fun (mentioned by shaw)\n- Support for user wallet connections instead of pre-set wallets (mentioned by blackpink)\n- Add support for deepseek model in v2 (mentioned by lantianlaoli)\n- Add placeholders for new content (mentioned by jin)\n- Create an AI-powered comedy generator trained on top comedians with blockchain integration (mentioned by boom)\n- Allow DegenAI account to post official announcements (mentioned by deki)\n- Create a linktree-like service for all Spartan/DegenAI links (mentioned by Odilitime)\n- Improve auto.fun UI/UX to be more user-friendly (mentioned by mdj7347)\n- Consider Telegram bot integration for easier trading across chains (mentioned by mdj7347)\n- Add ability to edit token descriptions (mentioned by MDMnvest)"
        }
      ],
      "dev_md_last_7_days": [
        {
          "filename": "2025-04-29.md",
          "content": "# elizaOS Development Discord - 2025-04-29\n\n## Overall Discussion Highlights\n\n### Plugin Integration & Configuration\n- Multiple users worked through issues with specific plugins including Twitter and Fleek MCP\n- Twitter plugin integration required explicit addition via CLI command: `elizaos plugins add @elizaos/plugin-twitter`\n- EVM integration challenges were discussed, particularly around ETH to USDC swaps on mainnet\n- Fleek MCP Plugin issues were resolved by properly specifying tool calls\n\n### LLM Provider Configuration\n- Significant discussion around configuring Gemini as an alternative LLM provider\n- Environment variable setup similar to OpenAI but with Gemini-specific endpoint URLs\n- Several users shared configuration attempts and troubleshooting steps\n\n### Technical Demonstrations\n- Live demonstration of Unreal Engine 5.5 integration with ElizaOS\n- The demo featured market analysis capabilities and Twitch client functionality\n- Discussion about using OpenRouter's web search feature to enhance ElizaOS partner pages\n\n### Agent Development\n- File structure for agent configuration was shared in the agent-dev-school channel\n- Key files discussed: config.yaml, character.yaml, and secrets.env\n\n## Key Questions & Answers\n\n**Q: How can I use Gemini as my LLM provider?** (asked by FaultyCarry)  \n**A:** Configure environment variables similar to OpenAI with the correct Gemini endpoint URL (answered by sayonara)\n\n**Q: When I want to swap ETH to USDC on mainnet using plugin-evm, this error happens. What else do I need?** (asked by OpsDev | Onyx)  \n**A:** You need to configure EVM_CHAINS in your .env file (answered by sam-developer)\n\n**Q: Why is my agent not tweeting despite adding Twitter credentials?** (asked by FaultyCarry)  \n**A:** You need to explicitly add the Twitter plugin with \"elizaos plugins add @elizaos/plugin-twitter\" (answered by sam-developer)\n\n## Community Help & Collaboration\n\n1. **Twitter Plugin Integration**\n   - **Helper:** sam-developer\n   - **Helpee:** FaultyCarry\n   - **Context:** Agent not tweeting despite Twitter credentials in .env\n   - **Resolution:** Instructed to add Twitter plugin explicitly with CLI command\n\n2. **EVM Configuration Support**\n   - **Helper:** sam-developer\n   - **Helpee:** OpsDev | Onyx\n   - **Context:** ETH to USDC swap failing on mainnet\n   - **Resolution:** Suggested adding EVM_CHAINS configuration to .env file\n\n3. **Gemini LLM Integration**\n   - **Helper:** sayonara\n   - **Helpee:** FaultyCarry\n   - **Context:** Configuring Gemini as LLM provider\n   - **Resolution:** Provided correct environment variable configuration for Gemini integration\n\n4. **Fleek MCP Plugin Troubleshooting**\n   - **Helper:** Scooter\n   - **Helpee:** Mel G\n   - **Context:** Issues with Fleek MCP Plugin\n   - **Resolution:** Scooter mentioned the need to specify tool calls, which resolved their issue\n\n## Action Items\n\n### Technical\n- Remove environment limitations for multi-room chat in GUI (Mentioned by: shaw)\n- Fix Gemini integration with ElizaOS to resolve configuration issues (Mentioned by: FaultyCarry)\n- Improve EVM plugin error handling with better error messages when configuration is incomplete (Mentioned by: OpsDev | Onyx)\n\n### Feature\n- Add support for posting to X communities to enable agents to post to communities on X platform (Mentioned by: Jon)\n- Enhance OpenRouter web search integration for partner pages (Mentioned by: multiple users)\n\n### Documentation\n- Create comprehensive guide for LLM provider configuration, including setup for different providers like Gemini (Mentioned by: sayonara)\n- Document proper plugin installation and configuration steps for common plugins (Twitter, EVM, Fleek MCP)\n- Develop standardized agent configuration templates with examples of config.yaml, character.yaml, and secrets.env"
        },
        {
          "filename": "2025-04-28.md",
          "content": "# elizaOS Development Discord - 2025-04-28\n\n## Overall Discussion Highlights\n\n### Agent Configuration & Setup\n- Users are actively setting up Eliza agents with various plugins, particularly Twitter integration\n- The community is working through configuration challenges, especially around authentication and credentials\n- ElizaOS is now TypeScript-based (v2.1.0), moving away from earlier Python implementations\n- Configuration is split between technical settings (config.yaml) and personality/response settings (character files)\n\n### Advanced Agent Capabilities\n- Interest in agent-to-agent communication (swarms) and orchestration between multiple agents\n- Discussion about MCP (Mission Control Protocol) integration with the Fleek plugin\n- Hyperfy confirmed to be using the Fleek plugin for MCP client functionality\n\n### Storage & Infrastructure\n- Technical discussion about storage system architecture with 3 hot and 2 cold replicas for warm storage\n- Debate about data replication approaches versus erasure coding for efficiency\n- Implementation of Proof of Data Possession (PDP) for verification of distributed data chunks\n\n## Key Questions & Answers\n\n**Q: Is there a simple guide for setting up an example agent on Discord?**  \nA: jin recommended using the full LLM context guide at https://eliza.how/llms-full.txt\n\n**Q: What is the simplest way to get a Twitter agent working?**  \nA: sam-developer provided GitHub link to social media manager code and basic setup instructions\n\n**Q: Can we use Twitter agent without Twitter API?**  \nA: sam-developer confirmed it's possible using cookies for authentication\n\n**Q: Is it possible for agents to talk to each other with an orchestrator agent?**  \nA: DeFine explained this is called a swarm, suggesting modifications to the org package or creating an Eliza project from CLI\n\n**Q: What MCP client plugin is Hyperfy using?**  \nA: jin and peezy confirmed they're using the Fleek plugin\n\n**Q: How is the warm storage system designed for redundancy?**  \nA: The plan includes 3 hot and 2 cold replicas, with hot copies chunked and distributed across many storacha nodes using Proof of Data Possession\n\n**Q: Is ElizaOS Python or TypeScript based?**  \nA: Ruby clarified that ElizaOS is now TypeScript-based (v2.1.0), and Python examples were from an early prototype\n\n## Community Help & Collaboration\n\n- **Twitter Agent Setup**: sam-developer helped Ryan-MoRtRed with Twitter agent configuration, providing GitHub links and explaining authentication options\n- **Storage System Design**: Ruby provided technical feedback to inthiseconomy about their storage architecture, suggesting erasure coding instead of full replication\n- **Twitter Mention Listener**: Ruby assisted Pill Bullman with configuring the Twitter plugin to monitor and respond to mentions, providing specific code for config.yaml\n- **Documentation Clarification**: 0xbbjoker helped standard understand prompt formatting, explaining why logs appear flattened while actual formatting is preserved\n- **MCP Plugin Identification**: jin and peezy helped Agent Joshua identify which plugin Hyperfy uses for MCP client functionality\n\n## Action Items\n\n### Technical\n- Improve Twitter agent authentication process (Ryan-MoRtRed)\n- Address Twitter account suspension issue after posting (Ryan-MoRtRed)\n- Implement agent-to-agent communication framework (AD)\n- Consider implementing erasure coding instead of full replication for better storage efficiency (Ruby)\n- Address potential hotspot issues in shard management (Ruby)\n- Complete stress testing on Filecoin Calibration network (inthiseconomy)\n- Configure Twitter plugin with watchUsers and replyToMentions settings in config.yaml (Ruby)\n\n### Documentation\n- Create beginner-friendly guide for setting up example agents with plugins (BigBoss)\n- Develop clearer instructions for Twitter agent setup (Ryan-MoRtRed)\n- Improve MCP server tools documentation (Scooter)\n- Create more accessible onboarding materials beyond video tutorials (BigBoss)\n- Update outdated guides that reference Python implementation (Ruby)\n\n### Feature\n- Implement agent-to-agent communication framework (AD)"
        },
        {
          "filename": "2025-04-27.md",
          "content": "# elizaOS Development Discord - 2025-04-27\n\n## Overall Discussion Highlights\n\n### Auto.fun Solana Program Implementation\n- Discussion about Raydium liquidity migration implementation details\n- Clarification on using `lockLp` function (temporary lock) versus `burnAndEarn.createLockInstruction` (permanent lock/burn)\n- Confirmation that Auto.fun contracts have been audited by Spearbit/Cantina\n- Developer explained they're using `feeNftOwner` parameter with a custom vault as recipient\n- Future plans for NFT functionality beyond creator fee claiming\n\n### Plugin Development for Eliza V2\n- User inquired about developing plugins for Eliza V2 without requiring multiple agents\n- Guidance provided on using documentation and template creation command\n- Discussion about code structure differences between V1 and V2 versions\n\n### EVM Plugin Configuration Issues\n- Troubleshooting session for EVM plugin connection problems\n- Identified that using multiple provider URLs requires setting a default chain\n- Solution involved adding `EVM_DEFAULT_CHAIN` environment variable to specify primary network\n\n## Key Questions & Answers\n\n**Q: Can plugins be developed based on the current V2 version? Is there any excellent open source code to refer to?**  \nA: Check the docs on how to create a plugin at https://eliza.how/docs/core/plugins. Once you create your template plugin with `elizaos create --type project`, you can start developing your plugin and integrate it to your Eliza v2 project.\n\n**Q: Are auto.fun solana program (contracts) audited?**  \nA: Yes, by Spearbit/Cantina.\n\n**Q: Could you explain the reasoning behind choosing the standard lockLp function (temporary lock) for the Raydium liquidity migration instead of the burnAndEarn.createLockInstruction (permanent lock/burn) feature?**  \nA: We do use the `feenftowner` but it's the custom vault. There's more plans for the NFT than just creator fee claiming.\n\n**Q: How do I fix the EVM plugin when it's not connecting properly?**  \nA: Set an `EVM_DEFAULT_CHAIN` environment variable to specify your primary network when using multiple provider URLs.\n\n**Q: What logs should I check for EVM connection issues?**  \nA: Check `/var/log/elizaos/agent.log` for EVM connection details.\n\n**Q: What environment variables are required for the EVM plugin?**  \nA: `PROVIDER_URL` and `CHAIN_ID` are required, and `EVM_DEFAULT_CHAIN` when using multiple networks.\n\n## Community Help & Collaboration\n\n### EVM Plugin Troubleshooting\n- **Helper:** Ruby\n- **Helpee:** ItzMrTobz\n- **Context:** User had configured multiple Ethereum provider URLs (Arbitrum, Polygon, Fantom, Base) but encountered \"no wallet or connection\" error when attempting transfers\n- **Resolution:** Ruby identified the missing `EVM_DEFAULT_CHAIN` environment variable and provided solution to set a default chain (e.g., \"arbitrum\")\n\n### Plugin Development Guidance\n- **Helper:** DeFine\n- **Helpee:** lantianlaoli\n- **Context:** User needed guidance on developing plugins for Eliza V2\n- **Resolution:** Directed to documentation at eliza.how/docs/core/plugins and provided command `elizaos create --type project` to create a template plugin\n\n## Action Items\n\n### Technical\n- **Add MIT license to repository**\n  - Description: License needs to be added to allow code usage\n  - Mentioned By: AD\n- **Add EVM_DEFAULT_CHAIN environment variable when using multiple provider URLs**\n  - Description: Set a primary network (e.g., \"arbitrum\") as default for the EVM plugin to function properly\n  - Mentioned By: Ruby\n- **Develop plugin for Eliza V2**\n  - Description: User needs to develop a plugin without requiring multiple agents\n  - Mentioned By: lantianlaoli\n\n### Documentation\n- **Update EVM plugin documentation**\n  - Description: Clarify the requirement for EVM_DEFAULT_CHAIN when using multiple provider URLs\n  - Mentioned By: Ruby\n- **Provide explanation of code structure changes between V1 and V2**\n  - Description: User cannot find agent runtime code in V2 branch\n  - Mentioned By: lantianlaoli"
        },
        {
          "filename": "2025-04-26.md",
          "content": "# elizaOS Development Discord - 2025-04-26\n\n## Overall Discussion Highlights\n\n### Deployment Architecture\n- Discussion about ElizaOS deployment strategies with PostgreSQL\n- Debate between using same-VPS PostgreSQL versus separate RDS instances\n- Odilitime recommended using PostgreSQL on the same VPS for simpler deployments\n\n### Project Licensing & Access\n- Confirmation that AUTO.FUN uses MIT licensing (documentation to be added)\n- Discord access links shared for ElizaOS (formerly AI16Z)\n- Community organization continuing around AI projects\n\n### Technical Development\n- RUBY character revival in AUTO.FUN being discussed\n- Original RUBY developer (43rdBigIdeaCEO) reconnecting with the community\n- Plugin configuration issues addressed with proper JSON formatting guidance\n\n## Key Questions & Answers\n\n**Q: When deploying Eliza, should PostgresDB be deployed separately?**  \nA: Odilitime suggested using PostgreSQL on the same VPS rather than a separate RDS instance for simpler setups.\n\n**Q: Can someone let me back into ElizaOS (formerly AI16Z)?**  \nA: Shaw provided the Discord invite link: https://discord.gg/ai16z\n\n**Q: What license is AUTO.FUN source code released under?**  \nA: Shaw confirmed MIT licensing and committed to adding proper documentation.\n\n**Q: Am I writing the plugin configuration statements correctly?**  \nA: Ruby identified syntax issues - missing commas between plugin entries and improperly nested secrets - and provided corrected JSON structure.\n\n## Community Help & Collaboration\n\n1. **Deployment Architecture Guidance**  \n   - Helper: Odilitime\n   - Helpee: Wes\n   - Context: Deployment architecture for ElizaOS with PostgreSQL\n   - Resolution: Suggested using PostgreSQL on the same VPS for simplicity\n\n2. **Discord Access Assistance**  \n   - Helper: Shaw\n   - Helpee: 43rdBigIdeaCEO\n   - Context: Needed access to ElizaOS Discord\n   - Resolution: Provided Discord invite link\n\n3. **Plugin Configuration Troubleshooting**  \n   - Helper: Ruby\n   - Helpee: ItzMrTobz\n   - Context: Incorrect JSON configuration for plugins\n   - Resolution: Provided corrected JSON structure with proper array formatting and nesting\n\n## Action Items\n\n### Documentation\n- Add MIT license documentation to the AUTO.FUN repository (Mentioned by Shaw)\n\n### Technical\n- Deploy ElizaOS with PostgreSQL database (either on same VPS or separate RDS) (Mentioned by Wes)\n- Fix plugin configuration JSON syntax with proper commas and nesting (Mentioned by Ruby)\n\n### Feature\n- Revive RUBY character in AUTO.FUN (Mentioned by 43rdBigIdeaCEO)"
        },
        {
          "filename": "2025-04-25.md",
          "content": "# elizaOS Development Discord - 2025-04-25\n\n## Overall Discussion Highlights\n\n### Auto.fun Project & ElizaOS Development\n- The Auto.fun project (related to ElizaOS) was a central topic of discussion\n- Clarification that the repository license is MIT, with shaw committing to add this to the codebase\n- Connection between Ruby and Auto.fun projects was mentioned, with the original creator of Ruby reaching out\n- Brand assets for Auto.fun were shared via Google Drive, though they appear limited in scope\n\n### Deployment Architecture\n- Discussions about deploying ElizaOS with PostgreSQL on AWS\n- One user plans to deploy Postgres to an RDS instance and ElizaOS on EC2\n- Common approach is using Postgres on the same VPS as ElizaOS\n- Brief mention of distributed systems complexity and architecture considerations\n\n### Plugin Development & Configuration\n- Technical discussion about plugin configuration syntax issues\n- Specific problems with JSON formatting, including missing commas and improper nesting\n- Twitter API integration with the client plugin was discussed\n- Request for WhatsApp client plugin in future versions\n\n### Community Management\n- Significant concern raised about an impersonator (\"solananes\") scamming users since May 2024\n- Invitation link provided to rejoin the AI16Z Discord server\n\n### File Organization\n- Issues raised about default behavior of storing project files in ~/.eliza directory\n- Challenges when managing multiple projects with the current file organization system\n\n## Key Questions & Answers\n\n**Q: When deploying Eliza, do you deploy the PostgresDB separately?**  \nA: \"I just use postgres in the same vps, rds seems to make sense for you\" (answered by Odilitime)\n\n**Q: What license is auto.fun source code released under?**  \nA: \"MIT, will add now\" (answered by shaw)\n\n**Q: Can we use normal Twitter API with it or just like browser without API?**  \nA: \"The client plugin-twitter uses [the API]\" (answered by Odilitime)\n\n**Q: Do we have brandkit for autofun?**  \nA: Shared Google Drive folder with banners and logos (answered by Nisita)\n\n**Q: Am I writing the statements correctly? Or am I doing something wrong with my plugins?**  \nA: \"The plugin syntax seems off - you're missing commas between the plugin entries and the secrets block isn't properly nested.\" (answered by Ruby)\n\n## Community Help & Collaboration\n\n1. **Plugin Configuration Help**\n   - Ruby provided properly formatted JSON structure to ItzMrTobz who was struggling with plugin configuration syntax\n   - cjft suggested using the \"format document\" right-click option as a simpler solution\n\n2. **Deployment Architecture Guidance**\n   - Odilitime advised Wes on deployment architecture for ElizaOS with PostgreSQL\n   - Confirmed using Postgres on same VPS is common, but RDS makes sense for AWS deployment\n\n3. **Multi-Project Management Solutions**\n   - Ruby suggested two approaches to LemonS for managing multiple projects:\n     - Using separate workspace directories with symlinks\n     - Configuring environment variables to override default paths\n\n4. **Brand Assets Sharing**\n   - Nisita shared Auto.fun brand assets with ElizaBAO🌟 via Google Drive folder containing banners and logos\n\n## Action Items\n\n### Technical\n- **Add MIT license document to the repository** (Mentioned by shaw)\n- **Address impersonation scammer issue** - User \"solananes\" is impersonating team members and scamming people since May 2024 (Mentioned by DeFine)\n- **Fix JSON configuration syntax for plugins** with proper comma separation and nesting (Mentioned by Ruby)\n\n### Feature\n- **Consider WhatsApp client plugin for v2** - Request for WhatsApp integration in the next version (Mentioned by Fenil Modi)\n\n### Documentation\n- **Clarify Twitter API integration options** - Need to document whether normal Twitter API can be used or if it's browser-based only (Mentioned by AD)\n- **Improve file organization documentation** - Provide guidance on managing multiple projects and alternative file organization approaches (Implied from LemonS and Ruby's discussion)"
        },
        {
          "filename": "2025-04-24.md",
          "content": "# elizaOS Development Discord - 2025-04-24\n\n## Overall Discussion Highlights\n\n### Moderation & Security\n- Multiple instances of scammers impersonating team members (particularly Shaw) were reported\n- Users \"solanazo\" and \"solananes\" created threads to scam community members\n- Odilitime mentioned difficulties banning one of the impersonators\n- DeFine suggested implementing a moderation agent to help with scam detection\n\n### Development & Technical\n- Shaw shared a GitHub repository link (auto.fun)\n- Micha Vie mentioned their contributions through merged PRs and intention to continue contributing\n- Discussion about Twitter functionality in Eliza 2, including questions about AI-generated image posting\n- A question was raised about data persistence approaches in agent actions, specifically considering Prisma ORM\n- Brief mention of system architecture complexity in distributed systems\n\n### Project Management\n- Wolfy asked for confirmation on task ownership\n- LemonS raised concerns about file organization when working with multiple projects\n- Ruby suggested workspace directories with symlinks or environment variables as solutions\n\n### Branding & Resources\n- ElizaBAO requested branding assets for auto.fun\n- Nisita shared a Google Drive link containing logos and banners\n\n## Key Questions & Answers\n\n**Q: Is eliza 2 finally working with twitter?** (asked by AD)  \nA: Odilitime indicated there were \"Never had a problem with 1.x and Twitter\"\n\n**Q: Is there plugin for twitter API (not twitter client as android browser)?** (asked by AD)  \nA: Odilitime confirmed \"the client plugin-twitter uses does\"\n\n**Q: Do we have brandkit for autofun?** (asked by ElizaBAO🌟)  \nA: Nisita shared a Google Drive link with banners and logos\n\n**Q: The images is AI generate or someone design?** (asked by ElizaBAO🌟)  \nA: Odilitime replied \"someone designing and then using ai I think\"\n\n**Q: What's the best approach for file organization with multiple projects?** (asked by LemonS)  \nA: Ruby suggested using separate workspace directories with symlinks or utilizing environment variables to override default paths\n\n## Community Help & Collaboration\n\n1. **Branding Resources Sharing**\n   - ElizaBAO requested branding assets for auto.fun\n   - Nisita promptly shared a Google Drive folder with logos and banners\n\n2. **Role Upgrade for Contributor**\n   - Micha Vie mentioned their contributions and intention to continue\n   - Odilitime upgraded Micha Vie to contributor role to enable closer collaboration\n\n3. **File Organization Solutions**\n   - LemonS expressed frustration with default file organization\n   - Ruby offered two alternative approaches to improve workflow with multiple projects\n\n## Action Items\n\n### Technical\n- **Address impersonation/scam accounts in Discord server** (Mentioned by DeFine)\n  - Users \"solanazo\" and \"solananes\" impersonating Shaw and scamming users\n- **Follow up on ownership of unspecified tasks** (Mentioned by Wolfy)\n  - Confirm if certain team members want to own specific tasks\n\n### Feature\n- **Consider implementing a moderation agent** (Mentioned by DeFine)\n  - \"We really need an agent for looking at that stuff\" regarding scam detection\n- **Evaluate WhatsApp client plugin for v2** (Raised by Fenil Modi)\n  - No response yet, but identified as potential feature request\n\n### Documentation\n- **Provide system architecture details** (Requested by Ruby)\n  - inthiseconomy promised to check with their team for information\n- **Document file organization best practices** (Based on LemonS's feedback)\n  - Consider adding official guidance on managing multiple projects"
        }
      ]
    }
  },
  "github": {
    "stats": {
      "week": [
        {
          "filename": "stats_2025-04-27.json",
          "content": "{\n  \"interval\": {\n    \"intervalStart\": \"2025-04-27T00:00:00.000Z\",\n    \"intervalEnd\": \"2025-05-04T00:00:00.000Z\",\n    \"intervalType\": \"week\"\n  },\n  \"repository\": \"elizaos/eliza\",\n  \"overview\": \"From 2025-04-27 to 2025-05-04, elizaos/eliza had 31 new PRs (29 merged), 0 new issues, and 23 active contributors.\",\n  \"topIssues\": [\n    {\n      \"id\": \"I_kwDOMT5cIs6wW8do\",\n      \"title\": \"HOW do we block and ban interactions with specific accounts???\",\n      \"author\": \"coxnate87\",\n      \"number\": 4117,\n      \"repository\": \"elizaos/eliza\",\n      \"createdAt\": \"2025-03-30T11:01:28Z\",\n      \"closedAt\": null,\n      \"state\": \"OPEN\",\n      \"commentCount\": 1\n    },\n    {\n      \"id\": \"I_kwDOMT5cIs6wWHLr\",\n      \"title\": \"feat: Improving CLI tool instructions\",\n      \"author\": \"madjin\",\n      \"number\": 4113,\n      \"repository\": \"elizaos/eliza\",\n      \"createdAt\": \"2025-03-30T00:50:59Z\",\n      \"closedAt\": null,\n      \"state\": \"OPEN\",\n      \"commentCount\": 1\n    },\n    {\n      \"id\": \"I_kwDOMT5cIs6vPbyg\",\n      \"title\": \"import { generateText } from \\\"@elizaos/core\\\";    SyntaxError: The requested module '@elizaos/core' does not provide an export named 'generateText'\",\n      \"author\": \"ljiang22\",\n      \"number\": 4046,\n      \"repository\": \"elizaos/eliza\",\n      \"createdAt\": \"2025-03-22T05:13:29Z\",\n      \"closedAt\": null,\n      \"state\": \"OPEN\",\n      \"commentCount\": 1\n    },\n    {\n      \"id\": \"I_kwDOMT5cIs6zjFcA\",\n      \"title\": \"Quickstart doc issues\",\n      \"author\": \"eduardoPauloPanstein\",\n      \"number\": 4336,\n      \"repository\": \"elizaos/eliza\",\n      \"createdAt\": \"2025-04-22T23:13:59Z\",\n      \"closedAt\": null,\n      \"state\": \"OPEN\",\n      \"commentCount\": 1\n    },\n    {\n      \"id\": \"I_kwDOMT5cIs60B0QJ\",\n      \"title\": \"Cannot read properties of undefined (reading 'sendStandartTweet')\",\n      \"author\": \"srpiroliro\",\n      \"number\": 4365,\n      \"repository\": \"elizaos/eliza\",\n      \"createdAt\": \"2025-04-25T15:25:56Z\",\n      \"closedAt\": null,\n      \"state\": \"OPEN\",\n      \"commentCount\": 1\n    }\n  ],\n  \"topPRs\": [\n    {\n      \"id\": \"PR_kwDOMT5cIs6UUVjY\",\n      \"title\": \"Scoped knowledgefixes\",\n      \"author\": \"lalalune\",\n      \"number\": 4391,\n      \"repository\": \"elizaos/eliza\",\n      \"createdAt\": \"2025-04-29T10:02:52Z\",\n      \"mergedAt\": null,\n      \"additions\": 372438,\n      \"deletions\": 183811\n    },\n    {\n      \"id\": \"PR_kwDOMT5cIs6UaSBj\",\n      \"title\": \"add: Autofun Buy, and Sell through contract\",\n      \"author\": \"Freytes\",\n      \"number\": 4397,\n      \"repository\": \"elizaos/eliza\",\n      \"createdAt\": \"2025-04-29T20:49:52Z\",\n      \"mergedAt\": null,\n      \"additions\": 6649,\n      \"deletions\": 91\n    },\n    {\n      \"id\": \"PR_kwDOMT5cIs6UOLIz\",\n      \"title\": \"feat: Prepare 0.x for sharing plugins with 1.x\",\n      \"author\": \"odilitime\",\n      \"number\": 4384,\n      \"repository\": \"elizaos/eliza\",\n      \"createdAt\": \"2025-04-28T19:29:37Z\",\n      \"mergedAt\": null,\n      \"additions\": 4286,\n      \"deletions\": 245\n    },\n    {\n      \"id\": \"PR_kwDOMT5cIs6UHOtI\",\n      \"title\": \"Shaw/fix short replies\",\n      \"author\": \"lalalune\",\n      \"number\": 4374,\n      \"repository\": \"elizaos/eliza\",\n      \"createdAt\": \"2025-04-28T06:56:46Z\",\n      \"mergedAt\": \"2025-04-28T20:12:46Z\",\n      \"additions\": 3225,\n      \"deletions\": 635\n    },\n    {\n      \"id\": \"PR_kwDOMT5cIs6Sr_py\",\n      \"title\": \"update memory.ts to use the new schema\",\n      \"author\": \"jmikedupont2\",\n      \"number\": 4292,\n      \"repository\": \"elizaos/eliza\",\n      \"createdAt\": \"2025-04-15T15:04:56Z\",\n      \"mergedAt\": \"2025-04-28T02:41:01Z\",\n      \"additions\": 1298,\n      \"deletions\": 2\n    }\n  ],\n  \"codeChanges\": {\n    \"additions\": 6059,\n    \"deletions\": 21763,\n    \"files\": 140,\n    \"commitCount\": 92\n  },\n  \"completedItems\": [\n    {\n      \"title\": \"update memory.ts to use the new schema\",\n      \"prNumber\": 4292,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"Fix ESM type declarations in Core\",\n      \"prNumber\": 4341,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"Feat(plugin-discord): enable typing indicator\",\n      \"prNumber\": 4364,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"fix: issue with postgres db for docker containers. update gh action f…\",\n      \"prNumber\": 4363,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"Fix broken image paths\",\n      \"prNumber\": 4362,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"Fix: Correct broken Pump.fun link\",\n      \"prNumber\": 4367,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"(chore)plugin anthropic - test coverage and setup\",\n      \"prNumber\": 4370,\n      \"type\": \"tests\"\n    },\n    {\n      \"title\": \"fix: add default project text to create cli\",\n      \"prNumber\": 4369,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"fix: import issue for derive key provider\",\n      \"prNumber\": 4385,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix: Add API Key Validation for Anthropic Plugin Model Calls\",\n      \"prNumber\": 4383,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"fix: escape docker compose postgres healthcheck\",\n      \"prNumber\": 4382,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"feat(cli): update elizaos create command instructions\",\n      \"prNumber\": 4381,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"docs: updated quick start and intro cli commands\",\n      \"prNumber\": 4379,\n      \"type\": \"docs\"\n    },\n    {\n      \"title\": \"fix: update broken link to eliza-in-tee documentation\",\n      \"prNumber\": 4377,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix(core): type check crypto values\",\n      \"prNumber\": 4376,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix: (plugin-discord) stop throwing error when missing service\",\n      \"prNumber\": 4375,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"Shaw/fix short replies\",\n      \"prNumber\": 4374,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix: Cannot read properties of undefined (reading 'sendStandartTweet')\",\n      \"prNumber\": 4373,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"Fix broken image paths \",\n      \"prNumber\": 4372,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"Chore/remove pckg json plugin evm\",\n      \"prNumber\": 4399,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"chore: fix local llm throwing undefined error\",\n      \"prNumber\": 4396,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix: agent deletion\",\n      \"prNumber\": 4395,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"feat: add model/plugin name logging when model is used\",\n      \"prNumber\": 4394,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"chore: cleaner ui + other minor ui enhancements\",\n      \"prNumber\": 4393,\n      \"type\": \"refactor\"\n    },\n    {\n      \"title\": \"feat: scopable knowledge\",\n      \"prNumber\": 4390,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"fix : error handling for no space left in disk to users\",\n      \"prNumber\": 4389,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"feat: rebuild core and plugin-bootstrap if in mono repo context w/ dev command\",\n      \"prNumber\": 4388,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"feat: added .env.example in project-starter\",\n      \"prNumber\": 4387,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"chore: remove plugin evm from monorepo\",\n      \"prNumber\": 4386,\n      \"type\": \"other\"\n    }\n  ],\n  \"topContributors\": [\n    {\n      \"username\": \"wtfsayo\",\n      \"avatarUrl\": \"https://avatars.githubusercontent.com/u/82053242?u=98209a1f10456f42d4d2fa71db4d5bf4a672cbc3&v=4\",\n      \"totalScore\": 225.9039343298312,\n      \"prScore\": 215.76593432983123,\n      \"issueScore\": 0,\n      \"reviewScore\": 9.5,\n      \"commentScore\": 0.6379999999999999\n    },\n    {\n      \"username\": \"lalalune\",\n      \"avatarUrl\": \"https://avatars.githubusercontent.com/u/18633264?u=e2e906c3712c2506ebfa98df01c2cfdc50050b30&v=4\",\n      \"totalScore\": 148.7423216897283,\n      \"prScore\": 134.1043216897283,\n      \"issueScore\": 0,\n      \"reviewScore\": 14,\n      \"commentScore\": 0.6379999999999999\n    },\n    {\n      \"username\": \"0xbbjoker\",\n      \"avatarUrl\": \"https://avatars.githubusercontent.com/u/54844437?u=90fe1762420de6ad493a1c1582f1f70c0d87d8e2&v=4\",\n      \"totalScore\": 122.85992005951466,\n      \"prScore\": 122.08192005951466,\n      \"issueScore\": 0,\n      \"reviewScore\": 0,\n      \"commentScore\": 0.7779999999999999\n    },\n    {\n      \"username\": \"tcm390\",\n      \"avatarUrl\": \"https://avatars.githubusercontent.com/u/60634884?u=c6c41679b8322eaa0c81f72e0b4ed95e80f0ac16&v=4\",\n      \"totalScore\": 110.50183475374646,\n      \"prScore\": 84.36383475374646,\n      \"issueScore\": 0,\n      \"reviewScore\": 25.5,\n      \"commentScore\": 0.6379999999999999\n    },\n    {\n      \"username\": \"samarth30\",\n      \"avatarUrl\": \"https://avatars.githubusercontent.com/u/48334430?u=1fc119a6c2deb8cf60448b4c8961cb21dc69baeb&v=4\",\n      \"totalScore\": 90.45822285438663,\n      \"prScore\": 90.45822285438663,\n      \"issueScore\": 0,\n      \"reviewScore\": 0,\n      \"commentScore\": 0\n    }\n  ],\n  \"newPRs\": 31,\n  \"mergedPRs\": 29,\n  \"newIssues\": 0,\n  \"closedIssues\": 0,\n  \"activeContributors\": 23\n}"
        }
      ],
      "month": [
        {
          "filename": "stats_2025-04.json",
          "content": "{\n  \"interval\": {\n    \"intervalStart\": \"2025-04-01T00:00:00.000Z\",\n    \"intervalEnd\": \"2025-05-01T00:00:00.000Z\",\n    \"intervalType\": \"month\"\n  },\n  \"repository\": \"elizaos/eliza\",\n  \"overview\": \"From 2025-04-01 to 2025-05-01, elizaos/eliza had 232 new PRs (195 merged), 43 new issues, and 88 active contributors.\",\n  \"topIssues\": [\n    {\n      \"id\": \"I_kwDOMT5cIs6zmLBG\",\n      \"title\": \"the local model on plugin dev not work\",\n      \"author\": \"cxp-13\",\n      \"number\": 4339,\n      \"repository\": \"elizaos/eliza\",\n      \"createdAt\": \"2025-04-23T08:25:43Z\",\n      \"closedAt\": null,\n      \"state\": \"OPEN\",\n      \"commentCount\": 4\n    },\n    {\n      \"id\": \"I_kwDOMT5cIs6xo9Zj\",\n      \"title\": \"Provider Data Not Used When Posting to Twitter\",\n      \"author\": \"levsagiv\",\n      \"number\": 4224,\n      \"repository\": \"elizaos/eliza\",\n      \"createdAt\": \"2025-04-08T16:19:29Z\",\n      \"closedAt\": null,\n      \"state\": \"OPEN\",\n      \"commentCount\": 3\n    },\n    {\n      \"id\": \"I_kwDOMT5cIs6zjFcA\",\n      \"title\": \"Quickstart doc issues\",\n      \"author\": \"eduardoPauloPanstein\",\n      \"number\": 4336,\n      \"repository\": \"elizaos/eliza\",\n      \"createdAt\": \"2025-04-22T23:13:59Z\",\n      \"closedAt\": null,\n      \"state\": \"OPEN\",\n      \"commentCount\": 3\n    },\n    {\n      \"id\": \"I_kwDOMT5cIs6w2eyG\",\n      \"title\": \"How to run Eliza CLI?\",\n      \"author\": \"LinuxIsCool\",\n      \"number\": 4159,\n      \"repository\": \"elizaos/eliza\",\n      \"createdAt\": \"2025-04-02T17:20:34Z\",\n      \"closedAt\": null,\n      \"state\": \"OPEN\",\n      \"commentCount\": 2\n    },\n    {\n      \"id\": \"I_kwDOMT5cIs6qCQvW\",\n      \"title\": \"Suggestion: Add platform interface to core package for eliza v2\",\n      \"author\": \"roninjin10\",\n      \"number\": 3491,\n      \"repository\": \"elizaos/eliza\",\n      \"createdAt\": \"2025-02-14T05:30:55Z\",\n      \"closedAt\": null,\n      \"state\": \"OPEN\",\n      \"commentCount\": 2\n    }\n  ],\n  \"topPRs\": [\n    {\n      \"id\": \"PR_kwDOMT5cIs6UUVjY\",\n      \"title\": \"Scoped knowledgefixes\",\n      \"author\": \"lalalune\",\n      \"number\": 4391,\n      \"repository\": \"elizaos/eliza\",\n      \"createdAt\": \"2025-04-29T10:02:52Z\",\n      \"mergedAt\": null,\n      \"additions\": 372438,\n      \"deletions\": 183811\n    },\n    {\n      \"id\": \"PR_kwDOMT5cIs6Sgk4O\",\n      \"title\": \"fix: expose telegram types\",\n      \"author\": \"ncale\",\n      \"number\": 4286,\n      \"repository\": \"elizaos/eliza\",\n      \"createdAt\": \"2025-04-14T15:42:11Z\",\n      \"mergedAt\": null,\n      \"additions\": 317476,\n      \"deletions\": 183752\n    },\n    {\n      \"id\": \"PR_kwDOMT5cIs6RTQuv\",\n      \"title\": \"Plugin-Bootstrap Test Suite\",\n      \"author\": \"HarshModi2005\",\n      \"number\": 4171,\n      \"repository\": \"elizaos/eliza\",\n      \"createdAt\": \"2025-04-03T18:26:01Z\",\n      \"mergedAt\": null,\n      \"additions\": 308954,\n      \"deletions\": 183752\n    },\n    {\n      \"id\": \"PR_kwDOMT5cIs6Q-mLn\",\n      \"title\": \"fix: browserify-stream import\",\n      \"author\": \"wtfsayo\",\n      \"number\": 4138,\n      \"repository\": \"elizaos/eliza\",\n      \"createdAt\": \"2025-04-01T18:33:13Z\",\n      \"mergedAt\": null,\n      \"additions\": 297297,\n      \"deletions\": 183751\n    },\n    {\n      \"id\": \"PR_kwDOMT5cIs6ShQi0\",\n      \"title\": \"Feature/v2/dbml\",\n      \"author\": \"jmikedupont2\",\n      \"number\": 4288,\n      \"repository\": \"elizaos/eliza\",\n      \"createdAt\": \"2025-04-14T17:07:26Z\",\n      \"mergedAt\": null,\n      \"additions\": 296767,\n      \"deletions\": 183874\n    }\n  ],\n  \"codeChanges\": {\n    \"additions\": 55467,\n    \"deletions\": 37251,\n    \"files\": 489,\n    \"commitCount\": 828\n  },\n  \"completedItems\": [\n    {\n      \"title\": \"Clarify Terminology and Required Fields in Agent Settings\",\n      \"prNumber\": 4274,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \" UI Changes\",\n      \"prNumber\": 4273,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"Merge branch\",\n      \"prNumber\": 4271,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"feat: gui- support for importing JSON to create or update agents\",\n      \"prNumber\": 4270,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"Update .env.example to support twitter post generation\",\n      \"prNumber\": 4268,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"add missing bootstrap plguin to list\",\n      \"prNumber\": 4267,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"fix: cyclic error\",\n      \"prNumber\": 4266,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix: discord voice join/leave action \",\n      \"prNumber\": 4265,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix: discord actions small fix\",\n      \"prNumber\": 4264,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"remvoe dead-code around plugin install\",\n      \"prNumber\": 4263,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \" Replace Text Input with Dropdown for Voice Model Selection\",\n      \"prNumber\": 4262,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"Added: Instrumentation \",\n      \"prNumber\": 4261,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"feat: openai tts test\",\n      \"prNumber\": 4259,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"ELI2-185/reflections-agent-asks-all-other-agents-deployed-how-its-doing\",\n      \"prNumber\": 4257,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"fix: plugin install priority order\",\n      \"prNumber\": 4256,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"feat: openai tts\",\n      \"prNumber\": 4255,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"fix: replace deprecated vision model\",\n      \"prNumber\": 4254,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix: Move init after adapter.init in runtime\",\n      \"prNumber\": 4253,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"chore: improve cli and start code\",\n      \"prNumber\": 4250,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"chore(cli): use console log for non error cases\",\n      \"prNumber\": 4248,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"feat: message api\",\n      \"prNumber\": 4247,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"Bug: Remove Duplicate Declaration in api.ts\",\n      \"prNumber\": 4246,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix knowledge types\",\n      \"prNumber\": 4243,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"Fix GitHub Authentication Prompt During Start CLI Command\",\n      \"prNumber\": 4242,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"chore: cli cleanup-2\",\n      \"prNumber\": 4240,\n      \"type\": \"refactor\"\n    },\n    {\n      \"title\": \"chore: cli clean ups\",\n      \"prNumber\": 4239,\n      \"type\": \"refactor\"\n    },\n    {\n      \"title\": \"fix: gui tts\",\n      \"prNumber\": 4237,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix: transcription\",\n      \"prNumber\": 4236,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"chore: video understanding plugin tests \",\n      \"prNumber\": 4233,\n      \"type\": \"tests\"\n    },\n    {\n      \"title\": \"fix: Failed to Replies to Tweet in Interaction\",\n      \"prNumber\": 4231,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"Add OpenAi model usage events\",\n      \"prNumber\": 4230,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"fix: Duplicate Provider Section in Prompt\",\n      \"prNumber\": 4228,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"Fix relationship between entities and agents\",\n      \"prNumber\": 4223,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"Fix anthropic json parse issue\",\n      \"prNumber\": 4222,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fixed: agent subcommands\",\n      \"prNumber\": 4220,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"docs: Update README.md for telegram plugin\",\n      \"prNumber\": 4219,\n      \"type\": \"docs\"\n    },\n    {\n      \"title\": \"fix: add typescript to dev dep on plugin-starter\",\n      \"prNumber\": 4218,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"fix: small UI fix\",\n      \"prNumber\": 4217,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"chore: env loading is already handled + install packages locally\",\n      \"prNumber\": 4216,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"Feature/plugin venice\",\n      \"prNumber\": 4214,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"feat: Improve Reply Action to Use Pre-generated Responses\",\n      \"prNumber\": 4213,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"feat: skip should respond for dm\",\n      \"prNumber\": 4212,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"Starting Agent Fix \",\n      \"prNumber\": 4209,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"chore: update cli readme\",\n      \"prNumber\": 4208,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"fix openai object json parse error\",\n      \"prNumber\": 4207,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix: replace fastembed with local embedding model\",\n      \"prNumber\": 4205,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"chore: externalise fastembed and node-llama-cpp in local-ai\",\n      \"prNumber\": 4204,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"chore: remove remaining ollama references in local-ai plugin\",\n      \"prNumber\": 4203,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"chore: enhance plugin install strategy and code\",\n      \"prNumber\": 4202,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"Darkened borders and focus states in UI components\",\n      \"prNumber\": 4201,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"fixed: the docs issue with the add, remove and list plugin issue\",\n      \"prNumber\": 4200,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"issue: elizaos port unavailable issue resolved\",\n      \"prNumber\": 4199,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"initial commit for fixing delete character button\",\n      \"prNumber\": 4197,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"Fix runtime runtime.registerPlugin after initialization\",\n      \"prNumber\": 4189,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"chore: reduce chunk size & return only RAG fragments\",\n      \"prNumber\": 4188,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"feat: Add message buttons\",\n      \"prNumber\": 4187,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"fix: Eli2 134/make npm create eliza and npx elizaos create functionally identical\",\n      \"prNumber\": 4185,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"feat: Test Coverage for plugin-bootstrap\",\n      \"prNumber\": 4173,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"fixed: the issue with elizaos test command\",\n      \"prNumber\": 4196,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fixed: bun installation issue for plugin-bootstrap\",\n      \"prNumber\": 4194,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix: twitter interaction\",\n      \"prNumber\": 4192,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"chore: use camelCase on plugin export (local-ai)\",\n      \"prNumber\": 4186,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"chore: remove import logic from core\",\n      \"prNumber\": 4184,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"fix: version tag when importing plugins dynamically during runtime\",\n      \"prNumber\": 4183,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix: space action\",\n      \"prNumber\": 4182,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"handle dynamic-runtime import error gentler\",\n      \"prNumber\": 4179,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"attempt: module path issues\",\n      \"prNumber\": 4178,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"feat: better plugin install management\",\n      \"prNumber\": 4177,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"feat: Enhance CLI update and plugin installation with package manager…\",\n      \"prNumber\": 4176,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"fix: knowledge manager scroll issue\",\n      \"prNumber\": 4175,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"feat: add update-cli command\",\n      \"prNumber\": 4170,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"chore: Refactor openai plugin\",\n      \"prNumber\": 4169,\n      \"type\": \"refactor\"\n    },\n    {\n      \"title\": \"feat: add id to metadata source\",\n      \"prNumber\": 4168,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"fix: Failed to create Twitter client\",\n      \"prNumber\": 4167,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix: tg get world\",\n      \"prNumber\": 4166,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix: twitter interaction\",\n      \"prNumber\": 4165,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"Filter out ignored Farcaster mentioned\",\n      \"prNumber\": 4163,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"feat: enhance avatar stack\",\n      \"prNumber\": 4162,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"add node_modules to .gitignore\",\n      \"prNumber\": 4161,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"fixed: Pglite Migration issue\",\n      \"prNumber\": 4158,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"Improve Farcaster configuration handling\",\n      \"prNumber\": 4156,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"fix: cache interaction cursor + duplicate memory creation\",\n      \"prNumber\": 4155,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"chore: update temp. hardcoded v2 registry\",\n      \"prNumber\": 4153,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"tests: fixed test file according to the comments in the PR #4130 \",\n      \"prNumber\": 4152,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix: twitter, double memory creation attempt & server crash\",\n      \"prNumber\": 4151,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix: project plugin loading first, related to starter project\",\n      \"prNumber\": 4150,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"feat: use Evt instead of eventEmitter3\",\n      \"prNumber\": 4149,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"docs: removed an extra `~`\",\n      \"prNumber\": 4148,\n      \"type\": \"docs\"\n    },\n    {\n      \"title\": \"feat: clean api\",\n      \"prNumber\": 4144,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"fix: resolve database transaction deadlock\",\n      \"prNumber\": 4142,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"chore(deps): bump the npm_and_yarn group across 1 directory with 2 updates\",\n      \"prNumber\": 4141,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"Add ability to choose embedding model in OpenAI plugin\",\n      \"prNumber\": 4140,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"fix: starter project and audio util imports\",\n      \"prNumber\": 4139,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix: telegram to elizaos data model sync\",\n      \"prNumber\": 4137,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"docs: added raiinmaker to  .env.example\",\n      \"prNumber\": 4136,\n      \"type\": \"docs\"\n    },\n    {\n      \"title\": \"chore: remove unused packages\",\n      \"prNumber\": 4135,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"feat: tg community manager\",\n      \"prNumber\": 4134,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"chore: audio utils move to core\",\n      \"prNumber\": 4133,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"Chore/plugin publishing fixes\",\n      \"prNumber\": 4132,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix: payload sent to event handler\",\n      \"prNumber\": 4131,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"tests: Plugin evm tests fixed\",\n      \"prNumber\": 4130,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"chore: Cleanup browser plugin\",\n      \"prNumber\": 4129,\n      \"type\": \"refactor\"\n    },\n    {\n      \"title\": \"feat: Enhance telegram\",\n      \"prNumber\": 4128,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"feat: enhance tg logic with middlewares\",\n      \"prNumber\": 4125,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"chore: Update docs\",\n      \"prNumber\": 4114,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"Farcaster plugin for v2\",\n      \"prNumber\": 4096,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"Eli2 107/fix plugin publishing\",\n      \"prNumber\": 4095,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \" added extensive UI Tests\",\n      \"prNumber\": 4092,\n      \"type\": \"tests\"\n    },\n    {\n      \"title\": \"fix: tg onboard -WIP\",\n      \"prNumber\": 4091,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"chore: plugin browser test coverage and setup\",\n      \"prNumber\": 4051,\n      \"type\": \"tests\"\n    },\n    {\n      \"title\": \"chore: Fix missing comma in section headers list\",\n      \"prNumber\": 4038,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"chore: removed duplicate JSON import\",\n      \"prNumber\": 4030,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"fix: Fix template variable inconsistency in `twitterPostTemplate`\",\n      \"prNumber\": 4029,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"feat: Add Kluster AI as model provider\",\n      \"prNumber\": 3938,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"feat: Add Mem0 as AI SDK Provider\",\n      \"prNumber\": 3927,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"feat: add typing indicator to telegram\",\n      \"prNumber\": 4280,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"refactor: improve telegram markdown parsing\",\n      \"prNumber\": 4279,\n      \"type\": \"refactor\"\n    },\n    {\n      \"title\": \"fix: check if init exist before calling\",\n      \"prNumber\": 4278,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"Improvement: Default SQL and OpenAI Plugins for New Character\",\n      \"prNumber\": 4277,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"chore: remove deprecated types\",\n      \"prNumber\": 4275,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"fix: expose telegram types\",\n      \"prNumber\": 4287,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"feat: created world provider with basic world metadata\",\n      \"prNumber\": 4284,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"improve logging for transcription models\",\n      \"prNumber\": 4283,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"chore: update docs\",\n      \"prNumber\": 4281,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"fix: external depn issue\",\n      \"prNumber\": 4306,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix: remote attestation action\",\n      \"prNumber\": 4305,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"feat: cli-test-suite\",\n      \"prNumber\": 4301,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"feat: enhance gui\",\n      \"prNumber\": 4300,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"fix: ensure plugins\",\n      \"prNumber\": 4296,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"Added Stop agent button in agent settings\",\n      \"prNumber\": 4295,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"fix: use correct twitter post interval config in plugin-twitter package\",\n      \"prNumber\": 4294,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"Onboarding Tour and Enabling Disabling the Input Button\",\n      \"prNumber\": 4293,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"update memory.ts to use the new schema\",\n      \"prNumber\": 4292,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"feat: twitter plugin - Cleanup Unused Code and Support Long Tweets for Premium Accounts\",\n      \"prNumber\": 4291,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"fix: GUI Missing Requirement Indicator and Tooltips After Merge Conflict\",\n      \"prNumber\": 4307,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"Fix Typographical Error in Character.md\",\n      \"prNumber\": 4313,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"docs: remove consecutive duplicate words\",\n      \"prNumber\": 4312,\n      \"type\": \"docs\"\n    },\n    {\n      \"title\": \"Export bootstrap plugin capabilities\",\n      \"prNumber\": 4311,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"feat: add confirmation dialog for delete group\",\n      \"prNumber\": 4310,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"deleted duplicate README_NL.md\",\n      \"prNumber\": 4321,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"feat: Add deleteTweet()\",\n      \"prNumber\": 4320,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"fix: Use utils-based UUID for broader browser support\",\n      \"prNumber\": 4318,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix: persistent beacon by handling tour close action\",\n      \"prNumber\": 4317,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"Added Default Agents based on the org\",\n      \"prNumber\": 4323,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"Fix Typos and Improve Documentation in Changelog\",\n      \"prNumber\": 4322,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix: Plugin command normalize across v1 / v2\",\n      \"prNumber\": 4327,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"Fix hapi types issue\",\n      \"prNumber\": 4333,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix: Prevent repetitive agent replies\",\n      \"prNumber\": 4331,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix: openai stt\",\n      \"prNumber\": 4329,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix: gui - sync envs state with updated characterValue props\",\n      \"prNumber\": 4328,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"Feat: enable path params routes for plugins\",\n      \"prNumber\": 4335,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"docs: deploy Eliza to TEE with Oasis ROFL app\",\n      \"prNumber\": 4334,\n      \"type\": \"docs\"\n    },\n    {\n      \"title\": \"added bc .gitignore wasnt getting copied from plugin-starter\",\n      \"prNumber\": 4345,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"feat: skip display banner if not utf-8\",\n      \"prNumber\": 4344,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"Fix ESM type declarations in Core\",\n      \"prNumber\": 4341,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix: agent not found error after GUI creation and resolve merge conflict\",\n      \"prNumber\": 4337,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix: agent unregistration process with service stop handling\",\n      \"prNumber\": 4360,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix: small GUI fix\",\n      \"prNumber\": 4358,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"chore: add-any-provider-blog\",\n      \"prNumber\": 4356,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"chore: 📝 Add docstrings to `cloudflare-logging`\",\n      \"prNumber\": 4355,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"feat: bring back support for cloudflare llm logging/tracking\",\n      \"prNumber\": 4354,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"chore: refactor sidebar + general ui improvements\",\n      \"prNumber\": 4353,\n      \"type\": \"refactor\"\n    },\n    {\n      \"title\": \"fix: tts api\",\n      \"prNumber\": 4352,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix: cli start agent\",\n      \"prNumber\": 4351,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"feat: suggest upgrade cli\",\n      \"prNumber\": 4350,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"feat: support relative char path + other issues\",\n      \"prNumber\": 4349,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"feat: V2 QoL improvements\",\n      \"prNumber\": 4348,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"fix: agent null check\",\n      \"prNumber\": 4347,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"Feat(plugin-discord): enable typing indicator\",\n      \"prNumber\": 4364,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"fix: issue with postgres db for docker containers. update gh action f…\",\n      \"prNumber\": 4363,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"Fix broken image paths\",\n      \"prNumber\": 4362,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"Fix: Correct broken Pump.fun link\",\n      \"prNumber\": 4367,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"(chore)plugin anthropic - test coverage and setup\",\n      \"prNumber\": 4370,\n      \"type\": \"tests\"\n    },\n    {\n      \"title\": \"fix: add default project text to create cli\",\n      \"prNumber\": 4369,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"fix: import issue for derive key provider\",\n      \"prNumber\": 4385,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix: Add API Key Validation for Anthropic Plugin Model Calls\",\n      \"prNumber\": 4383,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"fix: escape docker compose postgres healthcheck\",\n      \"prNumber\": 4382,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"feat(cli): update elizaos create command instructions\",\n      \"prNumber\": 4381,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"docs: updated quick start and intro cli commands\",\n      \"prNumber\": 4379,\n      \"type\": \"docs\"\n    },\n    {\n      \"title\": \"fix: update broken link to eliza-in-tee documentation\",\n      \"prNumber\": 4377,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix(core): type check crypto values\",\n      \"prNumber\": 4376,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix: (plugin-discord) stop throwing error when missing service\",\n      \"prNumber\": 4375,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"Shaw/fix short replies\",\n      \"prNumber\": 4374,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix: Cannot read properties of undefined (reading 'sendStandartTweet')\",\n      \"prNumber\": 4373,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"Fix broken image paths \",\n      \"prNumber\": 4372,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"Chore/remove pckg json plugin evm\",\n      \"prNumber\": 4399,\n      \"type\": \"other\"\n    },\n    {\n      \"title\": \"chore: fix local llm throwing undefined error\",\n      \"prNumber\": 4396,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"fix: agent deletion\",\n      \"prNumber\": 4395,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"feat: add model/plugin name logging when model is used\",\n      \"prNumber\": 4394,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"chore: cleaner ui + other minor ui enhancements\",\n      \"prNumber\": 4393,\n      \"type\": \"refactor\"\n    },\n    {\n      \"title\": \"feat: scopable knowledge\",\n      \"prNumber\": 4390,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"fix : error handling for no space left in disk to users\",\n      \"prNumber\": 4389,\n      \"type\": \"bugfix\"\n    },\n    {\n      \"title\": \"feat: rebuild core and plugin-bootstrap if in mono repo context w/ dev command\",\n      \"prNumber\": 4388,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"feat: added .env.example in project-starter\",\n      \"prNumber\": 4387,\n      \"type\": \"feature\"\n    },\n    {\n      \"title\": \"chore: remove plugin evm from monorepo\",\n      \"prNumber\": 4386,\n      \"type\": \"other\"\n    }\n  ],\n  \"topContributors\": [\n    {\n      \"username\": \"wtfsayo\",\n      \"avatarUrl\": \"https://avatars.githubusercontent.com/u/82053242?u=98209a1f10456f42d4d2fa71db4d5bf4a672cbc3&v=4\",\n      \"totalScore\": 1707.4607351507161,\n      \"prScore\": 1647.6667351507162,\n      \"issueScore\": 4,\n      \"reviewScore\": 53,\n      \"commentScore\": 2.7939999999999996\n    },\n    {\n      \"username\": \"tcm390\",\n      \"avatarUrl\": \"https://avatars.githubusercontent.com/u/60634884?u=c6c41679b8322eaa0c81f72e0b4ed95e80f0ac16&v=4\",\n      \"totalScore\": 1239.42295481201,\n      \"prScore\": 1052.5309548120101,\n      \"issueScore\": 24.2,\n      \"reviewScore\": 159,\n      \"commentScore\": 3.6919999999999997\n    },\n    {\n      \"username\": \"0xbbjoker\",\n      \"avatarUrl\": \"https://avatars.githubusercontent.com/u/54844437?u=90fe1762420de6ad493a1c1582f1f70c0d87d8e2&v=4\",\n      \"totalScore\": 601.8608505705331,\n      \"prScore\": 594.9428505705331,\n      \"issueScore\": 0,\n      \"reviewScore\": 5,\n      \"commentScore\": 1.918\n    },\n    {\n      \"username\": \"Samarthsinghal28\",\n      \"avatarUrl\": \"https://avatars.githubusercontent.com/u/120447590?v=4\",\n      \"totalScore\": 451.5468509776701,\n      \"prScore\": 424.5468509776701,\n      \"issueScore\": 0,\n      \"reviewScore\": 27,\n      \"commentScore\": 0\n    },\n    {\n      \"username\": \"HarshModi2005\",\n      \"avatarUrl\": \"https://avatars.githubusercontent.com/u/142230924?u=64e337bbdb6b3aded5943b7e297759e7a3cfc0f0&v=4\",\n      \"totalScore\": 447.25391629300566,\n      \"prScore\": 374.8539162930057,\n      \"issueScore\": 0,\n      \"reviewScore\": 72,\n      \"commentScore\": 0.4\n    }\n  ],\n  \"newPRs\": 232,\n  \"mergedPRs\": 195,\n  \"newIssues\": 43,\n  \"closedIssues\": 35,\n  \"activeContributors\": 88\n}"
        }
      ]
    },
    "summaries": {
      "week": [
        {
          "filename": "2025-04-27.md",
          "content": "# ElizaOS Weekly Update (Week of Apr 27, 2025)\n\n## OVERVIEW\nThis week saw significant improvements to the ElizaOS framework with a focus on enhancing developer experience, fixing critical bugs, and improving plugin functionality. Key achievements include scopable knowledge implementation, Discord plugin enhancements, and comprehensive CLI command updates.\n\n## PROJECT METRICS\n- PRs: 29 merged PR's, 31 new PRs\n- Issues: 0 new issues, 0 closed issues\n- Unique Contributors: 23\n- Code Changes: +6059/-21763 lines across 140 files\n- Total Commits: 92\n- Most Active Contributors: wtfsayo, lalalune, 0xbbjoker, tcm390, samarth30\n\n## TOP ISSUES\n\n### Plugin Integration Challenges\n- Several issues related to plugin functionality were addressed, particularly with Discord, Anthropic, and Twitter integrations\n- Error handling improvements were needed for various edge cases, including disk space limitations\n\n### Developer Experience Friction\n- CLI command instructions required updates to improve clarity and usability\n- Documentation links and image paths needed fixing to ensure proper resource accessibility\n- Environment setup and configuration issues in Docker containers needed resolution\n\n## KEY TECHNICAL DEVELOPMENTS\n\n### Enhanced Plugin Functionality\n- Added typing indicator support in Discord plugin [#4364](https://github.com/elizaos/eliza/pull/4364)\n- Implemented API key validation for Anthropic plugin model calls [#4383](https://github.com/elizaos/eliza/pull/4383)\n- Fixed Discord plugin error handling when services are missing [#4375](https://github.com/elizaos/eliza/pull/4375)\n- Added model/plugin name logging when models are used [#4394](https://github.com/elizaos/eliza/pull/4394)\n\n### Improved Developer Experience\n- Implemented scopable knowledge functionality [#4390](https://github.com/elizaos/eliza/pull/4390)\n- Updated ElizaOS create command instructions [#4381](https://github.com/elizaos/eliza/pull/4381)\n- Added automatic rebuild of core and plugin-bootstrap in monorepo context [#4388](https://github.com/elizaos/eliza/pull/4388)\n- Added .env.example in project-starter for easier configuration [#4387](https://github.com/elizaos/eliza/pull/4387)\n- Fixed ESM type declarations in Core [#4341](https://github.com/elizaos/eliza/pull/4341)\n- Updated documentation with improved quick start and CLI commands [#4379](https://github.com/elizaos/eliza/pull/4379)\n\n### Infrastructure and Maintenance\n- Fixed Postgres database issues in Docker containers [#4363](https://github.com/elizaos/eliza/pull/4363)\n- Improved error handling for disk space limitations [#4389](https://github.com/elizaos/eliza/pull/4389)\n- Fixed agent deletion functionality [#4395](https://github.com/elizaos/eliza/pull/4395)\n- Removed plugin-evm from monorepo [#4386](https://github.com/elizaos/eliza/pull/4386), [#4399](https://github.com/elizaos/eliza/pull/4399)\n- Enhanced UI with cleaner design and minor improvements [#4393](https://github.com/elizaos/eliza/pull/4393)"
        }
      ],
      "month": [
        {
          "filename": "2025-04-01.md",
          "content": "# ElizaOS Monthly Update (April 2025)\n\n## OVERVIEW\nApril saw significant enhancements to ElizaOS with major improvements to the CLI, GUI, and plugin ecosystem. Key achievements include expanded AI model provider integrations, enhanced messaging capabilities, improved TTS functionality, and substantial fixes to core components and plugins.\n\n## PROJECT METRICS\n- PRs: 195 merged PR's, 232 new PRs\n- Issues: 43 new issues, 35 closed issues\n- Unique Contributors: 88\n- Code Changes: +55467/-37251 lines across 489 files\n- Total Commits: 828\n- Most Active Contributors: wtfsayo, tcm390, 0xbbjoker, Samarthsinghal28, HarshModi2005\n\n## TOP ISSUES\n\n### CLI Usability and Consistency\n- Command inconsistencies between v1 and v2\n- Installation and update workflow issues\n- Project creation and agent management challenges\n\n### Plugin Management\n- Plugin installation priority ordering issues\n- Dynamic loading and versioning problems\n- Plugin dependency conflicts\n\n### AI Model Integration\n- JSON parsing errors with Anthropic and OpenAI responses\n- Model validation and authentication issues\n- Embedding model selection and configuration\n\n### Database and Transaction Handling\n- Transaction deadlocks in database operations\n- Migration issues with PgLite\n- Entity relationship inconsistencies\n\n### Messaging and Communication\n- Duplicate message creation\n- Twitter interaction failures\n- Telegram data synchronization problems\n\n### User Interface\n- Knowledge manager scroll issues\n- Missing UI components after merge conflicts\n- Inconsistent character creation workflow\n\n### Performance and Resource Management\n- Disk space management and error handling\n- Memory leaks and caching issues\n- Runtime initialization sequence problems\n\n### Documentation and Onboarding\n- Inconsistent or outdated CLI documentation\n- Missing environment configuration examples\n- Broken documentation links\n\n## KEY TECHNICAL DEVELOPMENTS\n\n### Enhanced AI Model Provider Ecosystem\n- Added Kluster AI as a model provider [#3938](https://github.com/elizaos/eliza/pull/3938)\n- Added Mem0 as AI SDK Provider [#3927](https://github.com/elizaos/eliza/pull/3927)\n- Improved OpenAI plugin with ability to choose embedding models [#4140](https://github.com/elizaos/eliza/pull/4140)\n- Added model/plugin name logging when model is used [#4394](https://github.com/elizaos/eliza/pull/4394)\n\n### Voice and Speech Capabilities\n- Implemented OpenAI TTS functionality [#4255](https://github.com/elizaos/eliza/pull/4255)\n- Added testing for OpenAI TTS [#4259](https://github.com/elizaos/eliza/pull/4259)\n- Fixed speech-to-text transcription issues [#4236](https://github.com/elizaos/eliza/pull/4236)\n- Fixed OpenAI STT functionality [#4329](https://github.com/elizaos/eliza/pull/4329)\n\n### CLI Improvements\n- Added update-cli command for easier updates [#4170](https://github.com/elizaos/eliza/pull/4170)\n- Enhanced CLI update and plugin installation with package manager [#4176](https://github.com/elizaos/eliza/pull/4176)\n- Implemented CLI test suite [#4301](https://github.com/elizaos/eliza/pull/4301)\n- Updated ElizaOS create command instructions [#4381](https://github.com/elizaos/eliza/pull/4381)\n\n### Messaging and Interaction Enhancements\n- Added message API for improved communication [#4247](https://github.com/elizaos/eliza/pull/4247)\n- Added message buttons for interactive responses [#4187](https://github.com/elizaos/eliza/pull/4187)\n- Improved Reply Action to use pre-generated responses [#4213](https://github.com/elizaos/eliza/pull/4213)\n- Added typing indicators to Telegram [#4280](https://github.com/elizaos/eliza/pull/4280) and Discord [#4364](https://github.com/elizaos/eliza/pull/4364)\n\n### Plugin System Improvements\n- Better plugin installation management [#4177](https://github.com/elizaos/eliza/pull/4177)\n- Added test coverage for plugin-bootstrap [#4173](https://github.com/elizaos/eliza/pull/4173)\n- Enabled path params routes for plugins [#4335](https://github.com/elizaos/eliza/pull/4335)\n- Fixed plugin install priority order [#4256](https://github.com/elizaos/eliza/pull/4256)\n\n### GUI Enhancements\n- Added support for importing JSON to create or update agents [#4270](https://github.com/elizaos/eliza/pull/4270)\n- Enhanced GUI with various improvements [#4300](https://github.com/elizaos/eliza/pull/4300)\n- Added confirmation dialog for delete group [#4310](https://github.com/elizaos/eliza/pull/4310)\n- Implemented onboarding tour [#4293](https://github.com/elizaos/eliza/pull/4293)\n\n### Social Media Integration\n- Enhanced Telegram logic with middlewares [#4125](https://github.com/elizaos/eliza/pull/4125)\n- Added Telegram community manager [#4134](https://github.com/elizaos/eliza/pull/4134)\n- Improved Twitter plugin with support for long tweets [#4291](https://github.com/elizaos/eliza/pull/4291)\n- Added deleteTweet() functionality [#4320](https://github.com/elizaos/eliza/pull/4320)\n\n### Knowledge and Memory Management\n- Implemented scopable knowledge [#4390](https://github.com/elizaos/eliza/pull/4390)\n- Fixed knowledge types [#4243](https://github.com/elizaos/eliza/pull/4243)\n- Replaced fastembed with local embedding model [#4205](https://github.com/elizaos/eliza/pull/4205)\n- Fixed cache interaction cursor and duplicate memory creation [#4155](https://github.com/elizaos/eliza/pull/4155)\n\n### Logging and Monitoring\n- Added OpenAI model usage events [#4230](https://github.com/elizaos/eliza/pull/4230)\n- Restored support for Cloudflare LLM logging/tracking [#4354](https://github.com/elizaos/eliza/pull/4354)\n- Added docstrings to cloudflare-logging [#4355](https://github.com/elizaos/eliza/pull/4355)\n- Improved logging for transcription models [#4283](https://github.com/elizaos/eliza/pull/4283)\n\n## SUMMARY\nApril 2025 was a productive month for ElizaOS with significant improvements across the platform. The team expanded AI model provider integrations, enhanced messaging capabilities, improved voice and speech features, and fixed numerous issues in the core system and plugins. The CLI and GUI received substantial upgrades, making the platform more user-friendly and robust. These developments have strengthened ElizaOS's position as a versatile, modular AI agent framework capable of operating across diverse ecosystems."
        }
      ]
    }
  }
}
