{
  "ai-news": {
    "elizaos": {
      "discord_md_last_3_days": [
        {
          "filename": "2025-05-10.md",
          "content": "# elizaOS Discord - 2025-05-10\n\n## Overall Discussion Highlights\n\n### ElizaOS v2 Development Status\n- **Beta Status**: ElizaOS v2 is currently in beta and in developers' hands\n- **Release Timeline**: No hard deadline set; will be shipped \"when it's ready\"\n- **New Features**: Agents can now have custom tabs for plugins\n- **MCP Integration**: Three Multi-Chain Protocol plugins are currently on the development radar\n\n### Technical Implementation Challenges\n- **Local AI Integration**: Multiple users reported configuration issues with Ollama and LM Studio in the v2 beta\n- **Plugin Architecture**: Ollama support has been moved to a dedicated plugin requiring specific environment variables\n- **Text Embedding Limitations**: Current implementation may require OpenAI despite attempts to use alternatives like Ollama or Anthropic\n\n### Governance Evolution\n- Moving away from traditional DAO structures toward a new approach with ElizaOS at its core\n- Developing \"soft governance\" concepts (non on-chain voting) as an alternative model\n- Potential to create a governance blueprint for other projects\n\n## Key Questions & Answers\n\n### ElizaOS v2 Features & Timeline\n- **Q**: When is v2 coming?  \n  **A**: \"Thoon\" - The beta is in developers' hands with no hard deadline, will ship when ready\n\n- **Q**: Any MCP vision for ElizaOS?  \n  **A**: \"There's 3 MCP plugins on my radar at the moment\"\n\n- **Q**: What is ai16z soft governance?  \n  **A**: Non on-chain voting and beginning of engagement around governance, rethinking traditional DAO approaches\n\n### Technical Configuration\n- **Q**: How do I configure local Ollama models in ElizaOS beta?  \n  **A**: You need to use the dedicated Ollama plugin with specific environment variables like OLLAMA_API_ENDPOINT, OLLAMA_SMALL_MODEL, etc.\n\n- **Q**: What's causing the \"StudioLM text generation error: fetch failed\" with LM Studio?  \n  **A**: Make sure the models are available in LM Studio\n\n- **Q**: How can I set up ElizaOS v2 to not respond to everything on Twitter/X and only reply when tagged?  \n  **A**: Changing your character name might help as it can be confusing to LLM, and adding action examples in your configuration\n\n## Community Help & Collaboration\n\n### Local AI Model Integration\n- **bob_the_spounge** helped **Void** with configuring Ollama with ElizaOS beta by providing the correct environment variable format and explaining that Ollama was moved to its own plugin\n- **bob_the_spounge** assisted **Sthx** with Twitter/X integration issues, suggesting configuration changes to avoid spam detection and bans\n\n### Development Support\n- **Patt** and **Kenk** directed **Void** to appropriate resources for launching a local Eliza agent, pointing to the #dev-support channel for technical assistance\n- **bob_the_spounge** shared troubleshooting steps for LM Studio errors, suggesting to check if models are properly available\n\n## Action Items\n\n### Technical\n- Install Ollama plugin separately with \"elizaos create\" then add plugin to character configuration (mentioned by bob_the_spounge)\n- Configure Ollama environment variables correctly (OLLAMA_API_ENDPOINT, OLLAMA_SMALL_MODEL, etc.) (mentioned by bob_the_spounge)\n- Ensure models are available in LM Studio before attempting to use them (mentioned by bob_the_spounge)\n- Implement custom tabs for plugins in agents (mentioned by shaw)\n- Develop and integrate MCP plugins (3 mentioned) (mentioned by Kenk)\n\n### Documentation\n- Document the proper way to install and configure the Ollama plugin (mentioned by bob_the_spounge)\n- Provide guidance for launching local Eliza agents (mentioned by Void)\n\n### Feature\n- Develop ElizaOS v2 with improved capabilities (mentioned by multiple users)\n- Create new governance model as alternative to traditional DAOs with ElizaOS at core (mentioned by Kenk)\n- Support text embedding with providers other than OpenAI (mentioned by bob_the_spounge)\n- Creation of a crypto-western cyberpunk story experience in Hyperfy with locations like Degen Bar, Rugpull Hill, and Rugpull County Jail (mentioned by Dr. Neuro)"
        },
        {
          "filename": "2025-05-09.md",
          "content": "# elizaOS Discord - 2025-05-09\n\n## Overall Discussion Highlights\n\n### ElizaOS Development\n- **V2 Release Teaser**: Multiple mentions of an upcoming ElizaOS V2 release with limited details shared\n- **GitHub Contribution Tracking**: Discussion about the elizaOS.github.io repository which tracks contributions and includes a leaderboard functionality\n- **Plugin Development Challenges**: Users reported difficulties importing plugins from external GitHub repositories due to hardcoded assumptions about repository locations\n- **Database Configuration Issues**: Several users encountered problems with PostgreSQL configurations and database migrations, particularly with Neon as a provider\n\n### Token Ecosystem\n- **Auto.fun Platform Concerns**: Significant user frustration about recent token launches perceived as \"rugs\" (projects that quickly lose value)\n- **ELI5 Token Discussion**: Mixed sentiment about ELI5 token, with some users highlighting its potential connection to elizaOS v2 as \"AI16z's brother\"\n- **Platform Improvements**: Team member \"ben\" acknowledged feedback about the auto.fun platform and mentioned improvements are underway\n- **Support Channel Migration**: Announcement that auto.fun support is moving from Discord to Telegram (@AutoDotFunBot) within 48 hours\n\n### Technical Issues\n- **Leaderboard Pagination**: PR (#92) created to fix pagination issues on the contribution leaderboard website\n- **Plugin Dependencies**: Users reported missing dependencies (@elizaos/plugin-tee and @elizaos/plugin-trustdb) for the Solana plugin\n- **Memory-Related Crashes**: Twitter plugin causing \"Maximum call stack size exceeded\" errors\n- **LMStudio Integration Errors**: Users experiencing problems integrating LMStudio with ElizaOS\n\n## Key Questions & Answers\n\n### ElizaOS Technical\n- **Q**: How can I connect my GitHub and SOL wallet for future airdrops?  \n  **A** (jin): \"We don't have a fully deployed solution for doing that yet\"\n\n- **Q**: What's the link to the leaderboard?  \n  **A** (jin): \"https://elizaos.github.io/\"\n\n- **Q**: Why am I not on the leaderboard?  \n  **A** (jin): \"Search should be top 1000 / no limit, considering that a bug\"\n\n- **Q**: When eliza agent is monitoring/responding in multiple servers do we want each server to be its own world?  \n  **A** (Kenk): \"In v2 it will be able to use the same memory across multiple client interfaces\"\n\n- **Q**: Is eliza.gg down?  \n  **A** (Kenk): \"Use Eliza.how instead\"\n\n### Token-Related\n- **Q**: How did you determine % for decentralized 60-70?  \n  **A** (Osint): \"That's standard, 60-70 percent for top 100 token holders\"\n\n- **Q**: Are we looking for binance spot listing through any way?  \n  **A** (Osint): \"That is something that we have no control of. When they decide it is in their best interest to list ai16z spot, then they'll do it\"\n\n- **Q**: What do you mean by \"based off the Reddit Eli5 community with 15M members\"?  \n  **A** (ryanthelad): \"Look up r/explainlikeimfive on Reddit, 23.2 Million Followers. All of them will be onboarded to Eli5\"\n\n- **Q**: Is there any advantage for us that hold 10k or more ai16z?  \n  **A** (!Addison Casey!): \"No info about that yet\"\n\n## Community Help & Collaboration\n\n1. **Leaderboard Visibility Issues**\n   - **Helper**: jin\n   - **Helpee**: MonteCrypto\n   - **Context**: User couldn't find themselves on the leaderboard\n   - **Resolution**: Jin provided a direct profile link and acknowledged search limitation as a bug\n\n2. **Leaderboard Pagination Fix**\n   - **Helper**: MonteCrypto\n   - **Helpee**: Community\n   - **Context**: Pagination issues on the leaderboard website\n   - **Resolution**: Created PR #92 to fix pagination and make all contributors visible\n\n3. **Plugin Import Problems**\n   - **Helper**: Odilitime\n   - **Helpee**: BowTiedBlueFin\n   - **Context**: Issues with importing plugins from external GitHub repositories\n   - **Resolution**: Acknowledged the issue with 1.x plugins and mentioned instructions would be published the following week\n\n4. **Database Migration Errors**\n   - **Helper**: scooter8992 (self-help)\n   - **Context**: Database migration errors with Neon PostgreSQL\n   - **Resolution**: Created a new project in Neon to get a fresh database, which resolved the issue\n\n5. **ELI5 Token Information**\n   - **Helper**: ryanthelad and xell0x\n   - **Helpee**: Channel members\n   - **Context**: Declining sentiment about ELI5 token\n   - **Resolution**: Shared positive information about ELI5 being AI16z's little brother and an official character in elizaOS v2\n\n## Action Items\n\n### Technical\n1. **Fix leaderboard search functionality** - Make search include all contributors beyond top 100 (Mentioned by jin)\n2. **Add pagination to leaderboard** - Show all profiles on leaderboard instead of just top 100 (Mentioned by MonteCrypto)\n3. **Develop GitHub-SOL wallet connection solution** - For tracking contributions and future airdrops (Mentioned by jin)\n4. **Fix plugin resolution logic** - Properly handle GitHub URLs from package.json for plugins outside the elizaos-plugins organization (Mentioned by BowTiedBlueFin)\n5. **Address fs4.exists error** - Fix error in ElizaOS configuration saving (Mentioned by scooter8992)\n6. **Fix memory leak in Twitter plugin** - Resolve \"Maximum call stack size exceeded\" errors (Mentioned by scooter8992)\n7. **Resolve missing dependencies** - Fix @elizaos/plugin-tee and @elizaos/plugin-trustdb dependencies for the Solana plugin (Mentioned by scooter8992)\n8. **Improve token verification process** - Prevent misleading information about token distribution (Mentioned by frank_grimes_sr)\n9. **Make migration speed consistent** - Standardize migration speed for all coins or wait for green checkmark before migration (Mentioned by frank_grimes_sr)\n\n### Documentation\n1. **Add leaderboard link to contributing docs** - Link needs to be added to https://eliza.how/docs/contributing (Mentioned by MonteCrypto)\n2. **Update frontpage of eliza.how** - Add partners, videos, leaderboard, plugins links for better quick actions (Mentioned by jin)\n3. **Publish plugin development instructions** - Create documentation for plugin development and integration with ElizaOS (Mentioned by Odilitime)\n4. **Provide clearer token distribution information** - Improve transparency before launches (Mentioned by vas)\n5. **Create transparency around verification process** - Document how tokens get verified status (Mentioned by frank_grimes_sr)\n6. **Document support channel migration** - Users need to migrate to Telegram (@AutoDotFunBot) for support (Mentioned by Kenk)\n\n### Feature\n1. **Extend autodotfun functionality to Twitter** - Enable launching tokens from Twitter with commands (Mentioned by Osint)\n2. **Improve AI-news aggregator** - Jin discovered ways to make it 2-3x better (Mentioned by jin)\n3. **ElizaOS V2 development** - Upcoming major update teased in chat (Mentioned by Multiple users)\n4. **Implement time-based caching** - For facts/provider knowledge in state (Mentioned by scooter8992)\n5. **Support cross-interface memory** - Allow agents to use the same memory across multiple client interfaces in v2 (Mentioned by Kenk)\n6. **Allow more verified launches** - Enable more launches to apply for verified status after first round of launch partners (Mentioned by ryanthelad)"
        }
      ],
      "dev_md_last_3_days": [
        {
          "filename": "2025-05-10.md",
          "content": "# elizaOS Development Discord - 2025-05-10\n\n## Overall Discussion Highlights\n\n### Plugin Development Issues\n- User **lantianlaoli** reported issues with their custom plugin \"quokkaStep\" that builds on Raydium\n- The plugin is failing to recognize specific actions like \"GENERATE_RAYDIUM_CLMM_CONFIG\" and defaulting to \"CONTINUE\" action\n- The plugin previously worked with OpenRouter but is experiencing issues after switching to the Gemini model\n\n### Documentation Systems\n- **Shaw** mentioned the project has an autodoc package that generates documentation automatically in CI\n- Documentation approach includes a mix of hand-written docs and AI-generated content to fill gaps\n\n## Key Questions & Answers\nNo resolved questions were reported in today's discussions.\n\n## Community Help & Collaboration\n- **Kenk** assisted **lantianlaoli** with Eliza agent configuration issues by directing them to www.eliza.how for further assistance\n\n## Action Items\n\n### Technical\n- Investigate why custom action \"GENERATE_RAYDIUM_CLMM_CONFIG\" is being interpreted as \"CONTINUE\" after switching from OpenRouter to Gemini (Mentioned by: lantianlaoli)\n\n### Documentation\n- Check autodoc package for documentation generation (Mentioned by: Shaw)"
        },
        {
          "filename": "2025-05-09.md",
          "content": "# elizaOS Development Discord - 2025-05-09\n\n## Overall Discussion Highlights\n\n### Token and Project Updates\n- Community members discussed potential token launches for projects ELI5, EDDY, and AI16Z on the auto.fun platform\n- Team members (Odilitime and funboy) clarified that no new token launches are currently planned\n- Questions about EDDY's functionality were raised but remained unanswered\n\n### Development Tools\n- Brief discussion about documentation generation methods used by the team\n- Mention of an ElizaOS WordPress plugin, though noted as not being state-of-the-art\n- A freelance developer offered services related to blockchain development, including token creation and smart contract writing\n\n## Key Questions & Answers\n\n| Question | Answer | Asked By | Answered By |\n|----------|--------|----------|------------|\n| Will token launches be paired with ELI5 or EDDY or only AI16Z? | No token launches | Sidtoshi Vision | Odilitime |\n| Does org project will it have its own coin or just update of ai16z? | No new tokens are planned afaik | Mazino | Odilitime |\n\n## Community Help & Collaboration\n\n- **Documentation Resources**: funboy shared a link to an ElizaOS WordPress plugin in response to Hummus's question about documentation generation methods\n\n## Action Items\n\n### Documentation\n- Provide clear information about the purpose and functionality of ELI5 and EDDY tokens (mentioned by Sidtoshi Vision)\n- Explain the documentation generation process used by the team (mentioned by Hummus)\n- Clarify plans regarding token launches and updates for the community (mentioned by Sidtoshi Vision, Mazino)\n\n---\n\n*Note: Today's discussions were relatively light, with minimal technical problem-solving or implementation discussions. Several questions remained unanswered, suggesting potential topics for future clarification from the team.*"
        }
      ]
    }
  },
  "github": {
    "summaries": {
      "week": [
        {
          "filename": "2025-05-04.md",
          "content": "# ElizaOS Weekly Update (Week of May 4, 2025)\n\n## OVERVIEW\nThis week focused on significant CLI improvements, plugin system enhancements, and codebase cleanup. Major progress was made in documentation, type safety, and performance optimization, particularly for agent loading and plugin management.\n\n## PROJECT METRICS\n- PRs: 58 merged PR's, 76 new PRs\n- Issues: 4 new issues, 5 closed issues\n- Unique Contributors: 44\n- Code Changes: +11558/-15419 lines across 294 files\n- Total Commits: 289\n- Most Active Contributors: wtfsayo, 0xbbjoker, ChristopherTrimboli, K1mc4n, odilitime\n\n## TOP ISSUES\n\n### Plugin System Compatibility\n- Cross-version plugin compatibility between 0.x and 1.x versions\n- Plugin loading performance issues with large numbers of agents\n- Plugin route functionality not working correctly\n\n### CLI and Developer Experience\n- Incorrect version detection in CLI showing wrong latest version\n- Issues with plugin installation commands\n- Platform-specific problems with CLI commands and environment handling\n\n## KEY TECHNICAL DEVELOPMENTS\n\n### Plugin System Enhancements\n- Prepared 0.x for sharing plugins with 1.x version [#4384](https://github.com/elizaos/eliza/pull/4384)\n- Added model usage events for embeddings and image description in OpenAI plugin [#4438](https://github.com/elizaos/eliza/pull/4438)\n- Fixed plugin routes functionality [#4415](https://github.com/elizaos/eliza/pull/4415)\n- Significantly improved agent loading performance when handling many agents [#4519](https://github.com/elizaos/eliza/pull/4519)\n\n### Documentation and Code Quality\n- Added comprehensive docstrings to multiple components [#4446](https://github.com/elizaos/eliza/pull/4446), [#4469](https://github.com/elizaos/eliza/pull/4469), [#4498](https://github.com/elizaos/eliza/pull/4498)\n- Updated documentation to prefer direct usage instead of npx [#4493](https://github.com/elizaos/eliza/pull/4493)\n- Fixed broken documentation links [#4460](https://github.com/elizaos/eliza/pull/4460)\n- Added blog for Twitter agent setup [#4425](https://github.com/elizaos/eliza/pull/4425)\n\n### Codebase Cleanup and Optimization\n- Refactored and enhanced the ElizaOS publish CLI command [#4424](https://github.com/elizaos/eliza/pull/4424)\n- Improved environment variable handling [#4445](https://github.com/elizaos/eliza/pull/4445)\n- Fixed JSON parsing issues with nested objects [#4198](https://github.com/elizaos/eliza/pull/4198)\n- Implemented strict types and DTS generation for plugin-bootstrap [#4504](https://github.com/elizaos/eliza/pull/4504)\n- Integrated real Drizzle ORM for database operation types [#4500](https://github.com/elizaos/eliza/pull/4500)"
        }
      ],
      "month": [
        {
          "filename": "2025-05-01.md",
          "content": "# ElizaOS Monthly Update (May 2025)\n\n## OVERVIEW\nMay saw significant progress in ElizaOS with a focus on plugin architecture improvements, performance optimization, and codebase cleanup. The team streamlined the monorepo by removing several plugins while enhancing core functionality and fixing critical bugs in the CLI and plugin system.\n\n## PROJECT METRICS\n- PRs: 74 merged PR's, 105 new PRs\n- Issues: 7 new issues, 12 closed issues\n- Unique Contributors: 50\n- Code Changes: +12838/-24412 lines across 387 files\n- Total Commits: 420\n- Most Active Contributors: wtfsayo, 0xbbjoker, ChristopherTrimboli, yungalgo, K1mc4n\n\n## TOP ISSUES\n\n### Plugin Compatibility\n- Ensuring plugins work seamlessly across different versions\n- Addressing plugin loading and installation issues\n- Resolving plugin route functionality problems\n\n### CLI Command Improvements\n- Incorrect version detection in CLI tools\n- Issues with publish CLI command options\n- Missing .gitignore in plugins created with global CLI installation\n\n### Performance Bottlenecks\n- Slow agent loading when many agents are present\n- Optimization needed for core operations\n\n### Type System Challenges\n- ESM type generation issues in multiple packages\n- Runtime type inconsistencies\n- Need for stricter typing across the codebase\n\n### Authentication & Security\n- Implementation of proper authentication middleware\n- API key management and authorization flows\n\n### Database Operations\n- PGLite directory configuration issues\n- Need for improved ORM integration\n\n### UI/UX Issues\n- Client scrollbar problems\n- Text handling and escaping issues\n\n### Documentation Gaps\n- Broken documentation links\n- Outdated installation instructions\n- Need for better docstrings in core modules\n\n## KEY TECHNICAL DEVELOPMENTS\n\n### Plugin Architecture Enhancements\n- Prepared 0.x for sharing plugins with 1.x [#4384](https://github.com/elizaos/eliza/pull/4384)\n- Extended OpenAI plugin to support custom embedding endpoints [#4421](https://github.com/elizaos/eliza/pull/4421)\n- Implemented model usage events for embeddings and image description [#4438](https://github.com/elizaos/eliza/pull/4438)\n- Fixed plugin routes functionality [#4415](https://github.com/elizaos/eliza/pull/4415)\n\n### Performance Optimizations\n- Significantly improved agent loading speed when handling many agents [#4519](https://github.com/elizaos/eliza/pull/4519)\n- Implemented cleaner plugin loading code [#4478](https://github.com/elizaos/eliza/pull/4478)\n- Optimized Express object creation [#4414](https://github.com/elizaos/eliza/pull/4414)\n\n### CLI Improvements\n- Fixed incorrect version detection to show correct latest CLI version [#4435](https://github.com/elizaos/eliza/pull/4435)\n- Refactored and enhanced the publish CLI command [#4424](https://github.com/elizaos/eliza/pull/4424)\n- Fixed plugin installation command issues [#4456](https://github.com/elizaos/eliza/pull/4456)\n- Added missing .gitignore in plugins created with global CLI [#4489](https://github.com/elizaos/eliza/pull/4489)\n\n### Social Integration Features\n- Added Twitter timeline functionality [#4429](https://github.com/elizaos/eliza/pull/4429)\n- Created blog for Twitter agent setup [#4425](https://github.com/elizaos/eliza/pull/4425)\n- Fixed and cleaned up Twitter plugin [#4430](https://github.com/elizaos/eliza/pull/4430)\n\n### Authentication & Security\n- Added authentication middleware and API key dialog for unauthorized users [#4420](https://github.com/elizaos/eliza/pull/4420)\n- Fixed Discord service unregister timeout [#4450](https://github.com/elizaos/eliza/pull/4450)\n\n### Database Improvements\n- Implemented unique PGLite folder if not provided [#4423](https://github.com/elizaos/eliza/pull/4423)\n- Fixed PGLite directory issues [#4497](https://github.com/elizaos/eliza/pull/4497)\n- Integrated real Drizzle ORM for database operation types [#4500](https://github.com/elizaos/eliza/pull/4500)\n\n### Codebase Cleanup\n- Removed multiple plugins from monorepo to streamline maintenance [#4406](https://github.com/elizaos/eliza/pull/4406), [#4402](https://github.com/elizaos/eliza/pull/4402), [#4439](https://github.com/elizaos/eliza/pull/4439)\n- Refactored environment variable handling [#4445](https://github.com/elizaos/eliza/pull/4445)\n- Organized imports and implemented relative paths [#4447](https://github.com/elizaos/eliza/pull/4447)\n\n### Documentation Enhancements\n- Added comprehensive docstrings to multiple modules [#4446](https://github.com/elizaos/eliza/pull/4446), [#4469](https://github.com/elizaos/eliza/pull/4469), [#4498](https://github.com/elizaos/eliza/pull/4498)\n- Updated documentation to prefer direct usage instead of npx [#4493](https://github.com/elizaos/eliza/pull/4493)\n- Fixed broken documentation links [#4460](https://github.com/elizaos/eliza/pull/4460)\n\n## SUMMARY\nMay 2025 was a productive month for ElizaOS with significant improvements to the plugin architecture, CLI functionality, and overall performance. The team successfully streamlined the codebase by removing several plugins from the monorepo while enhancing core features like authentication, Twitter integration, and database operations. These changes have laid a solid foundation for the upcoming 1.x compatibility and improved the developer experience across the platform."
        }
      ]
    }
  }
}
