{
  "ai-news": {
    "elizaos": {
      "discord_md_last_3_days": [
        {
          "filename": "2025-05-11.md",
          "content": "# elizaOS Discord - 2025-05-11\n\n## Overall Discussion Highlights\n\n### Development & Technical Issues\n- Several users reported issues with the Eliza agent setup, particularly around environment configuration and plugin integration\n- Problems with API connectivity in WSL2 were discussed, where Postman requests worked but backend-to-backend calls failed with 502 errors\n- Users encountered challenges with local AI models being downloaded despite environment settings to use external models\n- Plugin installation and build errors were reported, particularly with the Twitter plugin\n- Discord integration configuration problems were mentioned by multiple users\n\n### Community & Project Updates\n- The team is seeking beta testers for an unspecified project\n- Shaw mentioned challenges with collecting contributor wallet addresses for a potential airdrop\n- There's ongoing work on tooling to better collect contributor wallets in the future\n- A request for Rust developers was posted\n\n### Cryptocurrency Discussions\n- Users discussed price movements of tokens like COM and ELI5 on the auto.fun platform\n- COM reportedly reached all-time highs due to promotion by an influencer with 50,000 followers\n- Nick dask advised taking profits at the all-time high, warning about potential retracement\n- Discussion about a potential community meme launch on autofun, with wire offering to lead it with a team of artists\n- User \"gummy\" reported issues with claiming fees from dev wallet creation\n\n## Key Questions & Answers\n\n**Q: Any news about DOOD airdrop?**  \nA: \"I have no idea about dood airdrop tbh\" (Osint) and \"i have no info on the airdrop though, sorry\" (shaw)\n\n**Q: How to install the new version of eliza on windows?**  \nA: WSL is recommended (Deniz)\n\n**Q: How can I use LLM from OpenAI or grok instead of llama?**  \nA: modelProvider is no longer used in newer versions, you need to set all required values in .env file and include the plugins in your characterfile (scooter8992)\n\n**Q: Does anyone know why COM is running?**  \nA: Because a KOL (key opinion leader) with 50k followers called it. (Nick dask)\n\n**Q: Who is launching today?**  \nA: It's the weekend. (Osint)\n\n## Community Help & Collaboration\n\n1. **Environment Configuration Help**\n   - **Helper:** scooter8992\n   - **Helpee:** pupathebig\n   - **Context:** Twitter plugin not respecting TWITTER_DRY_RUN=true setting\n   - **Resolution:** Suggested adding LOG_LEVEL=debug to .env and checking Discord gateway intents\n\n2. **Discord Integration Debugging**\n   - **Helper:** scooter8992\n   - **Helpee:** scooter8992\n   - **Context:** Discord client not loading when agent starts\n   - **Resolution:** Suggested adding runtime event listener code to debug Discord connection\n\n3. **Proper Configuration File Placement**\n   - **Helper:** scooter8992\n   - **Helpee:** scooter8992\n   - **Context:** Proper .env file placement\n   - **Resolution:** Clarified that .env should be in the root folder, which improved CLI output\n\n4. **Airdrop Wallet Collection Explanation**\n   - **Helper:** shaw\n   - **Helpee:** sukrucildirr\n   - **Context:** Explaining the situation with wallet collection for airdrops\n   - **Resolution:** Explained they asked for wallets last minute and are working on tooling for future wallet collection\n\n5. **Cryptocurrency Trading Advice**\n   - **Helper:** Nick dask\n   - **Helpee:** hxf\n   - **Context:** hxf asked why COM token was running in price\n   - **Resolution:** Nick explained it was due to a key opinion leader with 50k followers promoting it, and warned about potential manipulation due to 60% being held by one holder\n\n## Action Items\n\n### Technical\n- Fix Twitter plugin to properly respect TWITTER_DRY_RUN=true setting (mentioned by pupathebig)\n- Investigate 502 error when backend service calls Eliza API while Postman works (mentioned by scooter8992)\n- Fix issue with local models being downloaded despite configuration for external models (mentioned by scooter8992)\n- Fix plugin build error: \"Module '@elizaos/core-plugin-v1' has no exported member 'Plugin'\" (mentioned by pupathebig)\n- Fix issue with claiming fees from dev wallet creation (mentioned by gummy)\n- Working on tooling to collect contributor wallets (mentioned by shaw)\n\n### Documentation\n- Create guide for proper environment configuration to use external models instead of local ones (mentioned by scooter8992)\n- Document global configuration file location and purpose (mentioned by scooter8992)\n\n### Feature\n- Implement option to restrict Twitter bot to only post and reply to tagged messages (mentioned by Sthx)\n- Beta testers recruitment for an unspecified project (mentioned by Blazo101)\n- Organize a community meme launch on autofun with a team of artists (mentioned by wire)"
        },
        {
          "filename": "2025-05-10.md",
          "content": "# elizaOS Discord - 2025-05-10\n\n## Overall Discussion Highlights\n\n### ElizaOS v2 Development Status\n- **Beta Status**: ElizaOS v2 is currently in beta and in developers' hands\n- **Release Timeline**: No hard deadline set; will be shipped \"when it's ready\"\n- **New Features**: Agents can now have custom tabs for plugins\n- **MCP Integration**: Three Multi-Chain Protocol plugins are currently on the development radar\n\n### Technical Implementation Challenges\n- **Local AI Integration**: Multiple users reported configuration issues with Ollama and LM Studio in the v2 beta\n- **Plugin Architecture**: Ollama support has been moved to a dedicated plugin requiring specific environment variables\n- **Text Embedding Limitations**: Current implementation may require OpenAI despite attempts to use alternatives like Ollama or Anthropic\n\n### Governance Evolution\n- Moving away from traditional DAO structures toward a new approach with ElizaOS at its core\n- Developing \"soft governance\" concepts (non on-chain voting) as an alternative model\n- Potential to create a governance blueprint for other projects\n\n## Key Questions & Answers\n\n### ElizaOS v2 Features & Timeline\n- **Q**: When is v2 coming?  \n  **A**: \"Thoon\" - The beta is in developers' hands with no hard deadline, will ship when ready\n\n- **Q**: Any MCP vision for ElizaOS?  \n  **A**: \"There's 3 MCP plugins on my radar at the moment\"\n\n- **Q**: What is ai16z soft governance?  \n  **A**: Non on-chain voting and beginning of engagement around governance, rethinking traditional DAO approaches\n\n### Technical Configuration\n- **Q**: How do I configure local Ollama models in ElizaOS beta?  \n  **A**: You need to use the dedicated Ollama plugin with specific environment variables like OLLAMA_API_ENDPOINT, OLLAMA_SMALL_MODEL, etc.\n\n- **Q**: What's causing the \"StudioLM text generation error: fetch failed\" with LM Studio?  \n  **A**: Make sure the models are available in LM Studio\n\n- **Q**: How can I set up ElizaOS v2 to not respond to everything on Twitter/X and only reply when tagged?  \n  **A**: Changing your character name might help as it can be confusing to LLM, and adding action examples in your configuration\n\n## Community Help & Collaboration\n\n### Local AI Model Integration\n- **bob_the_spounge** helped **Void** with configuring Ollama with ElizaOS beta by providing the correct environment variable format and explaining that Ollama was moved to its own plugin\n- **bob_the_spounge** assisted **Sthx** with Twitter/X integration issues, suggesting configuration changes to avoid spam detection and bans\n\n### Development Support\n- **Patt** and **Kenk** directed **Void** to appropriate resources for launching a local Eliza agent, pointing to the #dev-support channel for technical assistance\n- **bob_the_spounge** shared troubleshooting steps for LM Studio errors, suggesting to check if models are properly available\n\n## Action Items\n\n### Technical\n- Install Ollama plugin separately with \"elizaos create\" then add plugin to character configuration (mentioned by bob_the_spounge)\n- Configure Ollama environment variables correctly (OLLAMA_API_ENDPOINT, OLLAMA_SMALL_MODEL, etc.) (mentioned by bob_the_spounge)\n- Ensure models are available in LM Studio before attempting to use them (mentioned by bob_the_spounge)\n- Implement custom tabs for plugins in agents (mentioned by shaw)\n- Develop and integrate MCP plugins (3 mentioned) (mentioned by Kenk)\n\n### Documentation\n- Document the proper way to install and configure the Ollama plugin (mentioned by bob_the_spounge)\n- Provide guidance for launching local Eliza agents (mentioned by Void)\n\n### Feature\n- Develop ElizaOS v2 with improved capabilities (mentioned by multiple users)\n- Create new governance model as alternative to traditional DAOs with ElizaOS at core (mentioned by Kenk)\n- Support text embedding with providers other than OpenAI (mentioned by bob_the_spounge)\n- Creation of a crypto-western cyberpunk story experience in Hyperfy with locations like Degen Bar, Rugpull Hill, and Rugpull County Jail (mentioned by Dr. Neuro)"
        }
      ],
      "dev_md_last_3_days": [
        {
          "filename": "2025-05-11.md",
          "content": "# elizaOS Development Discord - 2025-05-11\n\n## Overall Discussion Highlights\n\n### Project Announcements\n- User **joaointech** shared their website project called **plinkoincinerator.com** and requested community feedback.\n\n### AI Agent Development\n- Discussion about the **AI Agent Dev School v2** content by Shaw\n- Clarification that the current available video (approximately 1 hour 15 minutes) only covers CLI basics\n- Information that advanced topics like memory systems, multi-agent architectures, and custom plugins are still in development\n- Recommendation to use the **#agent-dev** channel for discussions on advanced features like memory implementations while waiting for official content\n\n## Key Questions & Answers\n\n### AI Agent Dev School Content\n**Q:** Is there only one AI Agent Dev School for v2 by Shaw?  \n**A:** Yes, currently there's just one official dev school program by Shaw, though it's still in development. (answered by Ruby)\n\n**Q:** Are you referring to the new AI Agent Dev School video that's about an hour and 15 minutes long?  \n**A:** Yes, the current video only covers CLI basics, with advanced topics coming soon. (answered by Ruby)\n\n## Community Help & Collaboration\n\n### Agent Development Resources\n- **Ruby** helped **ualp.** by clarifying the status of AI Agent Dev School content and suggesting alternative resources\n- Ruby recommended using the Discord's **#agent-dev** channel for discussions on memory implementations while waiting for the full curriculum\n\n## Action Items\n\n### Technical\n- **Community feedback needed:** for plinkoincinerator.com website (Mentioned by joaointech)\n\n### Documentation\n- **Advanced curriculum:** covering memory systems, multi-agent architectures, and custom plugins (Mentioned by Ruby)\n\n### Feature\n- **Release of advanced AI Agent Dev School content:** beyond CLI basics (Mentioned by Ruby)"
        },
        {
          "filename": "2025-05-10.md",
          "content": "# elizaOS Development Discord - 2025-05-10\n\n## Overall Discussion Highlights\n\n### Plugin Development Issues\n- User **lantianlaoli** reported issues with their custom plugin \"quokkaStep\" that builds on Raydium\n- The plugin is failing to recognize specific actions like \"GENERATE_RAYDIUM_CLMM_CONFIG\" and defaulting to \"CONTINUE\" action\n- The plugin previously worked with OpenRouter but is experiencing issues after switching to the Gemini model\n\n### Documentation Systems\n- **Shaw** mentioned the project has an autodoc package that generates documentation automatically in CI\n- Documentation approach includes a mix of hand-written docs and AI-generated content to fill gaps\n\n## Key Questions & Answers\nNo resolved questions were reported in today's discussions.\n\n## Community Help & Collaboration\n- **Kenk** assisted **lantianlaoli** with Eliza agent configuration issues by directing them to www.eliza.how for further assistance\n\n## Action Items\n\n### Technical\n- Investigate why custom action \"GENERATE_RAYDIUM_CLMM_CONFIG\" is being interpreted as \"CONTINUE\" after switching from OpenRouter to Gemini (Mentioned by: lantianlaoli)\n\n### Documentation\n- Check autodoc package for documentation generation (Mentioned by: Shaw)"
        }
      ]
    }
  },
  "github": {
    "summaries": {
      "week": [
        {
          "filename": "2025-05-11.md",
          "content": "# ElizaOS Weekly Update (Week of May 11, 2025)\n\n## OVERVIEW\nThis week saw significant progress in agent framework capabilities with the addition of a new PM agent, major refactoring of model handling in AgentRuntime, and several critical bug fixes across PGLite and database functionality. The team also improved TypeScript enforcement and cleaned up environment configurations.\n\n## PROJECT METRICS\n- PRs: 16 merged PR's, 10 new PRs\n- Issues: 1 new issues, 2 closed issues\n- Unique Contributors: 13\n- Code Changes: +10528/-5184 lines across 111 files\n- Total Commits: 27\n- Most Active Contributors: ChristopherTrimboli, wtfsayo, Dahka2321, 0xbbjoker, yungalgo\n\n## TOP ISSUES\n\n### Database and Migration Challenges\n- Multiple issues with PGLite migrations required urgent fixes\n- JSON serialization problems with invalid Unicode escape sequences in logs\n- Missing database functions identified during TypeScript enforcement\n\n### Framework Architecture Improvements\n- Need for better model handling in AgentRuntime to support providers and priorities\n- Environment configuration and agent loading required cleanup\n- Instrumentation loading needed optimization for performance\n\n## KEY TECHNICAL DEVELOPMENTS\n\n### Agent Capabilities Enhancement\n- Added new project management agent functionality through [#4471](https://github.com/elizaos/eliza/pull/4471)\n- Refactored model handling in AgentRuntime to support provider and priority settings [#4507](https://github.com/elizaos/eliza/pull/4507)\n- Fixed Twitter integration in V2 [#4506](https://github.com/elizaos/eliza/pull/4506)\n\n### Infrastructure and Stability Improvements\n- Resolved multiple PGLite migration issues [#4532](https://github.com/elizaos/eliza/pull/4532) [#4531](https://github.com/elizaos/eliza/pull/4531)\n- Fixed JSON serialization to handle invalid Unicode escape sequences in logs [#4458](https://github.com/elizaos/eliza/pull/4458)\n- Enforced TypeScript on /cli and /plugin-sql, fixing missing DB functions [#4529](https://github.com/elizaos/eliza/pull/4529)\n- Optimized build process with cache cleaning before CI runs [#4523](https://github.com/elizaos/eliza/pull/4523)\n- Improved environment configuration with cleanup of the-org ENV and Agent loading [#4524](https://github.com/elizaos/eliza/pull/4524)\n- Updated dependencies across multiple directories [#4502](https://github.com/elizaos/eliza/pull/4502)\n- Removed plugin-solana from monorepo [#4513](https://github.com/elizaos/eliza/pull/4513)"
        }
      ],
      "month": [
        {
          "filename": "2025-05-01.md",
          "content": "# ElizaOS Monthly Update (May 2025)\n\n## OVERVIEW\nMay saw significant progress in ElizaOS with a focus on performance optimization, plugin architecture improvements, and codebase cleanup. The team streamlined the monorepo by removing several plugins while enhancing core functionality and documentation, preparing for better compatibility between version 0.x and 1.x.\n\n## PROJECT METRICS\n- PRs: 90 merged PRs, 115 new PRs\n- Issues: 8 new issues, 14 closed issues\n- Unique Contributors: 51\n- Code Changes: +23366/-29596 lines across 466 files\n- Total Commits: 455\n- Most Active Contributors: wtfsayo, 0xbbjoker, ChristopherTrimboli, yungalgo, K1mc4n\n\n## TOP ISSUES\n\n### Plugin Architecture Compatibility\n- Ensuring plugins work seamlessly between version 0.x and 1.x\n- Addressing plugin loading performance with large agent counts\n- Resolving plugin installation and registration issues\n\n### CLI Functionality\n- Incorrect version detection showing wrong latest CLI version\n- Issues with publish CLI command options and platform compatibility\n- Missing .gitignore in plugins created with global CLI installation\n\n### Database and Storage\n- PGLite directory configuration and migration challenges\n- JSON serialization issues with invalid Unicode escape sequences\n- Need for improved type safety in database operations\n\n### Performance Bottlenecks\n- Slow agent loading when many agents are present\n- Unnecessary object creation impacting system performance\n- Runtime type issues affecting overall system stability\n\n### UI/UX Improvements\n- Client scrollbar issues affecting user experience\n- Authentication flow improvements needed for better security\n- Twitter timeline integration requiring refinement\n\n### Documentation Gaps\n- Broken documentation links needing updates\n- Inconsistent documentation regarding installation methods\n- Missing docstrings in critical codebase sections\n\n## KEY TECHNICAL DEVELOPMENTS\n\n### Performance Optimizations\n- Implemented faster agent loading when handling many agents [#4519](https://github.com/elizaos/eliza/pull/4519)\n- Optimized reply functionality to use smaller models for efficiency [#4416](https://github.com/elizaos/eliza/pull/4416)\n- Refactored model handling in AgentRuntime to support provider and priority [#4507](https://github.com/elizaos/eliza/pull/4507)\n- Disabled loading instrumentation when not enabled for performance gains [#4530](https://github.com/elizaos/eliza/pull/4530)\n\n### Plugin System Enhancements\n- Prepared version 0.x for sharing plugins with 1.x [#4384](https://github.com/elizaos/eliza/pull/4384)\n- Extended OpenAI plugin to support custom embedding endpoints [#4421](https://github.com/elizaos/eliza/pull/4421)\n- Fixed plugin routes functionality [#4415](https://github.com/elizaos/eliza/pull/4415)\n- Added usage event emission for embeddings and image descriptions [#4438](https://github.com/elizaos/eliza/pull/4438)\n\n### Authentication & Security\n- Added authentication middleware and API key dialog for unauthorized access [#4420](https://github.com/elizaos/eliza/pull/4420)\n- Improved message handling and text escaping with null checks [#4508](https://github.com/elizaos/eliza/pull/4508)\n\n### CLI Improvements\n- Refactored and enhanced the ElizaOS publish CLI command [#4424](https://github.com/elizaos/eliza/pull/4424)\n- Fixed incorrect version detection to show correct latest CLI version [#4435](https://github.com/elizaos/eliza/pull/4435)\n- Fixed missing .gitignore in plugins created with global CLI installation [#4489](https://github.com/elizaos/eliza/pull/4489)\n\n### Database Enhancements\n- Implemented unique PGLite folder if not provided [#4423](https://github.com/elizaos/eliza/pull/4423)\n- Fixed PGLite migrations [#4532](https://github.com/elizaos/eliza/pull/4532)\n- Integrated real Drizzle ORM for database operation types [#4500](https://github.com/elizaos/eliza/pull/4500)\n\n### Social Media Integration\n- Added Twitter timeline functionality [#4429](https://github.com/elizaos/eliza/pull/4429)\n- Created blog for Twitter agent setup [#4425](https://github.com/elizaos/eliza/pull/4425)\n- Fixed and improved Twitter integration [#4506](https://github.com/elizaos/eliza/pull/4506)\n\n### Codebase Cleanup\n- Removed several plugins from monorepo to streamline development\n- Enhanced type safety by enforcing TypeScript in /cli and /plugin-sql [#4529](https://github.com/elizaos/eliza/pull/4529)\n- Refactored environment variable handling for cleaner code [#4445](https://github.com/elizaos/eliza/pull/4445)\n\n### Documentation Improvements\n- Added comprehensive docstrings to multiple components [#4446](https://github.com/elizaos/eliza/pull/4446), [#4469](https://github.com/elizaos/eliza/pull/4469), [#4498](https://github.com/elizaos/eliza/pull/4498)\n- Updated documentation to prefer direct usage instead of npx [#4493](https://github.com/elizaos/eliza/pull/4493)\n- Fixed broken documentation links [#4460](https://github.com/elizaos/eliza/pull/4460)\n\n## SUMMARY\nMay 2025 was a productive month for ElizaOS with significant improvements to core functionality, plugin architecture, and performance. The team successfully streamlined the codebase by removing several plugins from the monorepo while enhancing the remaining components. Key achievements include faster agent loading, improved authentication, Twitter integration, and comprehensive documentation updates. These developments have positioned ElizaOS for better cross-version compatibility and laid groundwork for more autonomous and capable AI agents."
        }
      ]
    }
  }
}
