{
  "type": "elizaosDailySummary",
  "title": "Daily Report - 2025-04-25",
  "categories": [
    {
      "title": "ElizaOS/ai16z Community Updates and Auto.fun Platform Launch",
      "content": [
        {
          "text": "# Auto.fun Platform Launch and Issues\n\nAuto.fun, a new token launchpad platform by Shaw (new.moon), has officially launched. The platform allows users to create and trade tokens, with features like bonding curves and agent integration. Several key developments and issues have been reported:\n\n- The platform was open-sourced, which many community members view as a positive step\n- $12 million in trading volume was reported within the first 12 hours of launch\n- Several users reported issues with token migration, with some tokens being stuck in migration for 12-20+ hours\n- A significant bug affected the Quill token, incorrectly representing the token-to-SOL ratio, which allowed someone to drain the liquidity pool\n- The team clarified this wasn't an exploit but a bug, deployed a fix, and promised refunds to affected users\n- Some users experienced infinite loading screens and black screens during token creation\n- The team is processing migrations in queue and has directed users to fill out a Tally form to document issues\n\nThe platform will feature one launch partner per day for the next two weeks, with coordinated marketing efforts to maximize visibility.",
          "sources": [
            "https://discord.com/channels/1253563208833433701/1361442528813121556",
            "https://discord.com/channels/1253563208833433701/1362864274862768450",
            "https://discord.com/channels/1253563208833433701/1301363808421543988"
          ],
          "images": [],
          "videos": []
        },
        {
          "text": "# ElizaOS/ai16z Token Discussions\n\nThere's ongoing discussion about the relationship between ElizaOS (formerly ai16z) and DegenAI tokens, with several key points:\n\n- Shaw confirmed that DegenAI V2 is simply the open source release of ElizaOS, not a tokenomics change\n- Some community members are advocating for a token migration from ai16z to ElizaOS due to frustrations with the current platform developer (Bao/baoskee)\n- Concerns include potential liquidity issues during migration, with references to Polygon's migration which saw an 80% drop in daily volume\n- Shaw mentioned plans to implement voting functionality, after which a vote on potential migration could occur\n- There's debate about whether DegenAI should be wrapped into the new token, spun off as an independent project, or if DegenAI holders should receive a portion of the new token\n- Some community members expressed frustration that the current platform lacks promised governance features\n- Shaw stated: \"we're gonna ship voting, then we can have a vote\" regarding potential changes\n\nThe ai16z buyback plan for DegenAI was confirmed, with a community member clarifying that \"ai16z drives buy back on degenai.\"",
          "sources": [
            "https://discord.com/channels/1253563208833433701/1308149076893630555",
            "https://discord.com/channels/1253563208833433701/1301363808421543988",
            "https://discord.com/channels/1253563208833433701/1253563209462448241"
          ],
          "images": [],
          "videos": []
        },
        {
          "text": "# Community and Moderation\n\nSeveral community management issues were discussed:\n\n- A moderation incident occurred where a community member (DorianD) was temporarily kicked from the server by an inactive moderator, but this was quickly reversed\n- There was discussion about improving Discord moderation structure with proper role hierarchies and bot integration\n- Suggestions included using Wick or Dyno bots with a supermod team structure to prevent abuse of powers\n- Some members requested separate partner channels for serious and non-serious discussions\n- There were requests to make ElizaLabs employees and moderators more clearly identifiable with distinct roles and colors\n- The community seems generally positive about Shaw's development efforts and leadership\n\nDevelopers are also working on plugin development for ElizaOS v2, with one user submitting a PR for a Livepeer plugin that offers \"free incentivized inference\" and seeking review.",
          "sources": [
            "https://discord.com/channels/1253563208833433701/1301363808421543988",
            "https://discord.com/channels/1253563208833433701/1300025221834739744",
            "https://discord.com/channels/1253563208833433701/1253563209462448241"
          ],
          "images": [],
          "videos": []
        }
      ],
      "topic": "discord"
    },
    {
      "title": "Crypto Market Update",
      "content": [
        {
          "text": "The crypto market shows fluctuations in major cryptocurrencies. WETH (Wrapped Ethereum) is currently trading between $1,769.36 and $1,786.73, showing an upward movement. Meanwhile, SOL (Solana) is trading between $150.94 and $152.58, displaying a slight downward trend.",
          "sources": [
            "Symbol: WETH\n Current Price: $1769.35640489",
            "Symbol: SOL\n Current Price: $152.577931043",
            "Symbol: WETH\n Current Price: $1786.73032882",
            "Symbol: SOL\n Current Price: $150.942361763"
          ],
          "images": [],
          "videos": []
        }
      ],
      "topic": "crypto market"
    },
    {
      "title": "3D AI TV Project Development Updates",
      "content": [
        {
          "text": "The team is working on implementing lip-syncing for 3D characters using Oculus lip-sync technology. Boom (godfreyart) reported making progress with Oculus lip-sync but encountered issues with viseme ordering in the current models. The proper viseme order should match Meta's documentation, but the current models don't have the correct order and some are missing the silence (.sil) viseme. This will require remapping blend keys and emotions for all characters.",
          "sources": "https://discord.com/channels/1253563208833433701/1313222089271939102",
          "images": [],
          "videos": []
        },
        {
          "text": "The team is also working on a show runner system that generates JSON configurations and audio files for automated content. SM Sith Lord suggested creating a standalone episode generator that would create the necessary JSON and MP3 files without requiring the full show runner functionality. Boom successfully implemented show stepping through JSON and audio loading with visemes, but still needs artists to fix the viseme order and schema for each character.",
          "sources": "https://discord.com/channels/1253563208833433701/1313222089271939102",
          "images": [],
          "videos": []
        },
        {
          "text": "There was discussion about the future of the Unity Clank Tank project, with uncertainty about whether it would be moving to PlayCanvas. SM Sith Lord recommended keeping a backup of the Unity version just in case, while acknowledging uncertainty about plans for supporting multiple platforms.",
          "sources": "https://discord.com/channels/1253563208833433701/1313222089271939102",
          "images": [],
          "videos": []
        }
      ],
      "topic": "3d"
    },
    {
      "title": "Auto.fun Platform Issues and Features",
      "content": [
        {
          "text": "Auto.fun is a platform for token creation on Solana that allows creators to launch tokens with minimal effort. The platform integrates with Fleek to enable agent creation alongside tokens and includes features like importing existing tokens using the \"new coin\" feature and a \"featured\" section for trending tokens.",
          "sources": [
            "https://discord.com/channels/1253563208833433701/1361442528813121556"
          ],
          "images": [],
          "videos": []
        },
        {
          "text": "Users have reported several technical issues with the platform, including:\n\n1. Token migration problems where tokens get stuck at 100% bonding and can't be traded on Raydium\n2. Token creation failures where SOL is taken but tokens aren't properly registered in the UI\n3. UI visibility issues where created tokens don't appear in searches\n4. Fee claiming errors with 400 status responses from the API",
          "sources": [
            "https://discord.com/channels/1253563208833433701/1361442528813121556",
            "https://discord.com/channels/1253563208833433701/1362864274862768450"
          ],
          "images": [],
          "videos": []
        },
        {
          "text": "The Auto.fun team has been actively addressing these issues by:\n- Creating forms to collect details about affected tokens\n- Manually checking contract addresses\n- Flagging issues to the engineering team\n- Confirming that some issues were related to RPC problems\n- Manually fixing tokens to appear in the UI\n- Providing support through a dedicated button at the bottom of the interface",
          "sources": [
            "https://discord.com/channels/1253563208833433701/1361442528813121556",
            "https://discord.com/channels/1253563208833433701/1362864274862768450"
          ],
          "images": [],
          "videos": []
        },
        {
          "text": "The community appears active with users creating various tokens and discussing marketing strategies. There have also been warnings about scam tokens impersonating official launch partners, with clarification that official tokens would launch one per day starting on a specific Monday.",
          "sources": [
            "https://discord.com/channels/1253563208833433701/1361442528813121556",
            "https://discord.com/channels/1253563208833433701/1362864274862768450"
          ],
          "images": [],
          "videos": []
        }
      ],
      "topic": "solana"
    },
    {
      "title": "ElizaOS GitHub Activity Update",
      "content": [
        {
          "text": "Over the two-day period from April 25-27, 2025, the elizaos/eliza repository showed consistent development activity. The project had a total of 5 new pull requests opened, though none were merged during this timeframe. There were 2 new issues created across the two days. The project maintained active community involvement with 7 contributors active on the first day, decreasing slightly to 6 active contributors on the second day.",
          "sources": [
            "From 2025-04-25 to 2025-04-26, elizaos/eliza had 3 new PRs (0 merged), 1 new issues, and 7 active contributors.",
            "From 2025-04-26 to 2025-04-27, elizaos/eliza had 2 new PRs (0 merged), 1 new issues, and 6 active contributors."
          ],
          "images": [],
          "videos": []
        }
      ],
      "topic": "github_summary"
    },
    {
      "title": "Recent GitHub Issues in elizaOS/eliza Repository",
      "content": [
        {
          "text": "Two recent issues have been reported in the elizaOS/eliza GitHub repository:\n\n1. Issue #4365: A user named srpiroliro reported an error where the system cannot read properties of undefined (specifically when reading 'sendStandartTweet'). This appears to be a JavaScript-related error occurring when trying to access a method on an undefined object.\n\n2. Issue #4368: User 0xopsdev has raised a question about token swap requirements when using the EVM (Ethereum Virtual Machine) plugin. The user is seeking clarification on what is needed to perform token swaps with this plugin.",
          "sources": [
            "https://github.com/elizaOS/eliza/issues/4365",
            "https://github.com/elizaOS/eliza/issues/4368"
          ],
          "images": [
            "https://opengraph.githubassets.com/1/elizaOS/eliza/issues/4365",
            "https://opengraph.githubassets.com/1/elizaOS/eliza/issues/4368"
          ],
          "videos": []
        }
      ],
      "topic": "issue"
    },
    {
      "title": "Top contributors for elizaOS/eliza",
      "content": [
        {
          "text": "The provided sources mention 'Top contributors for elizaOS/eliza' but do not provide any specific details about who these contributors are or their contributions to the project. Without additional information, it's not possible to generate a detailed summary about the individual contributors, their roles, or the nature of their contributions to the elizaOS/eliza project.",
          "sources": [
            "Top contributors for elizaOS/eliza"
          ],
          "images": [],
          "videos": []
        }
      ],
      "topic": "contributors"
    },
    {
      "title": "Auto.fun Launch and ElizaOS Ecosystem Updates",
      "content": [
        {
          "text": "## Auto.fun Platform Launch\n\nAuto.fun, a new token creation platform on Solana, has officially launched and been open-sourced. The platform allows users to create tokens with minimal effort and generated $12 million in volume within its first 12 hours. Key features include token creation tools, embeds with price/market cap data, and custom vanity addresses.\n\nThe platform has experienced some technical issues during its launch phase, including:\n- Image generation errors (\"not found\" messages despite occasional functionality)\n- Download failures and chat lag\n- Ledger hardware wallet incompatibility\n- Token migration delays\n- A significant bug with the $QUILL token that incorrectly represented token-to-SOL ratio, allowing someone to drain the liquidity pool\n\nThe team has been responsive to bug reports and implemented fixes quickly. They've also deployed a fix for the $QUILL issue and promised refunds to affected users.",
          "sources": "https://discord.com/channels/1253563208833433701/1301363808421543988, https://discord.com/channels/1253563208833433701/1362864274862768450",
          "images": [],
          "videos": []
        },
        {
          "text": "## ElizaOS Ecosystem Development\n\nThe ElizaOS team is actively working on multiple projects:\n\n1. **Eliza v2 Development**: The team is developing ElizaOS v2 alongside auto.fun, following an open-source approach that invites developer contributions.\n\n2. **Token Discussions**: There are ongoing discussions about a potential token migration from \"ai16z\" to \"ElizaOS\" due to frustrations with the current platform developer. Community members are debating the mechanics and implications of a token swap, with concerns about liquidity, exchange coordination, and potential market impact.\n\n3. **DegenAI Clarification**: It was confirmed that \"DegenAI V2\" is simply the open source release of elizaOS, not a tokenomics change.\n\n4. **Auto.fun Integration**: The platform is being positioned as part of the broader ElizaOS ecosystem, with buybacks for DegenAI driven by ai16z.",
          "sources": "https://discord.com/channels/1253563208833433701/1253563209462448241, https://discord.com/channels/1253563208833433701/1301363808421543988, https://discord.com/channels/1253563208833433701/1308149076893630555",
          "images": [],
          "videos": []
        },
        {
          "text": "## Technical Projects\n\nSeveral technical projects are being developed within the ecosystem:\n\n1. **3D AI TV Project**: Developers are implementing a character animation system using JSON and visemes (mouth shapes for speech). The team has successfully gotten a show to step through JSON data and load audio with visemes, but artists need to fix the viseme order and schema for each character. There's discussion about migrating from Unity to PlayCanvas.\n\n2. **Eli5 Bot**: Community members are discussing the development of an \"eli5\" bot with specific personality traits and features, though implementation details are limited.\n\n3. **Agent Development**: There are discussions about creating more revenue-generating AI agents rather than just entertainment agents, with some community members expressing interest in developing agents through the auto.fun platform.",
          "sources": "https://discord.com/channels/1253563208833433701/1313222089271939102, https://discord.com/channels/1253563208833433701/1301363808421543988, https://discord.com/channels/1253563208833433701/1253563209462448241",
          "images": [],
          "videos": []
        },
        {
          "text": "## Community Management\n\nThe community has experienced some moderation challenges:\n\n1. **Moderation Incident**: A community member (DorianD) was temporarily kicked from the server by a moderator who had been inactive for 9 days. This action was later reversed after review.\n\n2. **Discord Structure**: There are discussions about improving the Discord server structure, including suggestions for separate partner channels for serious and non-serious discussions, and implementing a proper moderation system with bot integration.\n\n3. **Token Verification**: The team has indicated that token verification on auto.fun is currently limited to a small number of projects from teams they're in touch with, with plans to evolve this process over time.",
          "sources": "https://discord.com/channels/1253563208833433701/1301363808421543988, https://discord.com/channels/1253563208833433701/1362864274862768450",
          "images": [],
          "videos": []
        }
      ],
      "topic": "Misceleanous"
    }
  ],
  "date": 1745539200
}