{
  "ai-news": {
    "elizaos": {
      "discord_md_last_3_days": [
        {
          "filename": "2025-04-29.md",
          "content": "# elizaOS Discord - 2025-04-29\n\n## Overall Discussion Highlights\n\n### ElizaOS Development\n- **ElizaOS v2 Progress**: Shaw mentioned that ElizaOS v2 with multi-agent capabilities will be wrapped up in the next couple of weeks.\n- **Technical Challenges**: Several users reported issues with the installation process, model compatibility, and API integration.\n- **RAM Limitations**: Users discussed hardware constraints when running local models, particularly that LLAMA 3 8B requires 20+ GB of VRAM.\n- **Node.js Compatibility**: Issues were reported with dynamic requires not being supported in Node.js 23+.\n- **Integration Options**: Discussions about integrating ElizaOS with other frontends, with references to agent API endpoints in the agent.ts file.\n\n### Auto.fun Platform\n- **Token Launches**: Several partner projects were launched through Auto.fun, including FightFi, SQUID by Allora Network, with discussions about upcoming launches like xfractal.\n- **Platform Issues**: Users reported problems with DexScreener not updating for some launches (FightAlgo and FightBrawl), causing loss of momentum.\n- **UI Improvements**: The platform team implemented timeframe options for charts during this period.\n- **LP Issues**: Some users experienced incorrect token amounts when purchasing through liquidity pools.\n- **Branding Challenges**: Discussions about consolidating ai16z (token) and ElizaOS (platform) under a single name for better brand recognition.\n\n### Community Projects\n- **Mental Health App**: Cliff shared details about a mental health application built on ElizaOS, featuring a mobile app that works with a smart ring to track physical activities and mood, with versions for both Android and iOS (iOS approval pending).\n- **OpenRouter Integration**: Jin shared positive feedback about using OpenRouter's web search feature to enhance content for elizaOS partners.\n- **Exchange Listings**: Bithumb exchange listed ai16z, according to community member Avanc.\n\n### Market Discussions\n- **ELI5 Token**: Community members discussed price targets between $10-50 million market cap by end of Q2, with some suggesting a more ambitious $30M target within the week.\n- **CEX Listings**: Brief discussion about potential centralized exchange listings for Degenai, with the note that such information is typically under NDAs.\n\n## Key Questions & Answers\n\n### Technical\n- **Q**: How to run local models to test Eliza when hitting RAM limits?  \n  **A**: \"Your macbook doesn't have the hardware capability to run the model you're using. Either quantize it, use a smaller model or use a cloud server.\" (answered by starlord)\n\n- **Q**: How to integrate Eliza AI framework to another chatting frontend demo?  \n  **A**: \"You can take reference of all the agents API endpoints from the agent.ts file.\" (answered by elldee)\n\n- **Q**: Can I adjust the supply of the tokens when creating?  \n  **A**: \"Token supply is fixed at 1 billion.\" (answered by ben)\n\n### Platform & Community\n- **Q**: How do you get verified (green check)?  \n  **A**: \"Verified are projects we are confident are legitimate agent builders.\" (answered by Kenk)\n\n- **Q**: What are the profile \"Points\" for?  \n  **A**: \"More will be revealed with points shortly.\" (answered by Kenk)\n\n- **Q**: Will image uploads be supported soon in AI Create?  \n  **A**: \"Yep, more features will be added to AI create over time.\" (answered by Kenk)\n\n- **Q**: Is there an actual plan for auto.fun's marketing?  \n  **A**: \"The head of marketing was in Spain with power/internet issues, but the team is working to improve engagement.\" (answered by whobody and eskender.eth)\n\n- **Q**: Price target for eli?  \n  **A**: \"Compared to many other AI agents, I think $10-50 mil mcap is doable before end of Q2. Long term, it depends on utility, community, mind share.\" (answered by MDMnvest)\n\n- **Q**: What's the status on consolidating ai16z and elizaOS under the same ticker?  \n  **A**: \"The team needs daos.fun to enable these changes and currently can't make them.\" (answered by Kenk)\n\n- **Q**: Were the partner projects launched on auto.fun specially chosen or did they apply on their own?  \n  **A**: \"Both - the team reached out to potential partnerships weeks ago while still building.\" (answered by jasyn_bjorn)\n\n- **Q**: Does Degenai have any listing plan on the cex?  \n  **A**: \"Most CEX listings are under NDA and can't be discussed.\" (answered by Odilitime)\n\n## Community Help & Collaboration\n\n1. **Model Compatibility Assistance**\n   - **Helper**: starlord\n   - **Helpee**: uedersonferreira\n   - **Context**: RAM limitations when running local models\n   - **Resolution**: Advised to quantize model, use smaller model, or use cloud server\n\n2. **Project Sharing Guidance**\n   - **Helper**: Kenk\n   - **Helpee**: Cliff ツ\n   - **Context**: Cliff wanted to know where to share his ElizaOS-based mental health project\n   - **Resolution**: Kenk shared a link to sign up for weekly demos (https://tally.so/r/nrYKXR)\n\n3. **New Developer Introduction**\n   - **Helper**: Osint (aka not_a_dev_ai)\n   - **Helpee**: BigBoss\n   - **Context**: Introducing a new developer to the community\n   - **Resolution**: Osint introduced BigBoss to the community, shared his credentials, and tipped him 30 ai16z tokens\n\n4. **Exchange Listing Information**\n   - **Helper**: Avanc\n   - **Helpee**: Multiple users\n   - **Context**: Sharing news about Bithumb exchange listing\n   - **Resolution**: Informed the community about ai16z being listed on Korea's second largest exchange\n\n5. **Integration Support**\n   - **Helper**: elldee\n   - **Helpee**: elldee (self-help shared with community)\n   - **Context**: Integrating Eliza AI framework with another frontend\n   - **Resolution**: Shared GitHub reference to agent API endpoints file\n\n## Action Items\n\n### Technical\n1. **Complete ElizaOS v2 with multi-agent capabilities** (Mentioned by shaw)\n2. **Improve auto.fun UI/UX for better mobile compatibility** (Mentioned by shaw)\n3. **Add \"ElizaOS Inside\" branding to auto.fun** (Mentioned by DorianD)\n4. **Create a staking mechanism for ai16z on auto.fun** (Mentioned by Spyros)\n5. **Investigate \"World not found for worldId null\" error** (Mentioned by elldee)\n6. **Fix Twitter client integration error (Maximum call stack size exceeded)** (Mentioned by elldee)\n7. **Resolve dynamic require of \"util\" not supported in Node.js 23+** (Mentioned by orayo)\n8. **Address memory issues causing crashes in GUI when getting responses** (Mentioned by elldee)\n9. **Resolve LP issue for Quill token** (Mentioned by fen sama)\n10. **Implement timeframe options for charts** (Mentioned by Simon | PEPELIZA creatooor 🐸)\n11. **Build a mental health infrastructure with AI therapist/coach functionality on ElizaOS** (Mentioned by Cliff ツ)\n12. **Integration of OpenRouter web search API to enrich elizaOS partner pages** (Mentioned by jin)\n13. **Improve DexScreener integration for token launches** (Mentioned by ryanthelad)\n14. **Investigate why OTTO and DOT lost verification status** (Mentioned by MDMnvest)\n\n### Documentation\n1. **Create guide for integrating ElizaOS with external frontends** (Mentioned by elldee)\n2. **Document hardware requirements for running different models locally** (Mentioned by elldee)\n3. **Improve explanation of how auto.fun agents differ from other bots** (Mentioned by 찌 G 跻 じ PrudentSpartan)\n4. **Create clearer documentation about the relationship between ai16z, ElizaOS, and auto.fun** (Mentioned by DorianD)\n5. **Clarify token minting process and visibility in wallets** (Mentioned by Skullcross)\n6. **Clarify token verification process** (Mentioned by Simon | PEPELIZA creatooor 🐸)\n7. **Explain profile points system** (Mentioned by Simon | PEPELIZA creatooor 🐸)\n\n### Feature\n1. **Implement token swap from ai16z to a simpler ticker like \"E\" or \"Eliza\"** (Mentioned by DorianD and Spyros)\n2. **Create an AI agent on Twitter that aggregates community feedback** (Mentioned by vincentpaul)\n3. **Integrate auto.fun with Hyperfy for 3D virtual environments** (Mentioned by Odilitime)\n4. **Implement AI safety tools/guardrails against prompt injections** (Mentioned by elldee)\n5. **Develop Deepseek plugin for Eliza v2** (Mentioned by elldee)\n6. **Improve compatibility with McP plugin for Notion** (Mentioned by Stan ⚡)\n7. **Add image upload support to AI Create** (Mentioned by Simon | PEPELIZA creatooor 🐸)\n8. **Support adjustable token supply** (Mentioned by Tocheee)\n9. **Address launch notification system** (Mentioned by anon)\n10. **Weekly demos for builders to share their projects** (Mentioned by Kenk)"
        },
        {
          "filename": "2025-04-28.md",
          "content": "# elizaOS Discord - 2025-04-28\n\n## Overall Discussion Highlights\n\n### Platform Development\n- **ElizaOS v2 Development**: Stan mentioned working on \"v2\" of the ElizaOS framework, though specific details were not shared.\n- **Plugin Integration Issues**: Multiple users reported problems with newly added plugins not appearing in the UI search, with `npx elizaos start` suggested as a workaround.\n- **Documentation Build Problems**: Issues were reported with documentation builds on the v2-develop branch.\n- **Docker Optimization**: Questions raised about reducing the Docker image size for Eliza repo (currently 3.32GB).\n\n### Auto.fun Platform\n- **Launch Status**: The auto-fun marketing launch is scheduled to begin tomorrow, though the feature itself is not yet complete.\n- **Token Launch Confusion**: Community members discussed an anticipated token launch on the auto.fun platform, with confusion about whether FightFi (reportedly the first partner) was actually launching.\n- **Migration Issues**: Users reported problems migrating from Auto.fun to Solana, experiencing delays and complications.\n- **Wallet Connection Errors**: Multiple users encountered \"WalletNotConnectedError\" when attempting to create tokens on-chain.\n\n### AI Integration\n- **Model Provider Support**: Discussions about implementing Gemini as a model provider in Eliza, with suggestions to fork the OpenAI implementation and adapt it using Vercel AI's building blocks.\n- **Twitter Integration**: Issues reported with Twitter integration not posting tweets despite logs showing generation.\n- **MCP Plugin Functionality**: Confirmation that the Fleek MCP plugin works properly for connecting to Eliza.\n- **OpenRouter Updates**: Announcements about new providers, OAuth state parameter support, Gemini parallel tool calling, and the launch of Qwen3 models.\n\n### Community & Governance\n- **DAO Structure**: Multiple inquiries about the DAO's structure and governance, with Kenk explaining that governance is still in early stages.\n- **Contributor Rewards**: Questions about potential airdrops or rewards for contributors to ElizaOS, with mention of possible future retroactive rewards.\n- **Agent Integration**: Discussions about integrating agents into Auto.fun, with guidance on promotion and utility.\n\n## Key Questions & Answers\n\n### Technical\n- **Q**: How to fix a plugin not showing in the UI search?  \n  **A**: Try using `npx elizaos start` (answered by acul4688)\n\n- **Q**: Is there a Gemini plugin for the new CLI like there is for OpenAI and Anthropic?  \n  **A**: No implementation exists yet; fork the OpenAI implementation and adapt it for Gemini using Vercel AI (answered by Carlos Rene)\n\n- **Q**: Has anyone successfully connected their MCP to Eliza using the Fleek MCP plugin?  \n  **A**: Yes, it works fine (answered by Carlos Rene)\n\n- **Q**: Can Eliza do large scale scraping with Twitter as a replacement for purchasing the Twitter API?  \n  **A**: Hard to not be detected, you can also use RSS feed (answered by MonteCrypto)\n\n### Platform & Governance\n- **Q**: How long does migration take?  \n  **A**: It can take a few days (answered by Kenk)\n\n- **Q**: Where can I get more info on the DAO?  \n  **A**: Take a read about daos.fun + the early days of the project (answered by Kenk)\n\n- **Q**: How does the governance work for the DAO?  \n  **A**: There's no governance at the moment, there are a group of contributors who have been working on this with a view to utilize agents but it's very early (answered by Kenk)\n\n- **Q**: Is there some special airdrop or something for people contributing in ElizaOS framework?  \n  **A**: There might be some retro rewards in the future but this is undefined (answered by Kenk)\n\n## Community Help & Collaboration\n\n1. **Gemini Integration Guidance**:  \n   Carlos Rene advised acul4688 on implementing Gemini as a model provider in Eliza by suggesting to fork the OpenAI implementation and adapt it for Gemini using Vercel AI.\n\n2. **Plugin Troubleshooting**:  \n   acul4688 helped Carlos Rene with a plugin not showing in UI search by suggesting the use of `npx elizaos start` as a workaround.\n\n3. **MCP Plugin Confirmation**:  \n   Carlos Rene confirmed to acul4688 that the Fleek MCP plugin works properly for connecting to Eliza.\n\n4. **Migration Support**:  \n   Kenk provided guidance to multiple users experiencing issues with Auto.fun to Solana migration, directing them to submit details through a Tally form for resolution.\n\n5. **Launch Interpretation**:  \n   ryanthelad helped Pyroman interpret FightFi's denial of launch by suggesting they might be trying to deter snipers.\n\n## Action Items\n\n### Technical Tasks\n- Fix issue with plugins not appearing in UI search (mentioned by Carlos Rene)\n- Investigate Twitter integration not posting tweets despite logs showing generation (mentioned by acul4688)\n- Fix documentation build issues on v2-develop branch (mentioned by acul4688)\n- Develop Gemini model provider plugin for Eliza (mentioned by acul4688)\n- Optimize Docker image size for Eliza repo (mentioned by Mohit)\n- Fix WalletNotConnectedError when creating tokens on-chain (mentioned by dEXploarer)\n- Resolve incorrect token amounts in Quill LP (mentioned by fen sama)\n- Process refunds for users who invested in fake LP pools during migration (mentioned by drkmttr2)\n- Fix migration delays from Auto.fun to Solana (mentioned by ryanthelad)\n- Investigate errors with fightbrawl where clicking \"buy one Solana\" gives only 1% (mentioned by Osint)\n- Integration of ElevenLabs voice synthesis natively into Unity (mentioned by boom)\n- Development of AI partner for scanning and buying trenches (mentioned by iprintmoney)\n\n### Documentation Needs\n- Information about DAO structure and governance (mentioned by Mhardook)\n- Usage guide for Eliza (mentioned by Lily Ayunda)\n- Clarify what the profile \"Points\" feature is used for (mentioned by Simon)\n- Explain the verification process (green check) (mentioned by Simon)\n- Clarify the verification process for launches on the platform (mentioned by frank_grimes_sr)\n\n### Feature Requests\n- Twitter scraping capabilities as an alternative to the API (mentioned by z1)\n- Voting mechanism for token listings (mentioned by abhi_ironman)\n- Consider improved MCP plugin implementation beyond Fleek's version (mentioned by Stan)\n- Support for image uploads in AI Create section (mentioned by Simon)\n- Add time range options to charts (mentioned by Simon)\n- Add market cap display next to coins on mobile app (mentioned by uloze)"
        },
        {
          "filename": "2025-04-27.md",
          "content": "# elizaOS Discord - 2025-04-27\n\n## Overall Discussion Highlights\n\n### ElizaOS v2 Implementation\n- Users are actively troubleshooting ElizaOS v2 implementations, particularly with client integrations\n- Telegram and local clients work properly after fresh installation, while Discord and Twitter clients require additional configuration\n- GitHub Personal Access Token (PAT) is required for plugin downloads, raising some security considerations\n- Model selection discussions highlighted deepseek 3.1 as a preferred option on the free tier\n\n### Auto.fun Platform Development\n- Community members discussed auto.fun's differentiators compared to competitors like virtuals.io and arc.fun\n- Auto.fun is positioned as an open-source experiment currently in MVP stage\n- Key features include vanity addresses for contracts, token-gated chat, creator fees, and well-received design\n- Token migration issues were reported by multiple users, with the team collecting reports via a Tally form\n- A partners-only auto.fun dashboard is in development but hitting Helius API limits\n\n### Blockchain Technology\n- Discussion about Solana permissioned blockchains (appchains) as cost-saving options before migrating to mainnet\n- Debate about node infrastructure costs versus third-party RPC services\n- Interest in Neon EVM for DAO tooling, potentially allowing Solidity contracts to work with Solana\n- Hyperlane bridge implementation mentioned for cross-chain AI16 transactions\n\n### AI Development Tools\n- Comparison of AI coding tools like Cursor, Windsurf, and Replit for developers with varying skill levels\n- Replit highlighted for building applications without traditional IDE involvement\n- Discussion about the feasibility of developing projects with minimal programming knowledge using AI tools\n\n## Key Questions & Answers\n\n**Q: How to access the chat interface after deploying ElizaOS on Phala?**  \nA: Check the appropriate channel and visit https://eliza.how (answered by Osint)\n\n**Q: Is it possible that playing with eliza burned my GPU?**  \nA: No, this is not possible (answered by Osint)\n\n**Q: How did you get telegram and local client working?**  \nA: Run \"npx elizaos create\", cd into the directory, then \"npx elizaos start\". GitHub PAT is required for plugin downloads. (answered by resethill)\n\n**Q: Is the latest starter pack based on Eliza OS 2?**  \nA: Yes, the quickstart guide in eliza.how is based on v2 beta. (answered by Kenk)\n\n**Q: How can I report migration issues with my tokens?**  \nA: Submit your issue through the Tally form at https://tally.so/r/mOr8DM (answered by Kenk)\n\n**Q: Will coins reaching 60k properly migrate to Raydium?**  \nA: Yes, it should work now as previous issues have been resolved (answered by Osint)\n\n**Q: What type of software can I use for speaking with AI and coding?**  \nA: Cursor (answered by whobody)\n\n**Q: Can I develop a project with zero programming knowledge if I have a good idea and define a good system?**  \nA: Yes, but it requires a lot of patience (answered by 7OROY)\n\n## Community Help & Collaboration\n\n### ElizaOS Installation Support\n- resethill helped orayo with ElizaOS v2 installation steps using npx commands and advised on GitHub PAT requirements\n- resethill assisted Fwog with Windows-specific commands to reinstall ElizaOS after encountering path errors\n- Kenk confirmed to Sthx that the quickstart guide is based on v2 beta\n\n### Token Migration Issues\n- Kenk directed multiple users reporting unmigrated tokens to submit issues via a Tally form\n- Osint confirmed to Pyroman that token migration to Raydium should work properly after fixing previous issues\n\n### AI Development Tools Guidance\n- yikesawjeez provided iprintmoney with a detailed comparison of AI coding tools for developers with no programming knowledge\n- 7OROY suggested Windsurf as an alternative to Cursor for AI coding\n- yikesawjeez shared a live example (tournament.x-ware.online) of an AI-built application and explained differences between tools\n\n## Action Items\n\n### Technical\n- Fix Discord client connectivity issues where bot doesn't show up as online despite matching settings with working bots (Mentioned by resethill)\n- Resolve Twitter client functionality for proper posting (Mentioned by resethill)\n- Fix plugin-bootstrap loading issue where loading occurs even when explicitly removed (Mentioned by resethill)\n- Address entities provider slow response time (4s) (Mentioned by resethill)\n- Fix OpenAI timeout overflow warning showing 32-bit signed integer overflow (Mentioned by Sthx)\n- Migrate token with address 8MYgZupEQ7aAJcyz2ZpSkQEXLnfHEPuU6sGJB8GERFUN (Mentioned by vvz1718, Vaunted)\n- Fix token display issue for 9j1ayE6MQLuiUmcVS2qivsjbznajvidLWQcFBjPQ5FUN (Mentioned by casper)\n- Resolve LP issue where user received fewer tokens than expected after migration (Mentioned by fen sama)\n- Explore Solana appchains for auto.fun projects to save costs before migrating to mainnet (Mentioned by DorianD)\n- Investigate economic advantages of running nodes vs. paying for 3rd party RPC infrastructure (Mentioned by DorianD)\n- Explore Neon EVM for DAO tooling to utilize Solidity contracts on Solana (Mentioned by yikesawjeez)\n- Consider Hyperlane bridge implementation for cross-chain AI16 transactions (Mentioned by yikesawjeez)\n\n### Documentation\n- Create guide for Twitter client integration with proper configuration steps (Mentioned by pursue)\n- Provide deployment best practices for various environments (Mentioned by Ouranos)\n- Provide clearer guidance on auto.fun's roadmap and vision (Mentioned by mariocandia)\n- Create more resources on building web interfaces for ElizaOS (Mentioned by Ouranos)\n- Compare AI coding tools (Cursor, Windsurf, Replit, etc.) for developers with different skill levels (Mentioned by yikesawjeez)\n\n### Feature\n- Improve GitHub PAT permission scoping for more granular control (Mentioned by resethill)\n- Improve trading experience on auto.fun platform to be more competitive (Mentioned by mariocandia)\n- Improve chart functionality to include timeframe selection similar to TradingView (Mentioned by abhi_ironman)"
        }
      ],
      "dev_md_last_3_days": [
        {
          "filename": "2025-04-29.md",
          "content": "# elizaOS Development Discord - 2025-04-29\n\n## Overall Discussion Highlights\n\n### Plugin Integration & Configuration\n- Multiple users worked through issues with specific plugins including Twitter and Fleek MCP\n- Twitter plugin integration required explicit addition via CLI command: `elizaos plugins add @elizaos/plugin-twitter`\n- EVM integration challenges were discussed, particularly around ETH to USDC swaps on mainnet\n- Fleek MCP Plugin issues were resolved by properly specifying tool calls\n\n### LLM Provider Configuration\n- Significant discussion around configuring Gemini as an alternative LLM provider\n- Environment variable setup similar to OpenAI but with Gemini-specific endpoint URLs\n- Several users shared configuration attempts and troubleshooting steps\n\n### Technical Demonstrations\n- Live demonstration of Unreal Engine 5.5 integration with ElizaOS\n- The demo featured market analysis capabilities and Twitch client functionality\n- Discussion about using OpenRouter's web search feature to enhance ElizaOS partner pages\n\n### Agent Development\n- File structure for agent configuration was shared in the agent-dev-school channel\n- Key files discussed: config.yaml, character.yaml, and secrets.env\n\n## Key Questions & Answers\n\n**Q: How can I use Gemini as my LLM provider?** (asked by FaultyCarry)  \n**A:** Configure environment variables similar to OpenAI with the correct Gemini endpoint URL (answered by sayonara)\n\n**Q: When I want to swap ETH to USDC on mainnet using plugin-evm, this error happens. What else do I need?** (asked by OpsDev | Onyx)  \n**A:** You need to configure EVM_CHAINS in your .env file (answered by sam-developer)\n\n**Q: Why is my agent not tweeting despite adding Twitter credentials?** (asked by FaultyCarry)  \n**A:** You need to explicitly add the Twitter plugin with \"elizaos plugins add @elizaos/plugin-twitter\" (answered by sam-developer)\n\n## Community Help & Collaboration\n\n1. **Twitter Plugin Integration**\n   - **Helper:** sam-developer\n   - **Helpee:** FaultyCarry\n   - **Context:** Agent not tweeting despite Twitter credentials in .env\n   - **Resolution:** Instructed to add Twitter plugin explicitly with CLI command\n\n2. **EVM Configuration Support**\n   - **Helper:** sam-developer\n   - **Helpee:** OpsDev | Onyx\n   - **Context:** ETH to USDC swap failing on mainnet\n   - **Resolution:** Suggested adding EVM_CHAINS configuration to .env file\n\n3. **Gemini LLM Integration**\n   - **Helper:** sayonara\n   - **Helpee:** FaultyCarry\n   - **Context:** Configuring Gemini as LLM provider\n   - **Resolution:** Provided correct environment variable configuration for Gemini integration\n\n4. **Fleek MCP Plugin Troubleshooting**\n   - **Helper:** Scooter\n   - **Helpee:** Mel G\n   - **Context:** Issues with Fleek MCP Plugin\n   - **Resolution:** Scooter mentioned the need to specify tool calls, which resolved their issue\n\n## Action Items\n\n### Technical\n- Remove environment limitations for multi-room chat in GUI (Mentioned by: shaw)\n- Fix Gemini integration with ElizaOS to resolve configuration issues (Mentioned by: FaultyCarry)\n- Improve EVM plugin error handling with better error messages when configuration is incomplete (Mentioned by: OpsDev | Onyx)\n\n### Feature\n- Add support for posting to X communities to enable agents to post to communities on X platform (Mentioned by: Jon)\n- Enhance OpenRouter web search integration for partner pages (Mentioned by: multiple users)\n\n### Documentation\n- Create comprehensive guide for LLM provider configuration, including setup for different providers like Gemini (Mentioned by: sayonara)\n- Document proper plugin installation and configuration steps for common plugins (Twitter, EVM, Fleek MCP)\n- Develop standardized agent configuration templates with examples of config.yaml, character.yaml, and secrets.env"
        },
        {
          "filename": "2025-04-28.md",
          "content": "# elizaOS Development Discord - 2025-04-28\n\n## Overall Discussion Highlights\n\n### Agent Configuration & Setup\n- Users are actively setting up Eliza agents with various plugins, particularly Twitter integration\n- The community is working through configuration challenges, especially around authentication and credentials\n- ElizaOS is now TypeScript-based (v2.1.0), moving away from earlier Python implementations\n- Configuration is split between technical settings (config.yaml) and personality/response settings (character files)\n\n### Advanced Agent Capabilities\n- Interest in agent-to-agent communication (swarms) and orchestration between multiple agents\n- Discussion about MCP (Mission Control Protocol) integration with the Fleek plugin\n- Hyperfy confirmed to be using the Fleek plugin for MCP client functionality\n\n### Storage & Infrastructure\n- Technical discussion about storage system architecture with 3 hot and 2 cold replicas for warm storage\n- Debate about data replication approaches versus erasure coding for efficiency\n- Implementation of Proof of Data Possession (PDP) for verification of distributed data chunks\n\n## Key Questions & Answers\n\n**Q: Is there a simple guide for setting up an example agent on Discord?**  \nA: jin recommended using the full LLM context guide at https://eliza.how/llms-full.txt\n\n**Q: What is the simplest way to get a Twitter agent working?**  \nA: sam-developer provided GitHub link to social media manager code and basic setup instructions\n\n**Q: Can we use Twitter agent without Twitter API?**  \nA: sam-developer confirmed it's possible using cookies for authentication\n\n**Q: Is it possible for agents to talk to each other with an orchestrator agent?**  \nA: DeFine explained this is called a swarm, suggesting modifications to the org package or creating an Eliza project from CLI\n\n**Q: What MCP client plugin is Hyperfy using?**  \nA: jin and peezy confirmed they're using the Fleek plugin\n\n**Q: How is the warm storage system designed for redundancy?**  \nA: The plan includes 3 hot and 2 cold replicas, with hot copies chunked and distributed across many storacha nodes using Proof of Data Possession\n\n**Q: Is ElizaOS Python or TypeScript based?**  \nA: Ruby clarified that ElizaOS is now TypeScript-based (v2.1.0), and Python examples were from an early prototype\n\n## Community Help & Collaboration\n\n- **Twitter Agent Setup**: sam-developer helped Ryan-MoRtRed with Twitter agent configuration, providing GitHub links and explaining authentication options\n- **Storage System Design**: Ruby provided technical feedback to inthiseconomy about their storage architecture, suggesting erasure coding instead of full replication\n- **Twitter Mention Listener**: Ruby assisted Pill Bullman with configuring the Twitter plugin to monitor and respond to mentions, providing specific code for config.yaml\n- **Documentation Clarification**: 0xbbjoker helped standard understand prompt formatting, explaining why logs appear flattened while actual formatting is preserved\n- **MCP Plugin Identification**: jin and peezy helped Agent Joshua identify which plugin Hyperfy uses for MCP client functionality\n\n## Action Items\n\n### Technical\n- Improve Twitter agent authentication process (Ryan-MoRtRed)\n- Address Twitter account suspension issue after posting (Ryan-MoRtRed)\n- Implement agent-to-agent communication framework (AD)\n- Consider implementing erasure coding instead of full replication for better storage efficiency (Ruby)\n- Address potential hotspot issues in shard management (Ruby)\n- Complete stress testing on Filecoin Calibration network (inthiseconomy)\n- Configure Twitter plugin with watchUsers and replyToMentions settings in config.yaml (Ruby)\n\n### Documentation\n- Create beginner-friendly guide for setting up example agents with plugins (BigBoss)\n- Develop clearer instructions for Twitter agent setup (Ryan-MoRtRed)\n- Improve MCP server tools documentation (Scooter)\n- Create more accessible onboarding materials beyond video tutorials (BigBoss)\n- Update outdated guides that reference Python implementation (Ruby)\n\n### Feature\n- Implement agent-to-agent communication framework (AD)"
        },
        {
          "filename": "2025-04-27.md",
          "content": "# elizaOS Development Discord - 2025-04-27\n\n## Overall Discussion Highlights\n\n### Auto.fun Solana Program Implementation\n- Discussion about Raydium liquidity migration implementation details\n- Clarification on using `lockLp` function (temporary lock) versus `burnAndEarn.createLockInstruction` (permanent lock/burn)\n- Confirmation that Auto.fun contracts have been audited by Spearbit/Cantina\n- Developer explained they're using `feeNftOwner` parameter with a custom vault as recipient\n- Future plans for NFT functionality beyond creator fee claiming\n\n### Plugin Development for Eliza V2\n- User inquired about developing plugins for Eliza V2 without requiring multiple agents\n- Guidance provided on using documentation and template creation command\n- Discussion about code structure differences between V1 and V2 versions\n\n### EVM Plugin Configuration Issues\n- Troubleshooting session for EVM plugin connection problems\n- Identified that using multiple provider URLs requires setting a default chain\n- Solution involved adding `EVM_DEFAULT_CHAIN` environment variable to specify primary network\n\n## Key Questions & Answers\n\n**Q: Can plugins be developed based on the current V2 version? Is there any excellent open source code to refer to?**  \nA: Check the docs on how to create a plugin at https://eliza.how/docs/core/plugins. Once you create your template plugin with `elizaos create --type project`, you can start developing your plugin and integrate it to your Eliza v2 project.\n\n**Q: Are auto.fun solana program (contracts) audited?**  \nA: Yes, by Spearbit/Cantina.\n\n**Q: Could you explain the reasoning behind choosing the standard lockLp function (temporary lock) for the Raydium liquidity migration instead of the burnAndEarn.createLockInstruction (permanent lock/burn) feature?**  \nA: We do use the `feenftowner` but it's the custom vault. There's more plans for the NFT than just creator fee claiming.\n\n**Q: How do I fix the EVM plugin when it's not connecting properly?**  \nA: Set an `EVM_DEFAULT_CHAIN` environment variable to specify your primary network when using multiple provider URLs.\n\n**Q: What logs should I check for EVM connection issues?**  \nA: Check `/var/log/elizaos/agent.log` for EVM connection details.\n\n**Q: What environment variables are required for the EVM plugin?**  \nA: `PROVIDER_URL` and `CHAIN_ID` are required, and `EVM_DEFAULT_CHAIN` when using multiple networks.\n\n## Community Help & Collaboration\n\n### EVM Plugin Troubleshooting\n- **Helper:** Ruby\n- **Helpee:** ItzMrTobz\n- **Context:** User had configured multiple Ethereum provider URLs (Arbitrum, Polygon, Fantom, Base) but encountered \"no wallet or connection\" error when attempting transfers\n- **Resolution:** Ruby identified the missing `EVM_DEFAULT_CHAIN` environment variable and provided solution to set a default chain (e.g., \"arbitrum\")\n\n### Plugin Development Guidance\n- **Helper:** DeFine\n- **Helpee:** lantianlaoli\n- **Context:** User needed guidance on developing plugins for Eliza V2\n- **Resolution:** Directed to documentation at eliza.how/docs/core/plugins and provided command `elizaos create --type project` to create a template plugin\n\n## Action Items\n\n### Technical\n- **Add MIT license to repository**\n  - Description: License needs to be added to allow code usage\n  - Mentioned By: AD\n- **Add EVM_DEFAULT_CHAIN environment variable when using multiple provider URLs**\n  - Description: Set a primary network (e.g., \"arbitrum\") as default for the EVM plugin to function properly\n  - Mentioned By: Ruby\n- **Develop plugin for Eliza V2**\n  - Description: User needs to develop a plugin without requiring multiple agents\n  - Mentioned By: lantianlaoli\n\n### Documentation\n- **Update EVM plugin documentation**\n  - Description: Clarify the requirement for EVM_DEFAULT_CHAIN when using multiple provider URLs\n  - Mentioned By: Ruby\n- **Provide explanation of code structure changes between V1 and V2**\n  - Description: User cannot find agent runtime code in V2 branch\n  - Mentioned By: lantianlaoli"
        }
      ]
    }
  },
  "github": {
    "summaries": {
      "week": [
        {
          "filename": "2025-04-27.md",
          "content": "# ElizaOS Weekly Update (Week of Apr 27, 2025)\n\n## OVERVIEW\nThis week saw significant improvements to the ElizaOS framework with a focus on enhancing developer experience, fixing critical bugs, and improving plugin functionality. Key achievements include scopable knowledge implementation, Discord plugin enhancements, and comprehensive CLI command updates.\n\n## PROJECT METRICS\n- PRs: 29 merged PR's, 31 new PRs\n- Issues: 0 new issues, 0 closed issues\n- Unique Contributors: 23\n- Code Changes: +6059/-21763 lines across 140 files\n- Total Commits: 92\n- Most Active Contributors: wtfsayo, lalalune, 0xbbjoker, tcm390, samarth30\n\n## TOP ISSUES\n\n### Plugin Integration Challenges\n- Several issues related to plugin functionality were addressed, particularly with Discord, Anthropic, and Twitter integrations\n- Error handling improvements were needed for various edge cases, including disk space limitations\n\n### Developer Experience Friction\n- CLI command instructions required updates to improve clarity and usability\n- Documentation links and image paths needed fixing to ensure proper resource accessibility\n- Environment setup and configuration issues in Docker containers needed resolution\n\n## KEY TECHNICAL DEVELOPMENTS\n\n### Enhanced Plugin Functionality\n- Added typing indicator support in Discord plugin [#4364](https://github.com/elizaos/eliza/pull/4364)\n- Implemented API key validation for Anthropic plugin model calls [#4383](https://github.com/elizaos/eliza/pull/4383)\n- Fixed Discord plugin error handling when services are missing [#4375](https://github.com/elizaos/eliza/pull/4375)\n- Added model/plugin name logging when models are used [#4394](https://github.com/elizaos/eliza/pull/4394)\n\n### Improved Developer Experience\n- Implemented scopable knowledge functionality [#4390](https://github.com/elizaos/eliza/pull/4390)\n- Updated ElizaOS create command instructions [#4381](https://github.com/elizaos/eliza/pull/4381)\n- Added automatic rebuild of core and plugin-bootstrap in monorepo context [#4388](https://github.com/elizaos/eliza/pull/4388)\n- Added .env.example in project-starter for easier configuration [#4387](https://github.com/elizaos/eliza/pull/4387)\n- Fixed ESM type declarations in Core [#4341](https://github.com/elizaos/eliza/pull/4341)\n- Updated documentation with improved quick start and CLI commands [#4379](https://github.com/elizaos/eliza/pull/4379)\n\n### Infrastructure and Maintenance\n- Fixed Postgres database issues in Docker containers [#4363](https://github.com/elizaos/eliza/pull/4363)\n- Improved error handling for disk space limitations [#4389](https://github.com/elizaos/eliza/pull/4389)\n- Fixed agent deletion functionality [#4395](https://github.com/elizaos/eliza/pull/4395)\n- Removed plugin-evm from monorepo [#4386](https://github.com/elizaos/eliza/pull/4386), [#4399](https://github.com/elizaos/eliza/pull/4399)\n- Enhanced UI with cleaner design and minor improvements [#4393](https://github.com/elizaos/eliza/pull/4393)"
        }
      ],
      "month": [
        {
          "filename": "2025-04-01.md",
          "content": "# ElizaOS Monthly Update (April 2025)\n\n## OVERVIEW\nApril saw significant enhancements to ElizaOS with major improvements to the CLI, GUI, and plugin ecosystem. Key achievements include expanded AI model provider integrations, enhanced messaging capabilities, improved TTS functionality, and substantial fixes to core components and plugins.\n\n## PROJECT METRICS\n- PRs: 195 merged PR's, 232 new PRs\n- Issues: 43 new issues, 35 closed issues\n- Unique Contributors: 88\n- Code Changes: +55467/-37251 lines across 489 files\n- Total Commits: 828\n- Most Active Contributors: wtfsayo, tcm390, 0xbbjoker, Samarthsinghal28, HarshModi2005\n\n## TOP ISSUES\n\n### CLI Usability and Consistency\n- Command inconsistencies between v1 and v2\n- Installation and update workflow issues\n- Project creation and agent management challenges\n\n### Plugin Management\n- Plugin installation priority ordering issues\n- Dynamic loading and versioning problems\n- Plugin dependency conflicts\n\n### AI Model Integration\n- JSON parsing errors with Anthropic and OpenAI responses\n- Model validation and authentication issues\n- Embedding model selection and configuration\n\n### Database and Transaction Handling\n- Transaction deadlocks in database operations\n- Migration issues with PgLite\n- Entity relationship inconsistencies\n\n### Messaging and Communication\n- Duplicate message creation\n- Twitter interaction failures\n- Telegram data synchronization problems\n\n### User Interface\n- Knowledge manager scroll issues\n- Missing UI components after merge conflicts\n- Inconsistent character creation workflow\n\n### Performance and Resource Management\n- Disk space management and error handling\n- Memory leaks and caching issues\n- Runtime initialization sequence problems\n\n### Documentation and Onboarding\n- Inconsistent or outdated CLI documentation\n- Missing environment configuration examples\n- Broken documentation links\n\n## KEY TECHNICAL DEVELOPMENTS\n\n### Enhanced AI Model Provider Ecosystem\n- Added Kluster AI as a model provider [#3938](https://github.com/elizaos/eliza/pull/3938)\n- Added Mem0 as AI SDK Provider [#3927](https://github.com/elizaos/eliza/pull/3927)\n- Improved OpenAI plugin with ability to choose embedding models [#4140](https://github.com/elizaos/eliza/pull/4140)\n- Added model/plugin name logging when model is used [#4394](https://github.com/elizaos/eliza/pull/4394)\n\n### Voice and Speech Capabilities\n- Implemented OpenAI TTS functionality [#4255](https://github.com/elizaos/eliza/pull/4255)\n- Added testing for OpenAI TTS [#4259](https://github.com/elizaos/eliza/pull/4259)\n- Fixed speech-to-text transcription issues [#4236](https://github.com/elizaos/eliza/pull/4236)\n- Fixed OpenAI STT functionality [#4329](https://github.com/elizaos/eliza/pull/4329)\n\n### CLI Improvements\n- Added update-cli command for easier updates [#4170](https://github.com/elizaos/eliza/pull/4170)\n- Enhanced CLI update and plugin installation with package manager [#4176](https://github.com/elizaos/eliza/pull/4176)\n- Implemented CLI test suite [#4301](https://github.com/elizaos/eliza/pull/4301)\n- Updated ElizaOS create command instructions [#4381](https://github.com/elizaos/eliza/pull/4381)\n\n### Messaging and Interaction Enhancements\n- Added message API for improved communication [#4247](https://github.com/elizaos/eliza/pull/4247)\n- Added message buttons for interactive responses [#4187](https://github.com/elizaos/eliza/pull/4187)\n- Improved Reply Action to use pre-generated responses [#4213](https://github.com/elizaos/eliza/pull/4213)\n- Added typing indicators to Telegram [#4280](https://github.com/elizaos/eliza/pull/4280) and Discord [#4364](https://github.com/elizaos/eliza/pull/4364)\n\n### Plugin System Improvements\n- Better plugin installation management [#4177](https://github.com/elizaos/eliza/pull/4177)\n- Added test coverage for plugin-bootstrap [#4173](https://github.com/elizaos/eliza/pull/4173)\n- Enabled path params routes for plugins [#4335](https://github.com/elizaos/eliza/pull/4335)\n- Fixed plugin install priority order [#4256](https://github.com/elizaos/eliza/pull/4256)\n\n### GUI Enhancements\n- Added support for importing JSON to create or update agents [#4270](https://github.com/elizaos/eliza/pull/4270)\n- Enhanced GUI with various improvements [#4300](https://github.com/elizaos/eliza/pull/4300)\n- Added confirmation dialog for delete group [#4310](https://github.com/elizaos/eliza/pull/4310)\n- Implemented onboarding tour [#4293](https://github.com/elizaos/eliza/pull/4293)\n\n### Social Media Integration\n- Enhanced Telegram logic with middlewares [#4125](https://github.com/elizaos/eliza/pull/4125)\n- Added Telegram community manager [#4134](https://github.com/elizaos/eliza/pull/4134)\n- Improved Twitter plugin with support for long tweets [#4291](https://github.com/elizaos/eliza/pull/4291)\n- Added deleteTweet() functionality [#4320](https://github.com/elizaos/eliza/pull/4320)\n\n### Knowledge and Memory Management\n- Implemented scopable knowledge [#4390](https://github.com/elizaos/eliza/pull/4390)\n- Fixed knowledge types [#4243](https://github.com/elizaos/eliza/pull/4243)\n- Replaced fastembed with local embedding model [#4205](https://github.com/elizaos/eliza/pull/4205)\n- Fixed cache interaction cursor and duplicate memory creation [#4155](https://github.com/elizaos/eliza/pull/4155)\n\n### Logging and Monitoring\n- Added OpenAI model usage events [#4230](https://github.com/elizaos/eliza/pull/4230)\n- Restored support for Cloudflare LLM logging/tracking [#4354](https://github.com/elizaos/eliza/pull/4354)\n- Added docstrings to cloudflare-logging [#4355](https://github.com/elizaos/eliza/pull/4355)\n- Improved logging for transcription models [#4283](https://github.com/elizaos/eliza/pull/4283)\n\n## SUMMARY\nApril 2025 was a productive month for ElizaOS with significant improvements across the platform. The team expanded AI model provider integrations, enhanced messaging capabilities, improved voice and speech features, and fixed numerous issues in the core system and plugins. The CLI and GUI received substantial upgrades, making the platform more user-friendly and robust. These developments have strengthened ElizaOS's position as a versatile, modular AI agent framework capable of operating across diverse ecosystems."
        }
      ]
    }
  }
}
