{
  "ai-news": {
    "elizaos": {
      "discord_md_last_3_days": [
        {
          "filename": "2025-05-04.md",
          "content": "# elizaOS Discord - 2025-05-04\n\n## Overall Discussion Highlights\n\n### Security Incident with Token Verification\n- Multiple users reported losing money after purchasing tokens on Auto.fun that displayed verification checkmarks but were later revealed to be scams\n- Three specific token addresses were identified as exploited tokens: HgcHazC3qtetGZZBJ2wYkfkUmDZNUn5D4AmLbKG52FUN, 8jxqtVUjKJFonRzXGGeTzPBBegQAV3111EY97EV8sFUN, 78ShedfKV1iszLyRbjHVE46z5p7PRgPvQNwBTUqVRVSN\n- Kenk confirmed the team has investigated the issue, marked the contracts as scams, and isolated the verification process\n- The team requested 24 hours to implement a fix for the verification vulnerability\n- Users expressed frustration about the lack of transparency and demanded refunds for their losses\n\n### ElizaOS Development Updates\n- Shaw mentioned that \"Vibe coding\" agent feature is live on the `v2-develop` branch but with limited functionality\n- More updates to this feature expected in the coming weeks\n- A demo session was announced featuring seven different builders showcasing their projects: Steambot Willie, The Intern, ProAgentAI, Data Barista, Soulmates, Bork, and Phala + Eliza in TEE\n\n### Technical Implementation Challenges\n- Users reported difficulties with RAG Knowledge functionality, noting it pulls from OpenAI's prior knowledge rather than the provided knowledge base\n- Twitter API integration issues were discussed, with one user reporting their API account being limited after spending $400\n- Questions about execution order of provider, generateText, and evaluator handler functions in ElizaOS v0.25 were raised\n- A user reported losing access to chat rooms despite being a token holder\n\n## Key Questions & Answers\n\n**Q: Is Vibe coding getting rolled out in v2?**  \nA: The agent is live on the `v2-develop` branch but with limited functionality currently, with more updates coming in the next couple weeks. (answered by shaw)\n\n**Q: What does the verified badge on Auto.fun mean?**  \nA: It means \"the token is legit by one of the partners\" (answered by vas)\n\n**Q: What were the three exploited tokens with false verification?**  \nA: HgcHazC3qtetGZZBJ2wYkfkUmDZNUn5D4AmLbKG52FUN, 8jxqtVUjKJFonRzXGGeTzPBBegQAV3111EY97EV8sFUN, 78ShedfKV1iszLyRbjHVE46z5p7PRgPvQNwBTUqVRVSN (answered by vas)\n\n**Q: Could we get a follow up and confirmation that the exploit is fixed?**  \nA: The team is still exploring it. There's no 'exploit' as such. They have a fix and have isolated the verification process, requesting 24 hours to address the issue. (answered by Kenk)\n\n**Q: Do you think it was an inside job?**  \nA: No, the team had a look, marked the contracts as scams, and determined everything was safe. (answered by Kenk)\n\n## Community Help & Collaboration\n\n- **User Access Issue**: human_nalejzpa helped Skullcross with their issue of losing roles and chat room access despite being a token holder, indicating they need to wait for someone to return from weekend vacation to fix the issue\n\n- **RAG Knowledge Resources**: rahmsc shared Discord message links to previous discussions about RAG knowledge implementation to help other users facing similar issues\n\n- **ElizaOS Versioning Clarification**: rahmsc explained to users that v2 is the new version of ElizaOS (beta.1.0.0)\n\n- **Verification Exploit Evidence**: vas and frank_grimes_sr provided evidence and token addresses of falsely verified tokens that were later unverified, helping the community understand the scope of the security incident\n\n## Action Items\n\n### Technical\n- **Fix verification system exploit** that allowed scam tokens to appear as verified | Mentioned by vas\n- **Resolve issue with token holders losing access** to roles and chat rooms | Mentioned by Skullcross\n- **Investigate why RAG Knowledge function** pulls from OpenAI's prior knowledge instead of provided knowledge base | Mentioned by rahmsc\n- **Resolve Twitter integration issues** in eliza-starter when credentials are properly configured | Mentioned by rahmsc\n- **Address execution order** of provider, generateText, and evaluator handler functions | Mentioned by 2spooky\n- **Investigate X API limitations** and potential configuration issues to prevent flagging | Mentioned by DavidRounders\n- **Fix Twitter link on CoinGecko page** for AI16Z coin that redirects to a placeholder page | Mentioned by Angelon\n- **Implement image generation functionality** for Eliza-Twitter integration | Mentioned by Tamplayz\n- **Continue development of \"Vibe coding\"** functionality | Mentioned by shaw\n\n### Documentation\n- **Create a post-mortem report** about the verification exploit incident | Mentioned by frank_grimes_sr\n- **Provide clear explanation** of what \"verified\" status means on the platform | Mentioned by gummy\n\n### Feature\n- **Implement better verification standards** that indicate legitimate projects with real utility rather than just X account connections | Mentioned by gummy\n- **Consider implementing verification** only after official Auto.fun tweet confirmation | Mentioned by Tocheee\n- **Implement refund mechanism** for users who lost funds due to verified scam tokens | Mentioned by frank_grimes_sr"
        },
        {
          "filename": "2025-05-03.md",
          "content": "# elizaOS Discord - 2025-05-03\n\n## Overall Discussion Highlights\n\n### Project Structure & Development\n- The ElizaOS ecosystem includes multiple components:\n  - **AI16Z**: Focused on venture capital but \"fully AI\" with market cap fluctuating between $300-340M\n  - **Auto.fun**: Recently launched open-source project for token creation/trading\n  - **ElizaOS v1/Eliza v2**: AI agent framework (core codebase under development)\n  - **DegenAI**: Associated with Degenspartan AI, with $4M market cap\n\n### Technical Issues\n- **Critical Codebase Problems**: TypeScript build errors in the elizaos/core package related to missing 'preconnect' property in fetch type definition\n- **Documentation Inconsistencies**: API examples no longer match actual implementation\n- **Collabland Verification Issues**: Persistent problems (48+ hours) with role verification for token holders\n- **Security Vulnerability**: Fake verified tokens appearing on Auto.fun platform, causing financial losses\n\n### Auto.fun Platform Discussions\n- **Token Economics**: Creators capture 90% of fees generated on native tokens\n- **Fee Structure**: Imported tokens likely don't generate the same fees since they use existing liquidity pools\n- **Community Vigilance**: Users actively identifying suspicious tokens, preventing potential scams\n\n## Key Questions & Answers\n\n### Project Information\n- **Q**: What is being built now? I thought ai16z was about replacing venture capital but all I see are stuff about trading bots?  \n  **A**: \"We are doing some VC, but it'll be fully AI. We have auto.fun, that we launched a few weeks ago. It's open source, as well. And we are working on ElizaOS v1, or Eliza v2... our AI agent/ai agent framework codebase. We also have degenai, which is degenspartan ai.\"\n\n- **Q**: Please what's this project all about ELI5?  \n  **A**: \"ELI5 is amazing, it has so much potential. can't wait to see ELI5 become a bot on twitter, telegram and potentially reshape education & FAQ sections on websites\"\n\n### Platform Functionality\n- **Q**: Is there a way to preset slippage on auto fun?  \n  **A**: \"I don't think so. I haven't seen anyone mention that, and I've been unable to do that myself.\"\n\n- **Q**: What are the fun-creator rewards? How much % of volume after migration does the dev wallet receive?  \n  **A**: \"Creators of the token capture 90% of the fees generated. It depends on gas fees at time of execution and LP.\"\n\n- **Q**: When importing a token, how do fees work? Will there be fees generated if volume transitions to auto.fun?  \n  **A**: \"I'd assume no fees are generated on imported tokens, since they already have liquidity pools that we don't control for trading.\"\n\n## Community Help & Collaboration\n\n### Security & Scam Prevention\n- **Simon** identified a suspicious token claiming to be \"comput3\" that appeared verified. **Kenk** confirmed with the team that it was fake and flagged it, preventing Simon from investing.\n\n### Technical Support\n- **yikesawjeez** assisted **Void** with role verification issues, requesting wallet address and screenshots to troubleshoot.\n- **jin** acknowledged Collabland verification issues affecting multiple users and began investigating.\n- **Osint** explained to **Ric Q** that responses from another team member would likely come on Monday due to the weekend.\n\n### Platform Usage\n- **yikesawjeez** helped **SYMBiEX** understand the fee structure for imported tokens versus native Auto.fun launches.\n- **Osint** suggested to **nasdaq.ai** to submit a report to support when they couldn't share video from auto.fun to X.\n\n## Action Items\n\n### Technical\n- **Fix Collabland role verification issues** (Mentioned by multiple users)\n- **Fix TypeScript error regarding missing 'preconnect' property** in fetch type definition (Mentioned by lantianlaoli)\n- **Implement pre-push code quality checks** to prevent broken code from being pushed to main branch (Mentioned by lantianlaoli)\n- **Investigate and fix vulnerability** allowing fake verified tokens on the platform (Mentioned by frank_grimes_sr)\n- **Implement refund process** for users affected by fake verified tokens (Mentioned by frank_grimes_sr)\n- **Improve token verification system** to address issue that allowed fake token to appear verified (Mentioned by Kenk)\n\n### Documentation\n- **Clarify the different projects under development** (AI16Z, Auto.fun, ElizaOS, DegenAI) (Mentioned by EBITDA)\n- **Update API documentation** to match current implementation (Mentioned by lantianlaoli)\n- **Clarify what \"verified\" status actually means** for tokens on the platform (Mentioned by yikesawjeez)\n- **Explain fee structure** for migrated vs. native tokens (Mentioned by SYMBiEX)\n- **Provide guidance on volume generation strategies** for tokens (Mentioned by nasdaq.ai)\n\n### Features\n- **Continue development on ElizaOS v1/Eliza v2** AI agent framework (Mentioned by Osint)\n- **Create Twitter agent for specific blockchain projects** that posts daily updates and news (Mentioned by MIR)\n- **Implement cryptocurrency market data functionality** (CMC info retrieval for price, volume, marketcap) (Mentioned by lantianlaoli)\n- **Add token swap and transfer with status feedback** (UI feedback during transactions and tx hash links) (Mentioned by lantianlaoli)\n- **Implement token deployment functionality** (Mentioned by lantianlaoli)\n- **Integrate with wallet connection** instead of private keys for improved security (Mentioned by lantianlaoli)\n- **Add ability to preset slippage on auto.fun** (Currently resets to 2% each time) (Mentioned by noj)\n- **Pin degenai on auto.fun** for better visibility (Mentioned by Void)\n- **Add social media sharing functionality** (\"share on X\" button for coins) (Mentioned by Spyros)"
        }
      ],
      "dev_md_last_3_days": [
        {
          "filename": "2025-05-04.md",
          "content": "# elizaOS Development Discord - 2025-05-04\n\n## Overall Discussion Highlights\n\n### Plugin Development in V2\n- Users are experiencing challenges with plugin development in elizaOS V2, particularly due to outdated documentation that doesn't align with the latest codebase\n- The community is actively sharing workarounds and solutions for plugin integration\n- Several commands were shared for creating and testing plugins:\n  - `npx @elizaos/cli@beta create` - Create new projects for plugin development\n  - `bun run dev` - Run development environment\n  - `elizaos --help` - Access the latest command information\n\n### Upcoming Releases\n- **V2 Release Timeline**: shaw mentioned that V2 will be released in approximately two weeks\n- Improved tutorials are planned to accompany the V2 release\n- Official documentation is available at docs.eliza.how, though some sections may need updates\n\n## Key Questions & Answers\n\n**Q: How do I add plugins in version V2 and test them after development?** (asked by lantianlaoli)  \n**A:** Put plugins into packages or use \"npx @elizaos/cli@beta create\" to create a project, then \"bun run dev\" in it, and add plugins by bun installing or adding to the character object in the plugins string (answered by shaw)\n\n**Q: Is there a plugin starter available?** (asked by ItzMrTobz)  \n**A:** Yes, it's available at https://github.com/elizaOS/eliza/tree/v2-develop/packages/plugin-starter (answered by sayonara)\n\n## Community Help & Collaboration\n\n- **shaw** provided detailed guidance to **lantianlaoli** who was confused about the plugin development workflow in V2, offering specific commands and explaining the process for creating projects and adding plugins\n- **sayonara** helped **ItzMrTobz** by sharing the GitHub link to the official plugin starter repository\n- The community is actively sharing workarounds while waiting for documentation to be updated\n\n## Action Items\n\n### Technical\n- Update documentation to match latest code and commands (mentioned by lantianlaoli)\n- Fix incorrect plugin path syntax in test commands - missing ./ prefix (mentioned in agent-dev-school)\n\n### Documentation\n- Create comprehensive tutorial series for V2 (mentioned by shaw)\n- Update official docs.eliza.how with V2-specific information\n\n### Feature\n- Release elizaOS V2 in approximately two weeks (mentioned by shaw)\n\n---\n\n*Note: A brief acknowledgment message \"noted\" was posted by shaw in the feedback channel, but without additional context.*"
        },
        {
          "filename": "2025-05-03.md",
          "content": "# elizaOS Development Discord - 2025-05-03\n\n## Overall Discussion Highlights\n\n### Development Branches & Version Management\n- Discussion about the differences between ElizaOS version 1.0.0.Beta 41 (current stable release) and V2 (development branch)\n- V2 branch includes new features like improved plugin architecture, enhanced character system, and better multimodal support\n- Timeline for V2 stable release is estimated at \"a few months\" according to Ruby\n- Clarification that \"v2-develop\" is the recommended branch for plugin development\n\n### CLI Installation Issues\n- Multiple users experienced difficulties updating the ElizaOS CLI from beta.38 to beta.41\n- Various installation methods were attempted (npm, GitHub, local build) with mixed results\n- Persistent version conflicts observed where the system reports an older version despite successful installation of newer version\n\n### Feature Requests\n- Request for cryptocurrency-related functionality including:\n  - Token price/data retrieval\n  - Token swapping and transfers with status updates\n  - Token deployment capabilities\n  - Wallet connection integration\n\n## Key Questions & Answers\n\n**Q: What is the difference between ElizaOS version 1.0.0.Beta 41 and V2?**  \nA: V2 is the development branch which will eventually become 2.0, while beta.41 is the current stable release. V2 has a new plugin architecture, improved character system, and better multimodal support. (answered by Ruby)\n\n**Q: When will V2 be available?**  \nA: V2's timeline is still fluid, but we're looking at a few months for stable release. (answered by Ruby)\n\n**Q: Which codebase should I use to develop a simple text chat plugin?**  \nA: Use the v2-develop branch. (answered by shaw)\n\n**Q: How can I update the ElizaOS CLI from beta.38 to beta.41?**  \nA: Try running 'npm i -g @elizaos/cli@beta' to install the latest beta version directly. (answered by sayonara)\n\n## Community Help & Collaboration\n\n1. **CLI Update Troubleshooting**\n   - Helper: Ruby & sayonara\n   - Helpee: kandizzy\n   - Context: CLI update failing with 404 error\n   - Resolution: Partially successful - guided through multiple approaches including npm install, GitHub install, and building from monorepo, but version conflict persisted\n\n2. **Plugin Development Guidance**\n   - Helper: shaw\n   - Helpee: lantianlaoli\n   - Context: User was confused about which codebase to use for developing a text chat plugin\n   - Resolution: Suggested using \"v2-develop\" branch\n\n3. **Version Clarification**\n   - Helper: Ruby\n   - Helpee: BMK\n   - Context: Confusion about ElizaOS versions\n   - Resolution: Explained that V2 is the development branch with new features while Beta 41 is the stable release\n\n## Action Items\n\n### Technical\n- Fix dependency loop issues in bun link/unlink functionality (Mentioned by Ruby)\n- Resolve version reporting inconsistency between npm and elizaos CLI (Mentioned by kandizzy)\n- Develop a text chat plugin using the v2-develop branch (Mentioned by lantianlaoli)\n- Address unspecified issue in next beta release (Mentioned by sayonara)\n\n### Feature Development\n- Create functionality to retrieve token information (price, volume, marketcap) (Mentioned by OpsDev | Onyx)\n- Implement token swap and transfer functionality with status updates and transaction hash links (Mentioned by OpsDev | Onyx)\n- Add token deployment capabilities (Mentioned by OpsDev | Onyx)\n- Integrate wallet connection without private key usage (Mentioned by OpsDev | Onyx)\n\n### Documentation\n- Create clearer documentation about version differences between stable and development branches (Mentioned by BMK)"
        }
      ]
    }
  },
  "github": {
    "summaries": {
      "week": [
        {
          "filename": "2025-05-04.md",
          "content": "# ElizaOS Weekly Update (Week of May 4, 2025)\n\n## OVERVIEW\nThis week focused on CLI improvements, environment variable handling refactoring, and plugin enhancements. Notable progress includes fixing version detection, improving the publish command, and adding usage tracking for OpenAI embeddings and image descriptions.\n\n## PROJECT METRICS\n- PRs: 11 merged PRs, 5 new PRs\n- Issues: 0 new issues, 0 closed issues\n- Unique Contributors: 11\n- Code Changes: +2565/-1677 lines across 76 files\n- Total Commits: 68\n- Most Active Contributors: wtfsayo, lalalune, michavie, 0xbbjoker\n\n## TOP ISSUES\n\n### CLI Functionality and Reliability\n- Version detection was showing incorrect latest CLI version\n- The `elizaos publish` command needed refactoring and enhancement\n\n### Plugin System Stability\n- Plugin routes were not functioning correctly\n- ESM type generation issues in multiple packages (SQL, Bootstrap, OpenAI)\n\n## KEY TECHNICAL DEVELOPMENTS\n\n### CLI Improvements and Refactoring\n- Fixed incorrect version detection to show correct latest CLI version in [#4435](https://github.com/elizaos/eliza/pull/4435)\n- Refactored and enhanced the `elizaos publish` CLI command in [#4424](https://github.com/elizaos/eliza/pull/4424)\n- Updated CLI command documentation in [#4448](https://github.com/elizaos/eliza/pull/4448)\n\n### Plugin System Enhancements\n- Fixed plugin routes functionality in [#4415](https://github.com/elizaos/eliza/pull/4415)\n- Added model usage events for embeddings and image description in OpenAI plugin in [#4438](https://github.com/elizaos/eliza/pull/4438)\n- Fixed ESM type generation in SQL, Bootstrap, and OpenAI packages in [#4442](https://github.com/elizaos/eliza/pull/4442)\n\n### Environment and Code Quality Improvements\n- Refactored environment variable handling in [#4445](https://github.com/elizaos/eliza/pull/4445)\n- Added docstrings to `refactor-env` in [#4446](https://github.com/elizaos/eliza/pull/4446)\n- Organized imports and implemented relative paths in [#4447](https://github.com/elizaos/eliza/pull/4447)\n\n### Documentation Updates\n- Added blog for Twitter agent setup in [#4425](https://github.com/elizaos/eliza/pull/4425)\n- Fixed title spacing in documentation in [#4443](https://github.com/elizaos/eliza/pull/4443)"
        }
      ],
      "month": [
        {
          "filename": "2025-05-01.md",
          "content": "# ElizaOS Monthly Update (May 2025)\n\n## OVERVIEW\nMay focused on streamlining the ElizaOS framework through significant plugin architecture improvements, enhanced authentication, and Twitter integration capabilities. The team also conducted extensive cleanup by removing several deprecated plugins from the monorepo.\n\n## PROJECT METRICS\n- PRs: 27 merged PR's, 34 new PRs\n- Issues: 3 new issues, 7 closed issues\n- Unique Contributors: 22\n- Code Changes: +3845/-10670 lines across 178 files\n- Total Commits: 199\n- Most Active Contributors: 0xbbjoker, wtfsayo, tcm390, lalalune, yungalgo\n\n## TOP ISSUES\n\n### Authentication Challenges\n- Inconsistent authentication flows across different plugins\n- API key management needed improvement for better user experience\n\n### Plugin Architecture Limitations\n- Plugin routing system had reliability issues\n- Environment variable management was overly complex\n\n### CLI Usability Problems\n- Version detection showing incorrect latest CLI version\n- Publish command needed refactoring for better developer experience\n\n### Twitter Integration Gaps\n- Missing documentation for Twitter agent setup\n- Timeline functionality needed implementation\n\n### Type System Inconsistencies\n- ESM type generation issues in multiple packages\n- Documentation gaps in refactored environment handling\n\n## KEY TECHNICAL DEVELOPMENTS\n\n### Authentication Enhancements\n- Added comprehensive auth middleware with API key dialog for unauthorized requests [#4420](https://github.com/elizaos/eliza/pull/4420)\n- Improved security and user experience for authentication flows\n\n### Twitter Integration\n- Implemented Twitter timeline functionality [#4429](https://github.com/elizaos/eliza/pull/4429)\n- Added comprehensive blog documentation for Twitter agent setup [#4425](https://github.com/elizaos/eliza/pull/4425)\n- Performed cleanup and optimization of Twitter plugin [#4430](https://github.com/elizaos/eliza/pull/4430)\n\n### OpenAI Plugin Improvements\n- Extended OpenAI plugin to support custom embedding endpoints [#4421](https://github.com/elizaos/eliza/pull/4421)\n- Added model usage event emission for embeddings and image descriptions [#4438](https://github.com/elizaos/eliza/pull/4438)\n- Optimized model selection by using smaller models for replies [#4416](https://github.com/elizaos/eliza/pull/4416)\n\n### CLI Enhancements\n- Fixed incorrect version detection to show correct latest CLI version [#4435](https://github.com/elizaos/eliza/pull/4435)\n- Refactored and enhanced the ElizaOS publish CLI command [#4424](https://github.com/elizaos/eliza/pull/4424)\n- Updated CLI command documentation [#4448](https://github.com/elizaos/eliza/pull/4448)\n\n### Plugin System Optimization\n- Fixed plugin routing functionality [#4415](https://github.com/elizaos/eliza/pull/4415)\n- Removed forced bootstrap plugin addition [#4417](https://github.com/elizaos/eliza/pull/4417)\n- Eliminated unnecessary Express object creation [#4414](https://github.com/elizaos/eliza/pull/4414)\n\n### Environment Management\n- Refactored environment variable handling for better maintainability [#4445](https://github.com/elizaos/eliza/pull/4445)\n- Added comprehensive docstrings to refactored environment code [#4446](https://github.com/elizaos/eliza/pull/4446)\n- Implemented unique PGLite folder usage when not explicitly provided [#4423](https://github.com/elizaos/eliza/pull/4423)\n\n### Monorepo Cleanup\n- Removed multiple deprecated plugins from the monorepo including browser [#4406](https://github.com/elizaos/eliza/pull/4406), storage-s3 [#4402](https://github.com/elizaos/eliza/pull/4402), ollama [#4437](https://github.com/elizaos/eliza/pull/4437), groq [#4436](https://github.com/elizaos/eliza/pull/4436), venice [#4434](https://github.com/elizaos/eliza/pull/4434), and anthropic [#4427](https://github.com/elizaos/eliza/pull/4427)\n- Eliminated hackish solution for copying migrations [#4422](https://github.com/elizaos/eliza/pull/4422)\n\n### Code Quality Improvements\n- Fixed ESM type generation in SQL, Bootstrap & OpenAI packages [#4442](https://github.com/elizaos/eliza/pull/4442)\n- Organized imports and implemented relative paths [#4447](https://github.com/elizaos/eliza/pull/4447)\n- Made various template fixes and documentation improvements [#4431](https://github.com/elizaos/eliza/pull/4431), [#4443](https://github.com/elizaos/eliza/pull/4443)\n\n## SUMMARY\nMay 2025 was a productive month for ElizaOS with significant improvements to the plugin architecture, authentication system, and Twitter integration capabilities. The team successfully streamlined the codebase by removing deprecated plugins while enhancing developer experience through CLI improvements and better documentation. These changes have made the framework more modular, secure, and user-friendly, aligning with ElizaOS's core philosophy of autonomy, adaptability, and open collaboration."
        }
      ]
    }
  }
}
