{
  "ai-news": {
    "elizaos": {
      "discord_md_last_3_days": [
        {
          "filename": "2025-04-26.md",
          "content": "# elizaOS Discord - 2025-04-26\n\n## Overall Discussion Highlights\n\n### ElizaOS Ecosystem Development\n- **Auto.fun Platform**: Recently open-sourced (less than a week old), allowing community contributions. The platform has enhanced security through a liquidity pool funded by buy fees from tokens launched on Auto.fun.\n- **Development Approach**: The team operates without strict roadmaps or deadlines, focusing on continuous development. Shaw is actively working on Eliza v2 and auto.fun.\n- **Token Migration Debate**: Discussions about migrating from ai16z to ElizaOS due to frustrations with developer Baoskee. DorianD advocated for a 1:1.11 swap ratio for early adopters, while HoneyBadger expressed concerns about potential volume drop based on Polygon's migration experience.\n- **QUILL Token Incident**: A bug in the Auto.fun platform incorrectly displayed the amount of QUILL per SOL, allowing someone to drain the liquidity pool. The team acknowledged this as a bug (not an exploit) and promised SOL refunds to affected users.\n\n### Technical Developments\n- **Plugin Development**: Developers are working on plugins for elizaOS v2, including a Livepeer plugin (PR #48) that offers free incentivized inference.\n- **Character Animation System**: Progress reported on implementing a show that steps through JSON data and loads audio with visemes. Artists need to fix viseme order and schema for each character.\n- **Platform Issues**: Several users reported problems with token migration being stuck for extended periods (up to 20 hours) and website loading issues on Auto.fun.\n\n### Community Governance\n- **Discord Moderation**: Discussions about moderation practices after a user was temporarily kicked from the server. Suggestions included moving dangerous permissions to a bot with a supermod team having access to cold admin accounts.\n- **DAO Development**: Mentions of creating a voting module for the DAO and solutions for migrating DAO treasury funds during a potential token swap.\n\n## Key Questions & Answers\n\n### ElizaOS and Auto.fun\n- **Q**: What is the future of Auto.fun in the roadmap and development plan?  \n  **A**: The team is working on Eliza v2 and auto.fun; they don't operate on strict roadmaps but focus on continuous development.\n\n- **Q**: Will there be further development for Auto.fun, $AI16Z, and ElizaOS, or will it simply remain a token launching platform like Pump.fun?  \n  **A**: The platform is less than a week old and open-sourced, which is unique compared to other launchpads that gatekeep their code.\n\n- **Q**: How will Auto.fun benefit DegenAI?  \n  **A**: Through ai16z driving buybacks for DegenAI.\n\n### Technical Issues\n- **Q**: What happened to the $QUILL token?  \n  **A**: There was a bug that incorrectly showed the amount of Quill per SOL, allowing someone to sell Quill into the LP at a premium and drain it. This was a bug on their side, and they deployed a fix. All users who bought this token will be refunded in SOL.\n\n- **Q**: Will users who bought QUILL before and after bonding be refunded?  \n  **A**: Users should fill out the Tally form with transaction details for review.\n\n- **Q**: Is token creation stopped temporarily until the bug is resolved?  \n  **A**: It's an isolated issue directly tied to the migration of that specific token - no other tokens are impacted.\n\n- **Q**: Are auto.fun tokens mintable?  \n  **A**: Not mintable.\n\n- **Q**: Is the site working?  \n  **A**: It hangs sometimes, try refreshing or clearing cache.\n\n### Project Direction\n- **Q**: Should I remove the Unity Clanktank?  \n  **A**: Keep a backup of Unity clank tank just in case, but it's unclear what the plans are when making the same shows in multiple platforms.\n\n- **Q**: How can a token get certification/verification?  \n  **A**: There's a small number of verified projects from teams they're in touch with. This will evolve over time.\n\n## Community Help & Collaboration\n\n1. **Token Creation Issues**:\n   - **Helper**: Kenk\n   - **Helpee**: casper\n   - **Context**: Token not showing up after creation\n   - **Resolution**: Explained that the token was launched before the website was publicly announced, causing the launch not to execute. Advised to use auto.fun site to re-launch.\n\n2. **QUILL Token Incident**:\n   - **Helper**: eskender.eth\n   - **Helpee**: Multiple users concerned about QUILL\n   - **Context**: Explaining the nature of the QUILL token issue\n   - **Resolution**: Clarified it was a bug not an exploit, explained the technical issue, and informed that affected users would be refunded.\n\n3. **Discord Verification Issues**:\n   - **Helper**: Kenk\n   - **Helpee**: DearDaniel\n   - **Context**: DearDaniel believed he was banned from the partner chat\n   - **Resolution**: Kenk explained it was likely a verification issue affecting some users since April 18th, not an actual ban.\n\n4. **Character Animation System**:\n   - **Helper**: boom\n   - **Helpee**: Unspecified team members\n   - **Context**: Sharing correct morphtarget/blendkey order for character visemes\n   - **Resolution**: Provided reference image showing the required order for the first 15 blendkeys.\n\n5. **NSFW Content Creation**:\n   - **Helper**: yikesawjeez\n   - **Helpee**: Patt\n   - **Context**: Patt mentioned needing good uncensored custom models via API for NSFW content\n   - **Resolution**: yikesawjeez offered guidance on using comfyui with civit loras on runpod to create an API.\n\n## Action Items\n\n### Technical\n- Fix the bug that incorrectly shows token amounts per SOL in migrations (mentioned by eskender.eth)\n- Process refunds in SOL to users affected by the QUILL token issue (mentioned by eskender.eth)\n- Resolve stuck token migrations that have been pending for extended periods (mentioned by nim)\n- Fix black screen issue when creating tokens (mentioned by Tocheee)\n- Implement Ledger support (mentioned by DearDaniel)\n- Review and approve Livepeer plugin PR #48 (mentioned by samdeveloper)\n- Investigate AI system crashes when typing in chat (mentioned by samdeveloper)\n- Implement token migration from ai16z to ElizaOS with bonus ratio for early adopters (mentioned by DorianD)\n- Contact exchanges (Kraken, Binance, etc.) to facilitate token swap (mentioned by DorianD)\n- Create voting module for the DAO (mentioned by shaw)\n- Develop solution for migrating DAO treasury funds during token swap (mentioned by DorianD)\n- Add Ai16z and DegenAI to Featured and Marketcap tabs on Auto.fun (mentioned by Void)\n- Fix viseme order and schema for each character (mentioned by boom)\n- Decide on Unity Clanktank implementation (mentioned by boom)\n- Bug fixes for website loading issues (mentioned by frank_grimes_sr)\n- Address LP (liquidity pool) bugs (mentioned by yikesawjeez)\n\n### Documentation\n- Document character file configuration (mentioned by Fwog)\n- Create documentation on the token verification process (mentioned by 洫ｧThanosDaSith24洫ｧ)\n- Improve communication channels for real-time updates during incidents (mentioned by Kenk)\n- Clarify Discord moderation roles and permissions (mentioned by kalshnikov and yikesawjeez)\n- Document required morphtarget/blendkey order (mentioned by boom)\n- Verification process clarification (mentioned by Kenk)\n\n### Feature\n- Revenue-generating AI agents (mentioned by abhi_ironman)\n- Unmoderated partner chat (mentioned by DearDaniel)\n- Highlight Clank Tank winners on autofun with voting for weekly winners (mentioned by Curtisdonthurtus)\n- Create eli5 bot for explaining concepts (mentioned by DorianD and yikesawjeez)\n- Make the token creation process more reliable across devices (mentioned by Akuma The Pirate)\n- Consider implementing bug bounty & auditing services (mentioned by yikesawjeez)"
        },
        {
          "filename": "2025-04-25.md",
          "content": "# elizaOS Discord - 2025-04-25\n\n## Overall Discussion Highlights\n\n### Auto.fun Platform Launch and Development\n- **Platform Launch**: Shaw announced the launch of auto.fun, a new token launchpad that has been open-sourced. The platform generated $12 million in volume within 12 hours of launch and approximately $2k in fees in a single day.\n- **Technical Status**: The platform has been operational for less than a week. Users reported various technical issues including tokens not appearing after creation, migration delays, and UI problems.\n- **Community Reception**: Partners and community members actively tested the platform and provided detailed feedback about bugs and feature requests.\n- **Security Concerns**: A significant incident occurred with the $QUILL token, where a bug incorrectly displayed token pricing, allowing someone to drain the LP pool. The team acknowledged this as a platform bug (not an exploit) and promised refunds to affected users.\n- **Integration Features**: The platform includes agent-building capabilities through Fleek integration, allowing token creators to build AI agents for their projects.\n\n### ElizaOS v2 Development\n- **Plugin System Challenges**: Developers are struggling with database connections, plugin registration, and general setup of ElizaOS agents in v2.\n- **SQL Plugin Issues**: Multiple users reported errors like \"No version matching '^0.25.6' found\" and database connection timeouts.\n- **Custom Plugin Development**: Developers are working on custom plugins including blockchain functionality (EVM plugin for ETH transfers) and a Livepeer plugin offering \"free incentivized inference.\"\n- **Documentation Concerns**: The v2 documentation was described as \"too simple,\" with confusion about the correct approach for development (v2-develop branch vs. elizaos create project).\n\n### Token Migration and Ecosystem\n- **ElizaOS Token**: The elizaOS token (formerly ai16z) was trading around $0.25 with a market cap of approximately $140M.\n- **Migration Issues**: Discussions about migrating the AI16z token away from daos.fun to auto.fun due to frustrations with the current platform. Several projects like AutoPupper and Quilliana AI reported contract migration issues.\n- **Buyback Plans**: Auto.fun will drive buybacks for DegenAI tokens, with ai16z driving buyback on degenai.\n\n### 3D AI Animation Project\n- **Lip-Syncing Implementation**: Team is working on AI-driven character animations with lip-syncing capabilities, focusing on mapping visemes (visual phonemes) for character models to work with Oculus tools.\n- **Show Runner Development**: Boom is implementing a system that processes pre-generated JSON files and audio files to animate characters.\n- **Workflow Design**: The team is developing a process where the system generates show configurations and audio files, which are then processed by Unity to create animations with proper lip-syncing.\n\n## Key Questions & Answers\n\n### Auto.fun Platform\n- **Q**: What decides if a project gets featured on auto.fun? (asked by Curtisdonthurtus)  \n  **A**: Shaw indicated they would pin the main projects and that featured spots could potentially be sold.\n\n- **Q**: Is Ledger supported on auto.fun? (asked by Seppmos)  \n  **A**: \"Correct, unfortunately this isn't supported at the moment, have logged this with the team to take a look at.\" (answered by Kenk)\n\n- **Q**: How long does migration take? (asked by anon)  \n  **A**: \"it's happening right now, think we know why it is happening also\" (answered by Kenk)\n\n- **Q**: What happened with the $QUILL token? (asked by Dom 汳)  \n  **A**: There was a bug that incorrectly showed the amount of Quill per SOL, allowing someone to drain the LP by selling at a premium (answered by eskender.eth and Kenk)\n\n- **Q**: Will users who bought $QUILL be refunded? (asked by fen sama)  \n  **A**: Yes, all users who bought this token will be refunded in SOL post-fix (answered by eskender.eth)\n\n- **Q**: How to create agents in the current auto.fun? (asked by abhi_ironman)  \n  **A**: If you're the token creator, you will see a button to create agents with fleek on the token page. (answered by ben)\n\n### ElizaOS Development\n- **Q**: Is elizaOs sunset after v2? (asked by orayo)  \n  **A**: No it is not going to be sunset (answered by Kenk)\n\n- **Q**: Is pasting links on knowledge works? or we need text? (asked by Fwog)  \n  **A**: Pretty sure you'll need text (answered by Kenk)\n\n- **Q**: What is the future of Auto.fun in the roadmap and development plan from Shaw and the ElizaOS team? (asked by Johny)  \n  **A**: The team is working on Eliza v2 and auto.fun, focusing on open source development rather than strict roadmaps (answered by Osint)\n\n- **Q**: Does degenai v2 include tokenomics? (asked by deki)  \n  **A**: V2 is just the open source release of elizaOS (answered by Odilitime)\n\n### 3D AI Animation\n- **Q**: Do you need Unity to run the show runner? (implied by boom)  \n  **A**: No, there's a drop-down that lets you choose unity or no unity. (answered by SM Sith Lord)\n\n## Community Help & Collaboration\n\n### Platform Testing and Feedback\n- **Helper**: Curtisdonthurtus | **Helpee**: shaw  \n  **Context**: Extensive QA testing of auto.fun platform, identifying numerous bugs and UI issues  \n  **Resolution**: Shaw acknowledged the feedback and implemented fixes, saying \"Great feedback\" and \"Will make a few fixes\"\n\n- **Helper**: yikesawjeez | **Helpee**: shaw  \n  **Context**: Identified that \"generate occasionally works but is throwing 'not found' error every time despite (incl when works)\"  \n  **Resolution**: Shaw acknowledged and fixed most issues\n\n### Technical Support\n- **Helper**: Osint | **Helpee**: 洫ｧThanosDaSith24洫ｧ  \n  **Context**: Founder of Quilliana AI seeking help with contract issues  \n  **Resolution**: Osint directed them to contact Rick who could help connect them with the right person\n\n- **Helper**: Kenk | **Helpee**: DearDaniel  \n  **Context**: User believed they were banned from the partner chat  \n  **Resolution**: Kenk explained it was likely a verification issue affecting some users since April 18th, not a ban\n\n- **Helper**: Osint | **Helpee**: Hunterxsol  \n  **Context**: User couldn't find their $PXC token on the platform  \n  **Resolution**: Osint provided a direct link to the token showing it was still accessible\n\n- **Helper**: ben | **Helpee**: abhi_ironman  \n  **Context**: User wanted to know how to create agents on auto.fun  \n  **Resolution**: Explained that token creators will see a button to create agents with fleek on the token page\n\n### Development Assistance\n- **Helper**: lantianlaoli | **Helpee**: samdeveloper  \n  **Context**: Error with plugin version in v2  \n  **Resolution**: Explained \"The V2 version of the plugin requires you to use the elizaos command to actively download it\"\n\n- **Helper**: Kenk | **Helpee**: samdeveloper  \n  **Context**: Looking for blockchain integration examples  \n  **Resolution**: Suggested looking at Bio Agent plugin with links to documentation and tutorial\n\n- **Helper**: SM Sith Lord | **Helpee**: boom  \n  **Context**: Confusion about show runner requirements and development approach  \n  **Resolution**: Clarified that Unity isn't required and outlined a phased approach - first parse existing files, then develop generation capabilities\n\n## Action Items\n\n### Technical\n- Fix \"not found\" error when generating images on auto.fun (Mentioned by Curtisdonthurtus)\n- Fix issue where platform takes SOL but doesn't create tokens (Mentioned by Cﾎ年CER)\n- Fix backend issue preventing token migrations to Raydium (Mentioned by Multiple users)\n- Fix bug with token price representation in bonding curves (Mentioned by eskender.eth)\n- Fix black screen issue when creating new tokens (Mentioned by Tocheee)\n- Fix mobile version price display (Mentioned by abhi_ironman)\n- Fix \"failed to claim fees\" error (Mentioned by yikesawjeez)\n- Fix chat lag/duplicate message issue on auto.fun (Mentioned by Curtisdonthurtus)\n- Fix \"failed to download image\" error (Mentioned by Curtisdonthurtus)\n- Fix audio and video not working on AI create (Mentioned by Curtisdonthurtus)\n- Fix Pro button for image generation (Mentioned by Curtisdonthurtus)\n- Fix duplicate project images under MC page full view (Mentioned by Curtisdonthurtus)\n- Fix blinking white prompt when copying wallet address (Mentioned by Curtisdonthurtus)\n- Fix social links not saving (Mentioned by yikesawjeez)\n- Fix SQL plugin connection issues with Neon database (Mentioned by samdeveloper)\n- Fix agent crashes during chat interactions (Mentioned by samdeveloper)\n- Fix issue with Eliza getting stuck in \"None\" action when retrying failed actions (Mentioned by egoarka)\n- Fix verification issues affecting some users since April 18th (Mentioned by Kenk)\n- Fix viseme ordering in character models to match Oculus requirements (Mentioned by boom)\n- Fix the ElizaOS JSON endpoint that returns no data (Mentioned by jin)\n- Implement ETH transfer functionality using @Elizaos/plugin-evm (Mentioned by samdeveloper)\n- Implement Ledger hardware wallet support (Mentioned by DorianD)\n- Add DDOS/spam protection to auto.fun (Mentioned by Void)\n- Implement show stepping from pregenerated audio and JSON (Mentioned by boom)\n- Create standalone episode generator tool after parsing functionality is complete (Mentioned by SM Sith Lord)\n- Address platform stability issues (Mentioned by yikesawjeez)\n- Implement security audits and bug bounties (Mentioned by yikesawjeez)\n- Investigate token launch with abnormal market cap (Mentioned by frank_grimes_sr)\n- Update Dexscreener link and image in line with official announcement (Mentioned by Avanc)\n- Update Binance Alpha profile (Mentioned by Odilitime)\n\n### Documentation\n- Create clear documentation for adding existing projects to auto.fun (Mentioned by shadows.13)\n- Create clear documentation on token migration process (Mentioned by Multiple users)\n- Explain verification process for tokens (Mentioned by 洫ｧThanosDaSith24洫ｧ)\n- Improve documentation for plugin development in v2 (Mentioned by lantianlaoli)\n- Create a bug reporting system/ticket system (Mentioned by DorianD)\n- Create comprehensive documentation for auto.fun (Mentioned by abhi_ironman)\n- Document proper viseme schema for artists (first 15 blend keys need specific ordering) (Mentioned by boom)\n\n### Feature\n- Pin ai16z and degenai on the featured tab (Mentioned by Void)\n- Highlight Clank Tank winners on auto.fun (Mentioned by Curtisdonthurtus)\n- Implement token migration from ai16z to ElizaOS (Mentioned by shaw)\n- Add voting functionality to auto.fun (Mentioned by shaw)\n- Improve token creation reliability (Mentioned by Cﾎ年CER)\n- Improve trading chart functionality (Mentioned by Prowler)\n- Allow editing token descriptions (Mentioned by MDMnvest)\n- Consider implementing a Telegram bot for trading (Mentioned by mdj7347)\n- Develop revenue-generating AI agents (Mentioned by Osint, abhi_ironman)\n- Review and approve Livepeer plugin PR that offers free incentivized inference (Mentioned by samdeveloper)\n- Add Discord link to Bento.me/SpartanVersus profile (Mentioned by Void)\n- Add affiliate badge with ElizaOS to the second Twitter account (Mentioned by Void)\n- Implement DegenAI V2 as open source release of elizaOS (Mentioned by Odilitime)\n- Continue buyback plan for DegenAI through auto.fun platform (Mentioned by Void)"
        },
        {
          "filename": "2025-04-24.md",
          "content": "# elizaOS Discord - 2025-04-24\n\n## Overall Discussion Highlights\n\n### Auto.fun Platform Updates\n- **Maintenance and Relaunch**: Auto.fun was temporarily down for maintenance to improve cache and database capabilities to handle increased workload, and was later brought back online as announced by Shaw.\n- **Performance**: The successful relaunch generated $12 million in volume within 12 hours, demonstrating strong market interest despite the initial setbacks.\n- **Technical Issues**: Users experienced several problems including tokens not appearing in the UI despite successful on-chain transactions, migration delays, and trading difficulties.\n- **Fleek Integration**: The Autofun team integrated Fleek for no-code agent building functionality, allowing token creators to launch agents alongside their tokens.\n- **Launch Partners**: Launch partner spotlights will begin with FightFI, followed by one launch per day over two weeks.\n\n### ElizaOS V2 Development\n- **Swarm Integration**: ElizaOS V2 features the Swarm integration which enables agent collaboration through Multi-agent Coordination Protocol (MCP).\n- **Swarm Functionality**: Allows agents to share vector memory, use the same wallet safely, chain tasks in sequence, learn over time, and act as one hive mind.\n- **Plugin Development Challenges**: Users are struggling with the transition to v2, which appears to have significant architectural changes from previous versions.\n- **Model Support**: V2 supports local-ai, grok/groq, and ollama, but users noted limited LLM options compared to v1.\n\n### Spartan/DegenAI V2\n- **Active Development**: Odilitime clarified that DegenAI is still actively being developed, addressing concerns about it being \"abandoned.\"\n- **Token Relationship**: \"Every ai16z tx has the carry and creates buy pressure on degenai.\"\n- **Open Source**: A version of Spartan is available on the v2-develop branch of the elizaos/eliza repository.\n- **Resource Consolidation**: The team created a Bento.me page to consolidate DegenAI links.\n\n### 3D AI TV Development\n- **Viseme Implementation**: Technical challenges related to implementing visemes (visual mouth positions for speech) in a 3D AI show system.\n- **Workflow Improvements**: Discussion about creating a version of the runner that just generates show JSON and audio without requiring the full Unity implementation.\n\n## Key Questions & Answers\n\n### Auto.fun & Platform\n**Q**: How to create agents in the current auto.fun?  \n**A**: If you're the token creator, you will see a button to create agents with fleek on the token page. (answered by ben)\n\n**Q**: Why isn't my token migrating?  \n**A**: It can take time; some tokens need manual migration due to a known issue with a fix underway. (answered by Kenk)\n\n**Q**: How many SOL does it take to buy 50% of auto.fun token pre-launch?  \n**A**: Around 20-30 SOL for 60% of tokens. (answered by iprintmoney)\n\n### ElizaOS V2\n**Q**: How is the concept of Swarms intended in Eliza V2?  \n**A**: Swarms in ElizaOS V2 enable agent collaboration through Multi-agent Coordination Protocol, allowing agents to share vector memory, use the same wallet safely, chain tasks in sequence, learn over time, and act as one hive mind. (answered by Osint)\n\n**Q**: When and if will there be a tokenomics paper, an autodotfun and eliza v2 documentation?  \n**A**: Yes, there will be all three. ElizaOS V2 documentation is available at www.eliza.how. (answered by Kenk)\n\n**Q**: How to add plugin about V2? The elizaos project add-plugin command not work.  \n**A**: Use the character file's plugin field or clone v2-develop and copy an existing plugin. (answered by Odilitime)\n\n**Q**: Why doesn't v2 support the deepseek model?  \n**A**: V2 is missing a lot still but supports local-ai, grok/groq, and ollama. (answered by Odilitime)\n\n**Q**: Is elizaOs sunset after v2?  \n**A**: No, it is not going to be sunset. (answered by Kenk)\n\n### Spartan/DegenAI\n**Q**: What is the DegenAI X account?  \n**A**: That's the original dude from CT Shaw based the bot on. (answered by Odilitime)\n\n**Q**: When is Spartan going to be open sourced?  \n**A**: There's a version of him on the v2-develop branch on the elizaos/eliza repo. (answered by Odilitime)\n\n**Q**: I want to know more details about further DegenAI buyback plans?  \n**A**: I have nothing else for you at this time. ai16z drives buy back on degenai. (answered by Odilitime)\n\n### 3D AI TV\n**Q**: Do you need Unity to run the show runner?  \n**A**: No, there's a drop-down that lets you choose unity or no unity. (answered by SM Sith Lord)\n\n## Community Help & Collaboration\n\n### Auto.fun Support\n- **Token Visibility Issues**: Osint helped Hunterxsol locate their missing $PXC token on the platform and provided the link, showing it had -27.11 SOL.\n- **Token Creation Problems**: Osint advised Cﾎ年CER to use the support button at the bottom of the app when the platform took SOL without creating the coin.\n- **Agent Creation Guidance**: Ben explained to abhi_ironman that token creators will see a button to create agents with fleek on the token page.\n\n### ElizaOS V2 Assistance\n- **Telegram Integration**: Santgr shared that to get Telegram working on elizaos v2, users need to disable \"Privacy Mode\" in BotFather, then kick and re-add the bot to groups.\n- **Plugin Development**: Odilitime helped lantianlaoli with adding plugins in v2, suggesting to use character file's plugin field or clone v2-develop and copy an existing plugin.\n- **Wallet Integration**: Lantianlaoli advised blackpink on creating wallet connection functionality by modifying frontend and customizing solana plugin to allow user signing.\n\n### Platform Testing & QA\n- **Thorough Testing**: Curtisdonthurtus provided extensive QA testing of auto.fun dev version, identifying numerous bugs including image generation errors, chat lag, download failures, and duplicate project listings.\n- **DevOps Support**: Yikesawjeez offered DevOps assistance with autoscaling/k8s and to build a portal website with wallet verification for partners.\n\n### 3D AI TV Development\n- **Development Approach**: SM Sith Lord helped boom by clarifying that Unity isn't required for the show runner and outlined a step-by-step development path, suggesting to first parse & process pre-generated show_config.json and MP3s before worrying about generating new content.\n\n## Action Items\n\n### Technical\n- Fix token creation issues where platform takes SOL but doesn't create tokens (mentioned by Cﾎ年CER)\n- Address platform stability issues causing repeated downtime (mentioned by yikesawjeez)\n- Ensure token visibility remains consistent on the platform (mentioned by Hunterxsol)\n- Fix Ledger hardware wallet integration (mentioned by DorianD)\n- Implement spam/DDOS protection for auto.fun (mentioned by Void)\n- Fix image generation \"not found\" errors (mentioned by Curtisdonthurtus)\n- Resolve chat lag and duplicate message issues (mentioned by Curtisdonthurtus)\n- Fix token migration issues for projects (mentioned by Curtisdonthurtus)\n- Fix \"failed to download image\" error (mentioned by Curtisdonthurtus)\n- Fix plugin registration in v2 to properly initialize providers (mentioned by santgr)\n- Improve v2 support for additional LLM models beyond OpenAI and Anthropic (mentioned by lantianlaoli)\n- Fix DTS build errors in plugins (mentioned by santgr)\n- Resolve JSON parsing errors during agent initialization (mentioned by santgr)\n- Fix database connection issues with SQL plugin (mentioned by santgr)\n- Create plugin for user-controlled wallet integration (mentioned by blackpink)\n- Fix viseme ordering to match Oculus requirements (mentioned by boom)\n- Fix ElizaOS JSON endpoint (mentioned by jin)\n- Implement show stepping from pregenerated audio and JSON (mentioned by boom)\n- Create standalone episode generator (mentioned by SM Sith Lord)\n- Complete development of Spartan V2 integrated with ElizaOS V2 (mentioned by Odilitime)\n- Update Binance Alpha profile (mentioned by Odilitime)\n- Update Dexscreener link and image (mentioned by Avanc)\n\n### Documentation\n- Create comprehensive documentation for auto.fun platform (mentioned by abhi_ironman)\n- Document the Fleek integration for agent creation (mentioned by abhi_ironman)\n- Create better documentation for plugin creation in v2 (mentioned by Odilitime)\n- Update documentation to reflect actual code structure in v2 (mentioned by lantianlaoli)\n- Provide clear migration guide from v1 to v2 (mentioned by santgr)\n- Document proper viseme implementation (mentioned by boom)\n- Add Discord link to the Bento.me page (mentioned by Void)\n- Consider adding affiliate badge with ElizaOS to the token Twitter account (mentioned by Void)\n- Clarify expected migration times for tokens (mentioned by LunarFang_416)\n- Provide instructions for users with stuck tokens (mentioned by multiple users)\n- Provide clearer status updates during outages (mentioned by Void)\n- Create comprehensive documentation for Swarm functionality (mentioned by mariocandia)\n\n### Features\n- Improve token creation process to prevent failed transactions (mentioned by Cﾎ年CER)\n- Implement better support for token recovery or transaction issues (mentioned by Hunterxsol)\n- Consider blacklisting certain token names to prevent scams (mentioned by iprintmoney)\n- Pin ai16z and degenai on the featured tab (mentioned by Void)\n- Consider migrating to own the token and bridge liquidity to Base (mentioned by shaw)\n- Implement voting functionality on auto.fun (mentioned by shaw)\n- Support for user wallet connections instead of pre-set wallets (mentioned by blackpink)\n- Add support for deepseek model in v2 (mentioned by lantianlaoli)\n- Add placeholders for new content (mentioned by jin)\n- Create an AI-powered comedy generator trained on top comedians with blockchain integration (mentioned by boom)\n- Allow DegenAI account to post official announcements (mentioned by deki)\n- Create a linktree-like service for all Spartan/DegenAI links (mentioned by Odilitime)\n- Improve auto.fun UI/UX to be more user-friendly (mentioned by mdj7347)\n- Consider Telegram bot integration for easier trading across chains (mentioned by mdj7347)\n- Add ability to edit token descriptions (mentioned by MDMnvest)"
        }
      ],
      "dev_md_last_3_days": [
        {
          "filename": "2025-04-26.md",
          "content": "# elizaOS Development Discord - 2025-04-26\n\n## Overall Discussion Highlights\n\n### Deployment Architecture\n- Discussion about ElizaOS deployment strategies with PostgreSQL\n- Debate between using same-VPS PostgreSQL versus separate RDS instances\n- Odilitime recommended using PostgreSQL on the same VPS for simpler deployments\n\n### Project Licensing & Access\n- Confirmation that AUTO.FUN uses MIT licensing (documentation to be added)\n- Discord access links shared for ElizaOS (formerly AI16Z)\n- Community organization continuing around AI projects\n\n### Technical Development\n- RUBY character revival in AUTO.FUN being discussed\n- Original RUBY developer (43rdBigIdeaCEO) reconnecting with the community\n- Plugin configuration issues addressed with proper JSON formatting guidance\n\n## Key Questions & Answers\n\n**Q: When deploying Eliza, should PostgresDB be deployed separately?**  \nA: Odilitime suggested using PostgreSQL on the same VPS rather than a separate RDS instance for simpler setups.\n\n**Q: Can someone let me back into ElizaOS (formerly AI16Z)?**  \nA: Shaw provided the Discord invite link: https://discord.gg/ai16z\n\n**Q: What license is AUTO.FUN source code released under?**  \nA: Shaw confirmed MIT licensing and committed to adding proper documentation.\n\n**Q: Am I writing the plugin configuration statements correctly?**  \nA: Ruby identified syntax issues - missing commas between plugin entries and improperly nested secrets - and provided corrected JSON structure.\n\n## Community Help & Collaboration\n\n1. **Deployment Architecture Guidance**  \n   - Helper: Odilitime\n   - Helpee: Wes\n   - Context: Deployment architecture for ElizaOS with PostgreSQL\n   - Resolution: Suggested using PostgreSQL on the same VPS for simplicity\n\n2. **Discord Access Assistance**  \n   - Helper: Shaw\n   - Helpee: 43rdBigIdeaCEO\n   - Context: Needed access to ElizaOS Discord\n   - Resolution: Provided Discord invite link\n\n3. **Plugin Configuration Troubleshooting**  \n   - Helper: Ruby\n   - Helpee: ItzMrTobz\n   - Context: Incorrect JSON configuration for plugins\n   - Resolution: Provided corrected JSON structure with proper array formatting and nesting\n\n## Action Items\n\n### Documentation\n- Add MIT license documentation to the AUTO.FUN repository (Mentioned by Shaw)\n\n### Technical\n- Deploy ElizaOS with PostgreSQL database (either on same VPS or separate RDS) (Mentioned by Wes)\n- Fix plugin configuration JSON syntax with proper commas and nesting (Mentioned by Ruby)\n\n### Feature\n- Revive RUBY character in AUTO.FUN (Mentioned by 43rdBigIdeaCEO)"
        },
        {
          "filename": "2025-04-25.md",
          "content": "# elizaOS Development Discord - 2025-04-25\n\n## Overall Discussion Highlights\n\n### Auto.fun Project & ElizaOS Development\n- The Auto.fun project (related to ElizaOS) was a central topic of discussion\n- Clarification that the repository license is MIT, with shaw committing to add this to the codebase\n- Connection between Ruby and Auto.fun projects was mentioned, with the original creator of Ruby reaching out\n- Brand assets for Auto.fun were shared via Google Drive, though they appear limited in scope\n\n### Deployment Architecture\n- Discussions about deploying ElizaOS with PostgreSQL on AWS\n- One user plans to deploy Postgres to an RDS instance and ElizaOS on EC2\n- Common approach is using Postgres on the same VPS as ElizaOS\n- Brief mention of distributed systems complexity and architecture considerations\n\n### Plugin Development & Configuration\n- Technical discussion about plugin configuration syntax issues\n- Specific problems with JSON formatting, including missing commas and improper nesting\n- Twitter API integration with the client plugin was discussed\n- Request for WhatsApp client plugin in future versions\n\n### Community Management\n- Significant concern raised about an impersonator (\"solananes\") scamming users since May 2024\n- Invitation link provided to rejoin the AI16Z Discord server\n\n### File Organization\n- Issues raised about default behavior of storing project files in ~/.eliza directory\n- Challenges when managing multiple projects with the current file organization system\n\n## Key Questions & Answers\n\n**Q: When deploying Eliza, do you deploy the PostgresDB separately?**  \nA: \"I just use postgres in the same vps, rds seems to make sense for you\" (answered by Odilitime)\n\n**Q: What license is auto.fun source code released under?**  \nA: \"MIT, will add now\" (answered by shaw)\n\n**Q: Can we use normal Twitter API with it or just like browser without API?**  \nA: \"The client plugin-twitter uses [the API]\" (answered by Odilitime)\n\n**Q: Do we have brandkit for autofun?**  \nA: Shared Google Drive folder with banners and logos (answered by Nisita)\n\n**Q: Am I writing the statements correctly? Or am I doing something wrong with my plugins?**  \nA: \"The plugin syntax seems off - you're missing commas between the plugin entries and the secrets block isn't properly nested.\" (answered by Ruby)\n\n## Community Help & Collaboration\n\n1. **Plugin Configuration Help**\n   - Ruby provided properly formatted JSON structure to ItzMrTobz who was struggling with plugin configuration syntax\n   - cjft suggested using the \"format document\" right-click option as a simpler solution\n\n2. **Deployment Architecture Guidance**\n   - Odilitime advised Wes on deployment architecture for ElizaOS with PostgreSQL\n   - Confirmed using Postgres on same VPS is common, but RDS makes sense for AWS deployment\n\n3. **Multi-Project Management Solutions**\n   - Ruby suggested two approaches to LemonS for managing multiple projects:\n     - Using separate workspace directories with symlinks\n     - Configuring environment variables to override default paths\n\n4. **Brand Assets Sharing**\n   - Nisita shared Auto.fun brand assets with ElizaBAO沍 via Google Drive folder containing banners and logos\n\n## Action Items\n\n### Technical\n- **Add MIT license document to the repository** (Mentioned by shaw)\n- **Address impersonation scammer issue** - User \"solananes\" is impersonating team members and scamming people since May 2024 (Mentioned by DeFine)\n- **Fix JSON configuration syntax for plugins** with proper comma separation and nesting (Mentioned by Ruby)\n\n### Feature\n- **Consider WhatsApp client plugin for v2** - Request for WhatsApp integration in the next version (Mentioned by Fenil Modi)\n\n### Documentation\n- **Clarify Twitter API integration options** - Need to document whether normal Twitter API can be used or if it's browser-based only (Mentioned by AD)\n- **Improve file organization documentation** - Provide guidance on managing multiple projects and alternative file organization approaches (Implied from LemonS and Ruby's discussion)"
        },
        {
          "filename": "2025-04-24.md",
          "content": "# elizaOS Development Discord - 2025-04-24\n\n## Overall Discussion Highlights\n\n### Moderation & Security\n- Multiple instances of scammers impersonating team members (particularly Shaw) were reported\n- Users \"solanazo\" and \"solananes\" created threads to scam community members\n- Odilitime mentioned difficulties banning one of the impersonators\n- DeFine suggested implementing a moderation agent to help with scam detection\n\n### Development & Technical\n- Shaw shared a GitHub repository link (auto.fun)\n- Micha Vie mentioned their contributions through merged PRs and intention to continue contributing\n- Discussion about Twitter functionality in Eliza 2, including questions about AI-generated image posting\n- A question was raised about data persistence approaches in agent actions, specifically considering Prisma ORM\n- Brief mention of system architecture complexity in distributed systems\n\n### Project Management\n- Wolfy asked for confirmation on task ownership\n- LemonS raised concerns about file organization when working with multiple projects\n- Ruby suggested workspace directories with symlinks or environment variables as solutions\n\n### Branding & Resources\n- ElizaBAO requested branding assets for auto.fun\n- Nisita shared a Google Drive link containing logos and banners\n\n## Key Questions & Answers\n\n**Q: Is eliza 2 finally working with twitter?** (asked by AD)  \nA: Odilitime indicated there were \"Never had a problem with 1.x and Twitter\"\n\n**Q: Is there plugin for twitter API (not twitter client as android browser)?** (asked by AD)  \nA: Odilitime confirmed \"the client plugin-twitter uses does\"\n\n**Q: Do we have brandkit for autofun?** (asked by ElizaBAO沍)  \nA: Nisita shared a Google Drive link with banners and logos\n\n**Q: The images is AI generate or someone design?** (asked by ElizaBAO沍)  \nA: Odilitime replied \"someone designing and then using ai I think\"\n\n**Q: What's the best approach for file organization with multiple projects?** (asked by LemonS)  \nA: Ruby suggested using separate workspace directories with symlinks or utilizing environment variables to override default paths\n\n## Community Help & Collaboration\n\n1. **Branding Resources Sharing**\n   - ElizaBAO requested branding assets for auto.fun\n   - Nisita promptly shared a Google Drive folder with logos and banners\n\n2. **Role Upgrade for Contributor**\n   - Micha Vie mentioned their contributions and intention to continue\n   - Odilitime upgraded Micha Vie to contributor role to enable closer collaboration\n\n3. **File Organization Solutions**\n   - LemonS expressed frustration with default file organization\n   - Ruby offered two alternative approaches to improve workflow with multiple projects\n\n## Action Items\n\n### Technical\n- **Address impersonation/scam accounts in Discord server** (Mentioned by DeFine)\n  - Users \"solanazo\" and \"solananes\" impersonating Shaw and scamming users\n- **Follow up on ownership of unspecified tasks** (Mentioned by Wolfy)\n  - Confirm if certain team members want to own specific tasks\n\n### Feature\n- **Consider implementing a moderation agent** (Mentioned by DeFine)\n  - \"We really need an agent for looking at that stuff\" regarding scam detection\n- **Evaluate WhatsApp client plugin for v2** (Raised by Fenil Modi)\n  - No response yet, but identified as potential feature request\n\n### Documentation\n- **Provide system architecture details** (Requested by Ruby)\n  - inthiseconomy promised to check with their team for information\n- **Document file organization best practices** (Based on LemonS's feedback)\n  - Consider adding official guidance on managing multiple projects"
        }
      ]
    }
  },
  "github": {
    "summaries": {
      "week": [
        {
          "filename": "2025-04-27.md",
          "content": "# ElizaOS Weekly Update (Week of Apr 27, 2025)\n\n## OVERVIEW\nThis week saw significant improvements to the ElizaOS framework with a focus on enhancing developer experience, fixing critical bugs, and improving plugin functionality. Key achievements include scopable knowledge implementation, Discord plugin enhancements, and comprehensive CLI command updates.\n\n## PROJECT METRICS\n- PRs: 29 merged PR's, 31 new PRs\n- Issues: 0 new issues, 0 closed issues\n- Unique Contributors: 23\n- Code Changes: +6059/-21763 lines across 140 files\n- Total Commits: 92\n- Most Active Contributors: wtfsayo, lalalune, 0xbbjoker, tcm390, samarth30\n\n## TOP ISSUES\n\n### Plugin Integration Challenges\n- Several issues related to plugin functionality were addressed, particularly with Discord, Anthropic, and Twitter integrations\n- Error handling improvements were needed for various edge cases, including disk space limitations\n\n### Developer Experience Friction\n- CLI command instructions required updates to improve clarity and usability\n- Documentation links and image paths needed fixing to ensure proper resource accessibility\n- Environment setup and configuration issues in Docker containers needed resolution\n\n## KEY TECHNICAL DEVELOPMENTS\n\n### Enhanced Plugin Functionality\n- Added typing indicator support in Discord plugin [#4364](https://github.com/elizaos/eliza/pull/4364)\n- Implemented API key validation for Anthropic plugin model calls [#4383](https://github.com/elizaos/eliza/pull/4383)\n- Fixed Discord plugin error handling when services are missing [#4375](https://github.com/elizaos/eliza/pull/4375)\n- Added model/plugin name logging when models are used [#4394](https://github.com/elizaos/eliza/pull/4394)\n\n### Improved Developer Experience\n- Implemented scopable knowledge functionality [#4390](https://github.com/elizaos/eliza/pull/4390)\n- Updated ElizaOS create command instructions [#4381](https://github.com/elizaos/eliza/pull/4381)\n- Added automatic rebuild of core and plugin-bootstrap in monorepo context [#4388](https://github.com/elizaos/eliza/pull/4388)\n- Added .env.example in project-starter for easier configuration [#4387](https://github.com/elizaos/eliza/pull/4387)\n- Fixed ESM type declarations in Core [#4341](https://github.com/elizaos/eliza/pull/4341)\n- Updated documentation with improved quick start and CLI commands [#4379](https://github.com/elizaos/eliza/pull/4379)\n\n### Infrastructure and Maintenance\n- Fixed Postgres database issues in Docker containers [#4363](https://github.com/elizaos/eliza/pull/4363)\n- Improved error handling for disk space limitations [#4389](https://github.com/elizaos/eliza/pull/4389)\n- Fixed agent deletion functionality [#4395](https://github.com/elizaos/eliza/pull/4395)\n- Removed plugin-evm from monorepo [#4386](https://github.com/elizaos/eliza/pull/4386), [#4399](https://github.com/elizaos/eliza/pull/4399)\n- Enhanced UI with cleaner design and minor improvements [#4393](https://github.com/elizaos/eliza/pull/4393)"
        }
      ],
      "month": [
        {
          "filename": "2025-04-01.md",
          "content": "# ElizaOS Monthly Update (April 2025)\n\n## OVERVIEW\nApril saw significant enhancements to ElizaOS with major improvements to the CLI, GUI, and plugin ecosystem. Key achievements include expanded AI model provider integrations, enhanced messaging capabilities, improved TTS functionality, and substantial fixes to core components and plugins.\n\n## PROJECT METRICS\n- PRs: 195 merged PR's, 232 new PRs\n- Issues: 43 new issues, 35 closed issues\n- Unique Contributors: 88\n- Code Changes: +55467/-37251 lines across 489 files\n- Total Commits: 828\n- Most Active Contributors: wtfsayo, tcm390, 0xbbjoker, Samarthsinghal28, HarshModi2005\n\n## TOP ISSUES\n\n### CLI Usability and Consistency\n- Command inconsistencies between v1 and v2\n- Installation and update workflow issues\n- Project creation and agent management challenges\n\n### Plugin Management\n- Plugin installation priority ordering issues\n- Dynamic loading and versioning problems\n- Plugin dependency conflicts\n\n### AI Model Integration\n- JSON parsing errors with Anthropic and OpenAI responses\n- Model validation and authentication issues\n- Embedding model selection and configuration\n\n### Database and Transaction Handling\n- Transaction deadlocks in database operations\n- Migration issues with PgLite\n- Entity relationship inconsistencies\n\n### Messaging and Communication\n- Duplicate message creation\n- Twitter interaction failures\n- Telegram data synchronization problems\n\n### User Interface\n- Knowledge manager scroll issues\n- Missing UI components after merge conflicts\n- Inconsistent character creation workflow\n\n### Performance and Resource Management\n- Disk space management and error handling\n- Memory leaks and caching issues\n- Runtime initialization sequence problems\n\n### Documentation and Onboarding\n- Inconsistent or outdated CLI documentation\n- Missing environment configuration examples\n- Broken documentation links\n\n## KEY TECHNICAL DEVELOPMENTS\n\n### Enhanced AI Model Provider Ecosystem\n- Added Kluster AI as a model provider [#3938](https://github.com/elizaos/eliza/pull/3938)\n- Added Mem0 as AI SDK Provider [#3927](https://github.com/elizaos/eliza/pull/3927)\n- Improved OpenAI plugin with ability to choose embedding models [#4140](https://github.com/elizaos/eliza/pull/4140)\n- Added model/plugin name logging when model is used [#4394](https://github.com/elizaos/eliza/pull/4394)\n\n### Voice and Speech Capabilities\n- Implemented OpenAI TTS functionality [#4255](https://github.com/elizaos/eliza/pull/4255)\n- Added testing for OpenAI TTS [#4259](https://github.com/elizaos/eliza/pull/4259)\n- Fixed speech-to-text transcription issues [#4236](https://github.com/elizaos/eliza/pull/4236)\n- Fixed OpenAI STT functionality [#4329](https://github.com/elizaos/eliza/pull/4329)\n\n### CLI Improvements\n- Added update-cli command for easier updates [#4170](https://github.com/elizaos/eliza/pull/4170)\n- Enhanced CLI update and plugin installation with package manager [#4176](https://github.com/elizaos/eliza/pull/4176)\n- Implemented CLI test suite [#4301](https://github.com/elizaos/eliza/pull/4301)\n- Updated ElizaOS create command instructions [#4381](https://github.com/elizaos/eliza/pull/4381)\n\n### Messaging and Interaction Enhancements\n- Added message API for improved communication [#4247](https://github.com/elizaos/eliza/pull/4247)\n- Added message buttons for interactive responses [#4187](https://github.com/elizaos/eliza/pull/4187)\n- Improved Reply Action to use pre-generated responses [#4213](https://github.com/elizaos/eliza/pull/4213)\n- Added typing indicators to Telegram [#4280](https://github.com/elizaos/eliza/pull/4280) and Discord [#4364](https://github.com/elizaos/eliza/pull/4364)\n\n### Plugin System Improvements\n- Better plugin installation management [#4177](https://github.com/elizaos/eliza/pull/4177)\n- Added test coverage for plugin-bootstrap [#4173](https://github.com/elizaos/eliza/pull/4173)\n- Enabled path params routes for plugins [#4335](https://github.com/elizaos/eliza/pull/4335)\n- Fixed plugin install priority order [#4256](https://github.com/elizaos/eliza/pull/4256)\n\n### GUI Enhancements\n- Added support for importing JSON to create or update agents [#4270](https://github.com/elizaos/eliza/pull/4270)\n- Enhanced GUI with various improvements [#4300](https://github.com/elizaos/eliza/pull/4300)\n- Added confirmation dialog for delete group [#4310](https://github.com/elizaos/eliza/pull/4310)\n- Implemented onboarding tour [#4293](https://github.com/elizaos/eliza/pull/4293)\n\n### Social Media Integration\n- Enhanced Telegram logic with middlewares [#4125](https://github.com/elizaos/eliza/pull/4125)\n- Added Telegram community manager [#4134](https://github.com/elizaos/eliza/pull/4134)\n- Improved Twitter plugin with support for long tweets [#4291](https://github.com/elizaos/eliza/pull/4291)\n- Added deleteTweet() functionality [#4320](https://github.com/elizaos/eliza/pull/4320)\n\n### Knowledge and Memory Management\n- Implemented scopable knowledge [#4390](https://github.com/elizaos/eliza/pull/4390)\n- Fixed knowledge types [#4243](https://github.com/elizaos/eliza/pull/4243)\n- Replaced fastembed with local embedding model [#4205](https://github.com/elizaos/eliza/pull/4205)\n- Fixed cache interaction cursor and duplicate memory creation [#4155](https://github.com/elizaos/eliza/pull/4155)\n\n### Logging and Monitoring\n- Added OpenAI model usage events [#4230](https://github.com/elizaos/eliza/pull/4230)\n- Restored support for Cloudflare LLM logging/tracking [#4354](https://github.com/elizaos/eliza/pull/4354)\n- Added docstrings to cloudflare-logging [#4355](https://github.com/elizaos/eliza/pull/4355)\n- Improved logging for transcription models [#4283](https://github.com/elizaos/eliza/pull/4283)\n\n## SUMMARY\nApril 2025 was a productive month for ElizaOS with significant improvements across the platform. The team expanded AI model provider integrations, enhanced messaging capabilities, improved voice and speech features, and fixed numerous issues in the core system and plugins. The CLI and GUI received substantial upgrades, making the platform more user-friendly and robust. These developments have strengthened ElizaOS's position as a versatile, modular AI agent framework capable of operating across diverse ecosystems."
        }
      ]
    }
  }
}
